{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}F:\git\stata\output\15Jun2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Jun 2017, 08:20:49
{txt}
{com}. * -------------------------------------------------------
. 
. 
. 
. 
. /*
> * -------------------------------------------------------
> // Close the log, end the file
> log close
> exit

{txt}end of do-file

{com}. doedit

. do "F:\git\stata\pf01-3.do"
{txt}
{com}. *-------------------------------------------------------
. * project: 财政学研究方法，学期论文
. * dofile name: pf01-3.do
. * Jun 4th, 2017, Version 01-3.
. * Ren Qingjie, Peking University, renqingjie@pku.edu.cn
. *-------------------------------------------------------
. 
. *-------------------------------------------------------
. * Program Setup
. *-------------------------------------------------------
. 
. version 14              // Set Version number for backward compatibility
{txt}
{com}. set more off            // Disable partitioned output
{txt}
{com}. clear all               // Start with a clean slate
{txt}
{com}. set linesize 80         // Line size limit to make output more readable
{txt}
{com}. set matsize 5000                // Set Workspace 
{txt}
{com}.                                                 // Set Work Directory
. 
. global root "F:\git\stata"
{txt}
{com}. cap noi mkdir ${c -(}root{c )-}\output
{err}could not create directory F:\git\stata\output
{txt}
{com}. global output = "${c -(}root{c )-}\output\"
{txt}
{com}. 
. cd ${c -(}output{c )-}
{res}F:\git\stata\output
{txt}
{com}. local D = c(current_date)
{txt}
{com}. global D = subinstr("`D'"," ","",.)
{txt}
{com}. cap noi mkdir "$D"
{err}could not create directory 15Jun2017
{txt}
{com}. global today = "${c -(}output{c )-}\${c -(}D{c )-}"
{txt}
{com}. cd $today
{res}F:\git\stata\output\15Jun2017
{txt}
{com}. 
. /*
> macro drop _all         // clear all macros
> capture log close       // Close existing log files
> log using logfile.txt, replace       // Open log file
> * -------------------------------------------------------
> */
. 
. 
. 
. 
. ********** 清理数据**********
. 
. ****** 导入数据
. *** 处理地区编码
. * 导入地区编码的数据
. clear
{txt}
{com}. cd "F:\data\pf\统一的编码文件"
{res}F:\data\pf\统一的编码文件
{txt}
{com}. unicode analyze citycode_0.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate citycode_0.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. ** 导入数据
. cd $today
{res}F:\git\stata\output\15Jun2017
{txt}
{com}. use "F:\data\pf\统一的编码文件\citycode_0.dta", clear
{txt}
{com}. * 删除重复项，包括“县”，“市辖区”等
. duplicates drop city1, force

{p 0 4}{txt}Duplicates in terms of {res} city1{p_end}

{txt}(331 observations deleted)

{com}. rename city city_shortname
{res}{txt}
{com}. rename city1 city
{res}{txt}
{com}. save newcitycode.dta, replace
{txt}(note: file newcitycode.dta not found)
file newcitycode.dta saved

{com}. 
. 
. 
. 
. *** 数据编码方式修改
. clear
{txt}
{com}. cd "F:\data\pf\"
{res}F:\data\pf
{txt}
{com}. unicode analyze city_quyu.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate city_quyu.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. *** 导入数据
. cd $today
{res}F:\git\stata\output\15Jun2017
{txt}
{com}. use "F:\data\pf\city_quyu.dta", clear
{txt}
{com}. 
. *** 处理原数据
. * 将城市名称统一
. replace city=ustrregexs(1) if ustrregexm(city,"^.*?([\u4e00-\u9fa5]+).*$")
{txt}(897 real changes made)

{com}. * 重命名变量名 (非常长，大约100行)
. rename q1_1             land                    //土地面积
{res}{txt}
{com}. rename q1_3             pop                             //年底总人口
{res}{txt}
{com}. rename q1_3_1   pop_male                //男
{res}{txt}
{com}. rename q1_3_2   pop_female              //女
{res}{txt}
{com}. rename q1_3_3   pop_birth               //出生人口
{res}{txt}
{com}. rename q1_3_4   pop_death               //死亡人口
{res}{txt}
{com}. rename q1_4             family                  //年底总户数
{res}{txt}
{com}. rename q2_1             gdp                             //地区生产总值
{res}{txt}
{com}. rename q2_2             gdp_pri                 //第一产业地区生产总值
{res}{txt}
{com}. rename q2_3             gdp_sec                 //第二产业地区生产总值
{res}{txt}
{com}. rename q2_4             gdp_ind                 //工业生产总值
{res}{txt}
{com}. rename q2_5             gdp_thi                 //第三产业地区生产总值
{res}{txt}
{com}. rename q2_6             gdp_per                 //人均地区生产总值
{res}{txt}
{com}. rename q3_1     gdp_index               //地区生产总值指数
{res}{txt}
{com}. rename q3_2             gdp_index_pri   //第一产业地区生产总值指数
{res}{txt}
{com}. rename q3_3     gdp_index_sec
{res}{txt}
{com}. rename q3_4             gdp_index_ind
{res}{txt}
{com}. rename q3_5             gdp_index_thi
{res}{txt}
{com}. rename q3_6             gdp_index_per
{res}{txt}
{com}. rename q4_0             investment                              //全社会固定资产投资
{res}{txt}
{com}. rename q4_1             investment_urban                //不含农户
{res}{txt}
{com}. rename q4_2             investment_realestate   //房地产开发投资
{res}{txt}
{com}. rename q4_2_1   investment_rural                //农村投资
{res}{txt}
{com}. rename q6_1             fisrev                                  //公共预算收入
{res}{txt}
{com}. rename q6_2             fisrev_tax                              //税收收入
{res}{txt}
{com}. rename q6_3             fisrev_tax_vat                  //增值税
{res}{txt}
{com}. rename q6_4             fisrev_tax_op                   //营业税
{res}{txt}
{com}. rename q6_5             fisrev_tax_firm                 //企业所得税
{res}{txt}
{com}. rename q6_6             fisrev_tax_person               //个人所得税
{res}{txt}
{com}. rename q7_1             fisexp                                  //公共财政预算支出
{res}{txt}
{com}. rename q7_2             fisexp_edu                              //教育
{res}{txt}
{com}. rename q7_3     fisexp_security                 //社会保障和就业
{res}{txt}
{com}. rename q8_1             income_rural                    //农村居民人均可支配收入
{res}{txt}
{com}. rename q8_2             expend_rural                    //农村居民人均消费支出
{res}{txt}
{com}. rename q8_3             expend_rural_food               //食品支出
{res}{txt}
{com}. rename q8_4             income_urban                    //城镇居民人均可支配收入
{res}{txt}
{com}. rename q8_5             expend_urban                    //城镇居民人均消费支出
{res}{txt}
{com}. rename q8_6             expend_urban_food               //食品支出
{res}{txt}
{com}. rename q9_1             num_ind                                 //规模以上工业企业单位数
{res}{txt}
{com}. rename q9_1_1   num_ind_large                   //大型企业数量
{res}{txt}
{com}. rename q9_1_2   num_ind_medium                  //中型企业
{res}{txt}
{com}. rename q9_1_3   num_ind_small                   //小型企业
{res}{txt}
{com}. rename q9_0             output_ind                              //工业总产值
{res}{txt}
{com}. rename q9_0_4_2 output_ind_state                //国有及国有控股
{res}{txt}
{com}. rename q9_0_5   output_ind_domestic             //内资企业
{res}{txt}
{com}. rename q9_0_6   output_ind_hmt          //港澳台投资企业
{res}{txt}
{com}. rename q9_0_7   output_ind_frn          //外商投资企业
{res}{txt}
{com}. rename q9_2_1   inc_ind                         //工业企业增加值
{res}{txt}
{com}. rename q9_2_2   index_inc_ind           //工业企业增加值指数
{res}{txt}
{com}. rename q9_2             asset                           //资产合计
{res}{txt}
{com}. rename q9_3             debt                            //负债合计
{res}{txt}
{com}. rename q9_5             revenue                         //主营业务收入
{res}{txt}
{com}. rename q9_7             profit                          //利润总额
{res}{txt}
{com}. rename q10_1    miles                           //公路里程
{res}{txt}
{com}. rename q10_2    miles_grade                     //等级公路
{res}{txt}
{com}. rename q10_3    veh_civil                       //民用汽车
{res}{txt}
{com}. rename q10_4    veh_private                     //私人汽车
{res}{txt}
{com}. rename q11_0    post_telecom            //邮电业务总量
{res}{txt}
{com}. rename q11_2    telecom                         //电信业务总量
{res}{txt}
{com}. rename q11_3    landline                        //固定电话用户
{res}{txt}
{com}. rename q11_4    mobile                          //移动电话用户
{res}{txt}
{com}. rename q5_1             im_ex_port                      //货物进出口总额
{res}{txt}
{com}. rename q5_2             import                          //进口额
{res}{txt}
{com}. rename q5_3             export                          //出口额
{res}{txt}
{com}. rename q5_4             fdi                                     //外商直接投资实际使用额
{res}{txt}
{com}. rename q12_2    savings                         //金融机构人民币存款
{res}{txt}
{com}. rename q12_2_3  savings_firm            //企业存款
{res}{txt}
{com}. rename q12_2_4  savings_resident        //居民储蓄存款
{res}{txt}
{com}. rename q12_2_5  savings_fixed           //定期存款
{res}{txt}
{com}. rename q12_5    loan                            //金融机构人民币贷款
{res}{txt}
{com}. rename q12_5_2  loan_ind                        //工业贷款
{res}{txt}
{com}. rename q12_5_3  loan_busi                       //商业贷款
{res}{txt}
{com}. rename q12_5_4  loan_agri                       //农业贷款
{res}{txt}
{com}. rename q7_5             fisexp_agri                     //农林水利事务财政支出
{res}{txt}
{com}. rename q7_4             fisexp_health           //医疗卫生
{res}{txt}
{com}. rename q8_7             house_rural                     //农村人均住房面积
{res}{txt}
{com}. rename q9_1_5   num_ind_dom                     //内资企业个数
{res}{txt}
{com}. rename q9_1_6   num_ind_hmt                     //港澳台投资企业个数
{res}{txt}
{com}. rename q9_1_7   num_ind_frn                     //外商投资企业
{res}{txt}
{com}. rename q9_0_3   output_ind_large        //大型企业工业总产值
{res}{txt}
{com}. rename q9_0_4   output_ind_medium       //中型企业工业总产值
{res}{txt}
{com}. rename q9_0_4_1 output_ind_small        //小型企业工业总产值
{res}{txt}
{com}. rename q9_4             total_equity            //所有者权益
{res}{txt}
{com}. rename q9_8             total_vat                       //本年应交增值税
{res}{txt}
{com}. rename q9_9             num_employee            //从业人员年平均人数
{res}{txt}
{com}. rename q11_5    internet                        //互联网宽带接入用户数
{res}{txt}
{com}. rename q1_2             pop_per                         //常住人口
{res}{txt}
{com}. rename q9_0_1   output_ind_light        //轻工业
{res}{txt}
{com}. rename q9_0_2   output_ind_heavy        //重工业
{res}{txt}
{com}. rename q12_1    savings_rmbfrn          //金融机构本外币存款
{res}{txt}
{com}. rename q12_2_6  savings_cur                     //活期存款
{res}{txt}
{com}. rename q12_4    loan_rmbfrn                     //金融机构本外币贷款
{res}{txt}
{com}. rename q12_6    loan_short                      //短期贷款
{res}{txt}
{com}. rename q12_7    loan_long                       //中长期贷款
{res}{txt}
{com}. rename q12_7_1  loan_frn                        //境外贷款
{res}{txt}
{com}. rename q4_3             comhouse_sales          //商品房销售额
{res}{txt}
{com}. rename q4_4             house_sales                     //住宅销售额
{res}{txt}
{com}. rename q4_5             comhouse_sales_area     //商品房销售面积
{res}{txt}
{com}. rename q4_6             house_sales_area        //住宅销售面积
{res}{txt}
{com}. rename q8_8             house_area_urban        //城市人均住房面积
{res}{txt}
{com}. rename q11_1    post                            //邮电业务总量
{res}{txt}
{com}. rename q12_2_1  savings_danwei          //单位存款
{res}{txt}
{com}. rename q12_2_2  savings_geren           //个人存款
{res}{txt}
{com}. rename q12_3    savings_deposit         //储蓄存款
{res}{txt}
{com}. rename q7_6             house_security          //住房保障
{res}{txt}
{com}. rename q9_6             cost                            //主营业务成本  //终于结束了$-$
{res}{txt}
{com}. 
. * 转字符型变量为数值型
. foreach var of varlist pop-cost{c -(}
{txt}  2{com}.         destring `var', replace force
{txt}  3{com}. {c )-}
{txt}pop contains nonnumeric characters; pop {res}replaced {txt}as {res}double
{txt}(221 missing values generated)
{res}{txt}pop_male contains nonnumeric characters; pop_male {res}replaced {txt}as {res}double
{txt}(661 missing values generated)
{res}{txt}pop_female contains nonnumeric characters; pop_female {res}replaced {txt}as {res}double
{txt}(662 missing values generated)
{res}{txt}pop_birth contains nonnumeric characters; pop_birth {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}pop_death contains nonnumeric characters; pop_death {res}replaced {txt}as {res}double
{txt}(722 missing values generated)
{res}{txt}family contains nonnumeric characters; family {res}replaced {txt}as {res}double
{txt}(251 missing values generated)
{res}{txt}gdp contains nonnumeric characters; gdp {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_pri contains nonnumeric characters; gdp_pri {res}replaced {txt}as {res}double
{txt}(448 missing values generated)
{res}{txt}gdp_sec contains nonnumeric characters; gdp_sec {res}replaced {txt}as {res}double
{txt}(360 missing values generated)
{res}{txt}gdp_ind contains nonnumeric characters; gdp_ind {res}replaced {txt}as {res}double
{txt}(374 missing values generated)
{res}{txt}gdp_thi contains nonnumeric characters; gdp_thi {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_per contains nonnumeric characters; gdp_per {res}replaced {txt}as {res}double
{txt}(623 missing values generated)
{res}{txt}gdp_index contains nonnumeric characters; gdp_index {res}replaced {txt}as {res}double
{txt}(510 missing values generated)
{res}{txt}gdp_index_pri contains nonnumeric characters; gdp_index_pri {res}replaced {txt}as {res}double
{txt}(555 missing values generated)
{res}{txt}gdp_index_sec contains nonnumeric characters; gdp_index_sec {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_ind contains nonnumeric characters; gdp_index_ind {res}replaced {txt}as {res}double
{txt}(511 missing values generated)
{res}{txt}gdp_index_thi contains nonnumeric characters; gdp_index_thi {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_per contains nonnumeric characters; gdp_index_per {res}replaced {txt}as {res}double
{txt}(660 missing values generated)
{res}{txt}investment contains nonnumeric characters; investment {res}replaced {txt}as {res}double
{txt}(1174 missing values generated)
{res}{txt}investment_urban contains nonnumeric characters; investment_urban {res}replaced {txt}as {res}double
{txt}(188 missing values generated)
{res}{txt}investment_realestate contains nonnumeric characters; investment_realestate {res}replaced {txt}as {res}double
{txt}(246 missing values generated)
{res}{txt}investment_rural contains nonnumeric characters; investment_rural {res}replaced {txt}as {res}double
{txt}(1677 missing values generated)
{res}{txt}fisrev contains nonnumeric characters; fisrev {res}replaced {txt}as {res}double
{txt}(266 missing values generated)
{res}{txt}fisrev_tax contains nonnumeric characters; fisrev_tax {res}replaced {txt}as {res}double
{txt}(298 missing values generated)
{res}{txt}fisrev_tax_vat contains nonnumeric characters; fisrev_tax_vat {res}replaced {txt}as {res}double
{txt}(291 missing values generated)
{res}{txt}fisrev_tax_op contains nonnumeric characters; fisrev_tax_op {res}replaced {txt}as {res}double
{txt}(290 missing values generated)
{res}{txt}fisrev_tax_firm contains nonnumeric characters; fisrev_tax_firm {res}replaced {txt}as {res}double
{txt}(330 missing values generated)
{res}{txt}fisrev_tax_person contains nonnumeric characters; fisrev_tax_person {res}replaced {txt}as {res}double
{txt}(486 missing values generated)
{res}{txt}fisexp contains nonnumeric characters; fisexp {res}replaced {txt}as {res}double
{txt}(265 missing values generated)
{res}{txt}fisexp_edu contains nonnumeric characters; fisexp_edu {res}replaced {txt}as {res}double
{txt}(286 missing values generated)
{res}{txt}fisexp_security contains nonnumeric characters; fisexp_security {res}replaced {txt}as {res}double
{txt}(300 missing values generated)
{res}{txt}income_rural contains nonnumeric characters; income_rural {res}replaced {txt}as {res}double
{txt}(485 missing values generated)
{res}{txt}expend_rural contains nonnumeric characters; expend_rural {res}replaced {txt}as {res}double
{txt}(666 missing values generated)
{res}{txt}expend_rural_food contains nonnumeric characters; expend_rural_food {res}replaced {txt}as {res}double
{txt}(735 missing values generated)
{res}{txt}income_urban contains nonnumeric characters; income_urban {res}replaced {txt}as {res}double
{txt}(529 missing values generated)
{res}{txt}expend_urban contains nonnumeric characters; expend_urban {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}expend_urban_food contains nonnumeric characters; expend_urban_food {res}replaced {txt}as {res}double
{txt}(748 missing values generated)
{res}{txt}num_ind contains nonnumeric characters; num_ind {res}replaced {txt}as {res}long
{txt}(157 missing values generated)
{res}{txt}num_ind_large contains nonnumeric characters; num_ind_large {res}replaced {txt}as {res}int
{txt}(2205 missing values generated)
{res}{txt}num_ind_medium contains nonnumeric characters; num_ind_medium {res}replaced {txt}as {res}int
{txt}(1932 missing values generated)
{res}{txt}num_ind_small contains nonnumeric characters; num_ind_small {res}replaced {txt}as {res}long
{txt}(1884 missing values generated)
{res}{txt}output_ind contains nonnumeric characters; output_ind {res}replaced {txt}as {res}double
{txt}(993 missing values generated)
{res}{txt}output_ind_state contains nonnumeric characters; output_ind_state {res}replaced {txt}as {res}double
{txt}(1928 missing values generated)
{res}{txt}output_ind_domestic contains nonnumeric characters; output_ind_domestic {res}replaced {txt}as {res}double
{txt}(1057 missing values generated)
{res}{txt}output_ind_hmt contains nonnumeric characters; output_ind_hmt {res}replaced {txt}as {res}double
{txt}(1351 missing values generated)
{res}{txt}output_ind_frn contains nonnumeric characters; output_ind_frn {res}replaced {txt}as {res}double
{txt}(1328 missing values generated)
{res}{txt}inc_ind contains nonnumeric characters; inc_ind {res}replaced {txt}as {res}double
{txt}(2393 missing values generated)
{res}{txt}index_inc_ind contains nonnumeric characters; index_inc_ind {res}replaced {txt}as {res}double
{txt}(2584 missing values generated)
{res}{txt}asset contains nonnumeric characters; asset {res}replaced {txt}as {res}double
{txt}(584 missing values generated)
{res}{txt}debt contains nonnumeric characters; debt {res}replaced {txt}as {res}double
{txt}(579 missing values generated)
{res}{txt}revenue contains nonnumeric characters; revenue {res}replaced {txt}as {res}double
{txt}(585 missing values generated)
{res}{txt}profit contains nonnumeric characters; profit {res}replaced {txt}as {res}double
{txt}(602 missing values generated)
{res}{txt}miles contains nonnumeric characters; miles {res}replaced {txt}as {res}double
{txt}(674 missing values generated)
{res}{txt}miles_grade contains nonnumeric characters; miles_grade {res}replaced {txt}as {res}double
{txt}(708 missing values generated)
{res}{txt}veh_civil contains nonnumeric characters; veh_civil {res}replaced {txt}as {res}long
{txt}(846 missing values generated)
{res}{txt}veh_private contains nonnumeric characters; veh_private {res}replaced {txt}as {res}long
{txt}(899 missing values generated)
{res}{txt}post_telecom contains nonnumeric characters; post_telecom {res}replaced {txt}as {res}double
{txt}(1555 missing values generated)
{res}{txt}telecom contains nonnumeric characters; telecom {res}replaced {txt}as {res}double
{txt}(1559 missing values generated)
{res}{txt}landline contains nonnumeric characters; landline {res}replaced {txt}as {res}double
{txt}(916 missing values generated)
{res}{txt}mobile contains nonnumeric characters; mobile {res}replaced {txt}as {res}double
{txt}(933 missing values generated)
{res}{txt}im_ex_port contains nonnumeric characters; im_ex_port {res}replaced {txt}as {res}double
{txt}(557 missing values generated)
{res}{txt}import contains nonnumeric characters; import {res}replaced {txt}as {res}double
{txt}(646 missing values generated)
{res}{txt}export contains nonnumeric characters; export {res}replaced {txt}as {res}double
{txt}(565 missing values generated)
{res}{txt}fdi contains nonnumeric characters; fdi {res}replaced {txt}as {res}double
{txt}(740 missing values generated)
{res}{txt}savings contains nonnumeric characters; savings {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}savings_firm contains nonnumeric characters; savings_firm {res}replaced {txt}as {res}double
{txt}(1572 missing values generated)
{res}{txt}savings_resident contains nonnumeric characters; savings_resident {res}replaced {txt}as {res}double
{txt}(1556 missing values generated)
{res}{txt}savings_fixed contains nonnumeric characters; savings_fixed {res}replaced {txt}as {res}double
{txt}(1577 missing values generated)
{res}{txt}loan contains nonnumeric characters; loan {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}loan_ind contains nonnumeric characters; loan_ind {res}replaced {txt}as {res}double
{txt}(2030 missing values generated)
{res}{txt}loan_busi contains nonnumeric characters; loan_busi {res}replaced {txt}as {res}double
{txt}(2019 missing values generated)
{res}{txt}loan_agri contains nonnumeric characters; loan_agri {res}replaced {txt}as {res}double
{txt}(2021 missing values generated)
{res}{txt}fisexp_agri contains nonnumeric characters; fisexp_agri {res}replaced {txt}as {res}double
{txt}(802 missing values generated)
{res}{txt}fisexp_health contains nonnumeric characters; fisexp_health {res}replaced {txt}as {res}double
{txt}(720 missing values generated)
{res}{txt}house_rural contains nonnumeric characters; house_rural {res}replaced {txt}as {res}double
{txt}(1135 missing values generated)
{res}{txt}q9_1_4 contains nonnumeric characters; q9_1_4 {res}replaced {txt}as {res}int
{txt}(3227 missing values generated)
{res}{txt}num_ind_dom contains nonnumeric characters; num_ind_dom {res}replaced {txt}as {res}long
{txt}(3228 missing values generated)
{res}{txt}num_ind_hmt contains nonnumeric characters; num_ind_hmt {res}replaced {txt}as {res}int
{txt}(3273 missing values generated)
{res}{txt}num_ind_frn contains nonnumeric characters; num_ind_frn {res}replaced {txt}as {res}int
{txt}(3280 missing values generated)
{res}{txt}output_ind_large contains nonnumeric characters; output_ind_large {res}replaced {txt}as {res}double
{txt}(2513 missing values generated)
{res}{txt}output_ind_medium contains nonnumeric characters; output_ind_medium {res}replaced {txt}as {res}double
{txt}(2392 missing values generated)
{res}{txt}output_ind_small contains nonnumeric characters; output_ind_small {res}replaced {txt}as {res}double
{txt}(2785 missing values generated)
{res}{txt}total_equity contains nonnumeric characters; total_equity {res}replaced {txt}as {res}double
{txt}(1920 missing values generated)
{res}{txt}total_vat contains nonnumeric characters; total_vat {res}replaced {txt}as {res}double
{txt}(1931 missing values generated)
{res}{txt}num_employee contains nonnumeric characters; num_employee {res}replaced {txt}as {res}double
{txt}(2756 missing values generated)
{res}{txt}internet contains nonnumeric characters; internet {res}replaced {txt}as {res}double
{txt}(2083 missing values generated)
{res}{txt}pop_per contains nonnumeric characters; pop_per {res}replaced {txt}as {res}double
{txt}(2047 missing values generated)
{res}{txt}output_ind_light contains nonnumeric characters; output_ind_light {res}replaced {txt}as {res}double
{txt}(2804 missing values generated)
{res}{txt}output_ind_heavy contains nonnumeric characters; output_ind_heavy {res}replaced {txt}as {res}double
{txt}(2793 missing values generated)
{res}{txt}savings_rmbfrn contains nonnumeric characters; savings_rmbfrn {res}replaced {txt}as {res}double
{txt}(2246 missing values generated)
{res}{txt}savings_cur contains nonnumeric characters; savings_cur {res}replaced {txt}as {res}double
{txt}(3257 missing values generated)
{res}{txt}loan_rmbfrn contains nonnumeric characters; loan_rmbfrn {res}replaced {txt}as {res}double
{txt}(2249 missing values generated)
{res}{txt}q12_5_1 contains nonnumeric characters; q12_5_1 {res}replaced {txt}as {res}double
{txt}(2483 missing values generated)
{res}{txt}loan_short contains nonnumeric characters; loan_short {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_long contains nonnumeric characters; loan_long {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_frn contains nonnumeric characters; loan_frn {res}replaced {txt}as {res}double
{txt}(3127 missing values generated)
{res}{txt}comhouse_sales contains nonnumeric characters; comhouse_sales {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales contains nonnumeric characters; house_sales {res}replaced {txt}as {res}double
{txt}(2432 missing values generated)
{res}{txt}comhouse_sales_area contains nonnumeric characters; comhouse_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales_area contains nonnumeric characters; house_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_area_urban contains nonnumeric characters; house_area_urban {res}replaced {txt}as {res}double
{txt}(2745 missing values generated)
{res}{txt}post contains nonnumeric characters; post {res}replaced {txt}as {res}double
{txt}(2637 missing values generated)
{res}{txt}savings_danwei contains nonnumeric characters; savings_danwei {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_geren contains nonnumeric characters; savings_geren {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_deposit contains nonnumeric characters; savings_deposit {res}replaced {txt}as {res}double
{txt}(2898 missing values generated)
{res}{txt}house_security contains nonnumeric characters; house_security {res}replaced {txt}as {res}double
{txt}(3283 missing values generated)
{res}{txt}cost contains nonnumeric characters; cost {res}replaced {txt}as {res}double
{txt}(3264 missing values generated)
{res}{txt}
{com}. 
. * 和地区编码合并，便于进一步处理数据（比如施加省份的固定效应）
. merge m:1 city using newcitycode.dta
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           2,943
{txt}{col 9}from master{col 30}{res}             206{txt}  (_merge==1)
{col 9}from using{col 30}{res}           2,737{txt}  (_merge==2)

{col 5}matched{col 30}{res}           3,472{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. *** 处理成为平衡面板
. drop if city=="其他"
{txt}(61 observations deleted)

{com}. encode city, gen(cit)
{txt}
{com}. tsset cit year
{res}{txt}{col 8}panel variable:  {res}cit (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtbalance, range(2006 2013)

{txt}({res}2737{txt} observations deleted due to out of range) 

({res}281{txt} observations deleted due to discontinues) 

{com}. drop _merge
{txt}
{com}. 
. 
. *** 区分为省级数据和市级的数据，删去县（区）级的数据
. * 保存省级数据
. preserve 
{txt}
{com}. keep if level == 1
{txt}(3,088 observations deleted)

{com}. save province.dta, replace
{txt}(note: file province.dta not found)
file province.dta saved

{com}. restore
{txt}
{com}. * 保存市级数据
. keep if level == 2
{txt}(792 observations deleted)

{com}. save city.dta, replace
{txt}(note: file city.dta not found)
file city.dta saved

{com}. 
. * svvarlbl test.txt, replace  //生成变量名和标签
. 
. 
. 
. 
. 
. ********** 模型建立和模型识别 **********
. 
. ****** 生成相关变量
. tsset pref year
{res}{txt}{col 8}panel variable:  {res}pref (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtdes

    {txt}pref:  {res}1301{txt}, {res}1302{txt}, ..., {res}6543                             {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(pref*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX
{txt}
{com}. 
. *** 核心变量
. * 政府规模,被解释变量 财政预算支出/GDP
. gen govsize     = fisexp / gdp
{txt}(5 missing values generated)

{com}. * 政府的教育投入力度
. gen govedu  = fisexp_edu / gdp                  //相对于GDP
{txt}(23 missing values generated)

{com}. gen govedu1 = fisexp_edu / fisexp               //相对于财政支出
{txt}(23 missing values generated)

{com}. * 政府的社保等投入力度
. gen govsec  = fisexp_security / gdp             //相对于GDP
{txt}(20 missing values generated)

{com}. gen govsec1 = fisexp_security / fisexp  //相对于财政支出
{txt}(20 missing values generated)

{com}. 
. * 开放程度,核心解释变量 进出口总额/GDP
. gen     open = im_ex_port /10000/gdp
{txt}(175 missing values generated)

{com}. * 开放程度1, 进出口总额/(GDP-第三产业增加值), 参考Feenstra(1998)
. gen open1 = im_ex_port /10000 / (gdp-gdp_thi)
{txt}(176 missing values generated)

{com}. 
. *** 控制变量
. * 经济发展水平 人均GDP对数
. gen lngdppc = log(gdp_per)
{txt}(13 missing values generated)

{com}. * 地区规模 总人口取对数(常住人口/户籍人口)
. gen lnpop = log(pop)
{txt}(34 missing values generated)

{com}. * 是否是自治区 Autonomous Region
. gen anr = ((prov == 15) | (prov == 45) | (prov == 54) | (prov == 64) | (prov == 65))
{txt}
{com}. * 是否是直辖市 Municipal,(好像并没有)
. * gen mun = ((prov == 11) | (prov == 12) | (prov == 50) | (prov == 31))
. 
. 
. *** 固定效应
. * 年份固定效应
. tab year, gen(y)

       {txt}年份 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2006 {c |}{res}        318       12.50       12.50
{txt}       2007 {c |}{res}        318       12.50       25.00
{txt}       2008 {c |}{res}        318       12.50       37.50
{txt}       2009 {c |}{res}        318       12.50       50.00
{txt}       2010 {c |}{res}        318       12.50       62.50
{txt}       2011 {c |}{res}        318       12.50       75.00
{txt}       2012 {c |}{res}        318       12.50       87.50
{txt}       2013 {c |}{res}        318       12.50      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00
{txt}
{com}. * 省份固定效应
. tab prov, gen(p)

     {txt}省份代 {c |}
         码 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         13 {c |}{res}         88        3.46        3.46
{txt}         14 {c |}{res}         80        3.14        6.60
{txt}         15 {c |}{res}         88        3.46       10.06
{txt}         21 {c |}{res}        112        4.40       14.47
{txt}         22 {c |}{res}         72        2.83       17.30
{txt}         23 {c |}{res}        104        4.09       21.38
{txt}         32 {c |}{res}         96        3.77       25.16
{txt}         33 {c |}{res}         88        3.46       28.62
{txt}         34 {c |}{res}        120        4.72       33.33
{txt}         35 {c |}{res}         72        2.83       36.16
{txt}         36 {c |}{res}         88        3.46       39.62
{txt}         37 {c |}{res}        128        5.03       44.65
{txt}         41 {c |}{res}        136        5.35       50.00
{txt}         42 {c |}{res}         96        3.77       53.77
{txt}         43 {c |}{res}        112        4.40       58.18
{txt}         44 {c |}{res}        168        6.60       64.78
{txt}         45 {c |}{res}        112        4.40       69.18
{txt}         46 {c |}{res}         16        0.63       69.81
{txt}         51 {c |}{res}        168        6.60       76.42
{txt}         52 {c |}{res}         56        2.20       78.62
{txt}         53 {c |}{res}        112        4.40       83.02
{txt}         54 {c |}{res}         48        1.89       84.91
{txt}         61 {c |}{res}         80        3.14       88.05
{txt}         62 {c |}{res}        112        4.40       92.45
{txt}         63 {c |}{res}         48        1.89       94.34
{txt}         64 {c |}{res}         40        1.57       95.91
{txt}         65 {c |}{res}        104        4.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00
{txt}
{com}. 
. *** 滞后项
. gen lgovsize = L.govsize
{txt}(323 missing values generated)

{com}. gen lopen = L.open
{txt}(490 missing values generated)

{com}. 
. save city.dta, replace
{txt}file city.dta saved

{com}. 
. ****** 描述统计
. sum govsize govedu govedu1 govsec govsec1 open open1 lngdppc lnpop

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}      2,539    .2012762    .2009307   .0426532   3.580979
{txt}{space 6}govedu {c |}{res}      2,521     .036075    .0294101   .0003037   .2606915
{txt}{space 5}govedu1 {c |}{res}      2,521     .187324    .0466493   .0015361   .3657038
{txt}{space 6}govsec {c |}{res}      2,524    .0256393    .0738396   .0003068   2.724105
{txt}{space 5}govsec1 {c |}{res}      2,524    .1168456    .0555975   .0011891   .7607152
{txt}{hline 13}{c +}{hline 57}
{space 8}open {c |}{res}      2,369    .0285571    .0504232   2.17e-06   .4720682
{txt}{space 7}open1 {c |}{res}      2,368    .0471931    .1119791  -3.022129   .8528503
{txt}{space 5}lngdppc {c |}{res}      2,531    10.06319    .7098018   7.921173   12.18958
{txt}{space 7}lnpop {c |}{res}      2,510    5.660586    .8375934   2.104134   7.080027
{txt}
{com}. outreg2 using stats, tex sum(log) keep(govsize govedu govedu1 govsec govsec1 open open1 lngdppc lnpop ) replace

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}year {c |}{res}      2,544      2009.5    2.291738       2006       2013
{txt}{space 9}pop {c |}{res}      2,511    375.7607    242.6736     -340.6       1188
{txt}{space 4}pop_male {c |}{res}      2,170    191.7634    123.4502        4.1      605.2
{txt}{space 2}pop_female {c |}{res}      2,173    181.4287     117.337          4      587.4
{txt}{space 3}pop_birth {c |}{res}      2,158    4.476362    3.550213        .06      38.45
{txt}{hline 13}{c +}{hline 57}
{space 3}pop_death {c |}{res}      2,143    2.311041    1.785941        .02      17.59
{txt}{space 6}family {c |}{res}      2,484    116.8741    74.77018        2.1        483
{txt}{space 9}gdp {c |}{res}      2,543    1174.702    1515.672        8.7    15420.1
{txt}{space 5}gdp_pri {c |}{res}      2,543    114.5705    90.18173        1.4      592.6
{txt}{space 5}gdp_sec {c |}{res}      2,540    603.9244    767.6414        1.3     6849.6
{txt}{hline 13}{c +}{hline 57}
{space 5}gdp_ind {c |}{res}      2,526    535.6636    696.5804         .1     6370.4
{txt}{space 5}gdp_thi {c |}{res}      2,542    457.1422    741.7837        3.5     9963.9
{txt}{space 5}gdp_per {c |}{res}      2,531     30155.3    23557.43       2755     196728
{txt}{space 3}gdp_index {c |}{res}      2,521    113.1344    3.329225       64.3      132.9
{txt}gdp_index~ri {c |}{res}      2,529    105.3422    3.352498       60.6      138.6
{txt}{hline 13}{c +}{hline 57}
gdp_index_~c {c |}{res}      2,531    116.8264    20.85602       44.1       1111
{txt}gdp_index_~d {c |}{res}      2,521    116.6305    15.01306         15      629.3
{txt}gdp_index~hi {c |}{res}      2,529     112.454    3.590477         78      161.1
{txt}gdp_index_~r {c |}{res}      2,502    112.5876    4.792824         12      147.6
{txt}{space 2}investment {c |}{res}      1,746    537.4538    626.8112       6.13    4995.65
{txt}{hline 13}{c +}{hline 57}
investment~n {c |}{res}      2,518     652.747    802.3256       6.13     6501.1
{txt}investment~e {c |}{res}      2,489    127.7838    229.2629        .02       2184
{txt}investment~l {c |}{res}      1,486    83.63207    122.6049         -3     912.55
{txt}{space 6}fisrev {c |}{res}      2,537    85.93057    141.6768        .19    1731.26
{txt}{space 2}fisrev_tax {c |}{res}      2,529    67.10539    119.5722        .13    1498.92
{txt}{hline 13}{c +}{hline 57}
fisrev_tax~t {c |}{res}      2,524    11.94103    26.72752        .01        840
{txt}fisrev_tax~p {c |}{res}      2,524    20.19419    37.31859         .1     423.22
{txt}fisrev_tax~m {c |}{res}      2,497    8.486792     20.0518          0     288.42
{txt}fisrev_tax~n {c |}{res}      2,485    3.690358    16.01501        .01        547
{txt}{space 6}fisexp {c |}{res}      2,540    154.0166    157.9499        4.7    1690.83
{txt}{hline 13}{c +}{hline 57}
{space 2}fisexp_edu {c |}{res}      2,522    28.13598    26.74289        .12     287.73
{txt}fisexp_sec~y {c |}{res}      2,525    17.53528    16.80335        .02     149.25
{txt}income_rural {c |}{res}      2,526     6403.44    3215.242       1417      27214
{txt}expend_rural {c |}{res}      2,361    4547.749    2213.205       1172      17003
{txt}expend_rur~d {c |}{res}      2,315    1857.613     816.419        356       6291
{txt}{hline 13}{c +}{hline 57}
income_urban {c |}{res}      2,505    16740.02    6827.952       5385     164741
{txt}expend_urban {c |}{res}      2,445    11623.58    4095.709       4289      33251
{txt}expend_urb~d {c |}{res}      2,407    4307.037    1431.231        728      11704
{txt}{space 5}num_ind {c |}{res}      2,532    1037.385    1548.225          1      13720
{txt}num_ind_la~e {c |}{res}      1,043    11.44104     21.6738          1        436
{txt}{hline 13}{c +}{hline 57}
num_ind_me~m {c |}{res}      1,225    97.23347    171.1925          1       1635
{txt}num_ind_sm~l {c |}{res}      1,267    916.8043    1454.369          2      11924
{txt}{space 2}output_ind {c |}{res}      1,897    1509.981    2439.365         .2   27778.75
{txt}output_in~te {c |}{res}      1,226    313.1933      463.55        .08    3964.21
{txt}output_ind~c {c |}{res}      1,851    1128.787    1453.311        .09    9528.73
{txt}{hline 13}{c +}{hline 57}
output_in~mt {c |}{res}      1,639    172.7867    494.6264          0    5091.99
{txt}output_ind~n {c |}{res}      1,646     288.581    908.6518        .02   14043.11
{txt}{space 5}inc_ind {c |}{res}        914    316.4994    474.1576         .1     4207.2
{txt}index_inc_~d {c |}{res}        829    122.3329    10.96365       63.1      197.6
{txt}{space 7}asset {c |}{res}      2,203    1483.669    2222.007         .4   24696.71
{txt}{hline 13}{c +}{hline 57}
{space 8}debt {c |}{res}      2,203    1223.037    16602.65        .05     777727
{txt}{space 5}revenue {c |}{res}      2,202    1846.548    2869.972         .1   29937.18
{txt}{space 6}profit {c |}{res}      2,201    124.9978    197.6668     -78.46    1599.02
{txt}{space 7}miles {c |}{res}      2,432    10843.49    5963.077        563      41000
{txt}{space 1}miles_grade {c |}{res}      2,415    8701.382    5089.525         92      28734
{txt}{hline 13}{c +}{hline 57}
{space 3}veh_civil {c |}{res}      2,289    258584.8    307617.7       1611    2599877
{txt}{space 1}veh_private {c |}{res}      2,254    195763.1    250130.2        708    2271414
{txt}post_telecom {c |}{res}      1,762    50.82127    78.90156        .26    1051.65
{txt}{space 5}telecom {c |}{res}      1,825    38.90947    55.19832        .11     704.79
{txt}{space 4}landline {c |}{res}      2,379    88.31311    88.72882         .6      652.1
{txt}{hline 13}{c +}{hline 57}
{space 6}mobile {c |}{res}      2,371    243.7966    275.2105         .8    2921.53
{txt}{space 2}im_ex_port {c |}{res}      2,370    691524.9     2852514          2   5.37e+07
{txt}{space 6}import {c |}{res}      2,298    286439.9     1226325          0   2.32e+07
{txt}{space 6}export {c |}{res}      2,363    414269.7     1658387          1   3.06e+07
{txt}{space 9}fdi {c |}{res}      2,219    49980.63      109318          1    1359985
{txt}{hline 13}{c +}{hline 57}
{space 5}savings {c |}{res}      2,534    1574.899    2819.404       10.6   32850.57
{txt}savings_firm {c |}{res}      1,572    364.0506    859.1808          2    8908.74
{txt}savings_re~t {c |}{res}      1,582    581.7112    792.0799        3.4    9069.26
{txt}savings_fi~d {c |}{res}      1,567    347.7195    459.7542         .8    4614.74
{txt}{space 8}loan {c |}{res}      2,533    1071.657    2121.538        2.4   20632.92
{txt}{hline 13}{c +}{hline 57}
{space 4}loan_ind {c |}{res}      1,226    93.80847    178.5574          0    1591.78
{txt}{space 3}loan_busi {c |}{res}      1,237    46.39765    63.51856        .05     592.59
{txt}{space 3}loan_agri {c |}{res}      1,248    49.88797    51.15642          0      405.9
{txt}{space 1}fisexp_agri {c |}{res}      2,200    17.71386    13.59588        .03     101.24
{txt}fisexp_hea~h {c |}{res}      2,218    12.20491     10.6914        .44     106.92
{txt}{hline 13}{c +}{hline 57}
{space 1}house_rural {c |}{res}      2,007    35.30643    14.21397        9.1        440
{txt}{space 6}q9_1_4 {c |}{res}        317    53.28076    52.03091          1        468
{txt}{space 1}num_ind_dom {c |}{res}        318    1009.575    1398.321          2       9033
{txt}{space 1}num_ind_hmt {c |}{res}        285    110.3825    331.1713          1       2949
{txt}{space 1}num_ind_frn {c |}{res}        275    119.2618    334.8821          1       3818
{txt}{hline 13}{c +}{hline 57}
output_in~ge {c |}{res}        830    741.5015    1316.874        .74    15038.4
{txt}output_ind~m {c |}{res}        905    538.3314    805.1985        .36       7459
{txt}output_ind~l {c |}{res}        635    684.7409    983.9411    -297.87    6677.75
{txt}total_equity {c |}{res}      1,268    803.3135    1096.746         .3   10666.93
{txt}{space 3}total_vat {c |}{res}      1,265    76.00666    95.95202          0     786.77
{txt}{hline 13}{c +}{hline 57}
num_employee {c |}{res}        635    26.64872    40.56118          0     352.56
{txt}{space 4}internet {c |}{res}      1,423     65.6094    103.8976         .1     999.15
{txt}{space 5}pop_per {c |}{res}      1,205    384.3806    253.9297        9.6     1429.8
{txt}output_in~ht {c |}{res}        625    629.1616    1005.284        .03    7003.41
{txt}output_ind~y {c |}{res}        630    1504.929    2179.358        .05   20775.35
{txt}{hline 13}{c +}{hline 57}
savings_rm~n {c |}{res}      1,228    2177.131    3622.937       41.3   33943.15
{txt}{space 1}savings_cur {c |}{res}        318    338.2537    495.0347       5.89    4454.52
{txt}{space 1}loan_rmbfrn {c |}{res}      1,226    1544.739    2864.253       3.04   24680.07
{txt}{space 5}q12_5_1 {c |}{res}        935    1326.688    2453.601       2.78   17956.78
{txt}{space 2}loan_short {c |}{res}      1,265    575.5941     975.949        .42    8556.42
{txt}{hline 13}{c +}{hline 57}
{space 3}loan_long {c |}{res}      1,265     822.585    1677.693       1.65   13766.25
{txt}{space 4}loan_frn {c |}{res}        411    5.255888     24.1521          0     249.46
{txt}comhouse_s~s {c |}{res}        935    181.3137    288.8775         .1       2606
{txt}{space 1}house_sales {c |}{res}        934     151.037    237.8258         .1     1951.5
{txt}comhouse_s~a {c |}{res}        935    330.5428    362.8073         .4       2948
{txt}{hline 13}{c +}{hline 57}
house_sale~a {c |}{res}        935    293.8911    319.2894         .2     2555.4
{txt}house_area~n {c |}{res}        845    34.57089    6.815777       17.1       65.8
{txt}{space 8}post {c |}{res}        950    4.319337    13.35678        .01     226.63
{txt}savings_da~i {c |}{res}        303    1049.846    2091.788      36.87    15858.3
{txt}savings_ge~n {c |}{res}        303    1053.979    1329.837         12   11589.97
{txt}{hline 13}{c +}{hline 57}
savings_de~t {c |}{res}        628    1126.392    1364.538         12   12253.98
{txt}house_secu~y {c |}{res}        317    13.85372    65.25082        .09       1162
{txt}{space 8}cost {c |}{res}        316    2429.975    3208.993        .84   26714.71
{txt}{space 8}code {c |}{res}      2,544    402598.1      147794     130100     654300
{txt}{space 8}prov {c |}{res}      2,544    40.15723    14.75133         13         65
{txt}{hline 13}{c +}{hline 57}
{space 8}pref {c |}{res}      2,544    4025.981     1477.94       1301       6543
{txt}{space 7}level {c |}{res}      2,544           2           0          2          2
{txt}{space 9}cit {c |}{res}      2,544    1692.412    948.3522          2       3237
{txt}{space 5}govsize {c |}{res}      2,539    .2012762    .2009307   .0426532   3.580979
{txt}{space 6}govedu {c |}{res}      2,521     .036075    .0294101   .0003037   .2606915
{txt}{hline 13}{c +}{hline 57}
{space 5}govedu1 {c |}{res}      2,521     .187324    .0466493   .0015361   .3657038
{txt}{space 6}govsec {c |}{res}      2,524    .0256393    .0738396   .0003068   2.724105
{txt}{space 5}govsec1 {c |}{res}      2,524    .1168456    .0555975   .0011891   .7607152
{txt}{space 8}open {c |}{res}      2,369    .0285571    .0504232   2.17e-06   .4720682
{txt}{space 7}open1 {c |}{res}      2,368    .0471931    .1119791  -3.022129   .8528503
{txt}{hline 13}{c +}{hline 57}
{space 5}lngdppc {c |}{res}      2,531    10.06319    .7098018   7.921173   12.18958
{txt}{space 7}lnpop {c |}{res}      2,510    5.660586    .8375934   2.104134   7.080027
{txt}{space 9}anr {c |}{res}      2,544    .1540881    .3611041          0          1
{txt}{space 10}y1 {c |}{res}      2,544        .125    .3307839          0          1
{txt}{space 10}y2 {c |}{res}      2,544        .125    .3307839          0          1
{txt}{hline 13}{c +}{hline 57}
{space 10}y3 {c |}{res}      2,544        .125    .3307839          0          1
{txt}{space 10}y4 {c |}{res}      2,544        .125    .3307839          0          1
{txt}{space 10}y5 {c |}{res}      2,544        .125    .3307839          0          1
{txt}{space 10}y6 {c |}{res}      2,544        .125    .3307839          0          1
{txt}{space 10}y7 {c |}{res}      2,544        .125    .3307839          0          1
{txt}{hline 13}{c +}{hline 57}
{space 10}y8 {c |}{res}      2,544        .125    .3307839          0          1
{txt}{space 10}p1 {c |}{res}      2,544    .0345912    .1827779          0          1
{txt}{space 10}p2 {c |}{res}      2,544    .0314465    .1745555          0          1
{txt}{space 10}p3 {c |}{res}      2,544    .0345912    .1827779          0          1
{txt}{space 10}p4 {c |}{res}      2,544    .0440252    .2051914          0          1
{txt}{hline 13}{c +}{hline 57}
{space 10}p5 {c |}{res}      2,544    .0283019    .1658665          0          1
{txt}{space 10}p6 {c |}{res}      2,544    .0408805    .1980523          0          1
{txt}{space 10}p7 {c |}{res}      2,544    .0377358    .1905942          0          1
{txt}{space 10}p8 {c |}{res}      2,544    .0345912    .1827779          0          1
{txt}{space 10}p9 {c |}{res}      2,544    .0471698    .2120436          0          1
{txt}{hline 13}{c +}{hline 57}
{space 9}p10 {c |}{res}      2,544    .0283019    .1658665          0          1
{txt}{space 9}p11 {c |}{res}      2,544    .0345912    .1827779          0          1
{txt}{space 9}p12 {c |}{res}      2,544    .0503145     .218636          0          1
{txt}{space 9}p13 {c |}{res}      2,544    .0534591    .2249914          0          1
{txt}{space 9}p14 {c |}{res}      2,544    .0377358    .1905942          0          1
{txt}{hline 13}{c +}{hline 57}
{space 9}p15 {c |}{res}      2,544    .0440252    .2051914          0          1
{txt}{space 9}p16 {c |}{res}      2,544    .0660377    .2483969          0          1
{txt}{space 9}p17 {c |}{res}      2,544    .0440252    .2051914          0          1
{txt}{space 9}p18 {c |}{res}      2,544    .0062893    .0790709          0          1
{txt}{space 9}p19 {c |}{res}      2,544    .0660377    .2483969          0          1
{txt}{hline 13}{c +}{hline 57}
{space 9}p20 {c |}{res}      2,544    .0220126    .1467532          0          1
{txt}{space 9}p21 {c |}{res}      2,544    .0440252    .2051914          0          1
{txt}{space 9}p22 {c |}{res}      2,544    .0188679    .1360853          0          1
{txt}{space 9}p23 {c |}{res}      2,544    .0314465    .1745555          0          1
{txt}{space 9}p24 {c |}{res}      2,544    .0440252    .2051914          0          1
{txt}{hline 13}{c +}{hline 57}
{space 9}p25 {c |}{res}      2,544    .0188679    .1360853          0          1
{txt}{space 9}p26 {c |}{res}      2,544    .0157233    .1244272          0          1
{txt}{space 9}p27 {c |}{res}      2,544    .0408805    .1980523          0          1
{txt}{space 4}lgovsize {c |}{res}      2,221     .195409    .1965747   .0426532   3.580979
{txt}{space 7}lopen {c |}{res}      2,054     .028504    .0507085   3.85e-06   .4720682

Following variable is string, not included:  
city  city1  land  city_shortname  
{txt}{stata `"shellout using `"stats.tex"'"':stats.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "stats.txt""':seeout}

{com}. 
. 
. ****** 回归估计
. *** 截面估计
. forvalues i= 2006/2013{c -(}
{txt}  2{com}.         reg govsize open lngdppc lnpop anr p1-p27 if year == `i'
{txt}  3{com}.         if `i' == 2006 {c -(}
{txt}  4{com}.                 outreg2 using estcross, tex drop(p* o.p*) ctitle(`i') replace title("安")
{txt}  5{com}.         {c )-}
{txt}  6{com}.         else{c -(}
{txt}  7{com}.                 outreg2 using estcross, tex drop(p* o.p*) ctitle(`i') append
{txt}  8{com}.         {c )-}
{txt}  9{com}.         di `i'
{txt} 10{com}. {c )-}
{txt}note: p20 omitted because of collinearity
note: p22 omitted because of collinearity
note: p25 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       307
{txt}{hline 13}{c +}{hline 34}   F(28, 278)      = {res}    16.14
{txt}       Model {c |} {res} 1.63508405        28  .058395859   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.00558012       278  .003617195   {txt}R-squared       ={res}    0.6192
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5808
{txt}       Total {c |} {res} 2.64066417       306  .008629621   {txt}Root MSE        =   {res} .06014

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .2496694{col 26}{space 2} .0791788{col 37}{space 1}    3.15{col 46}{space 3}0.002{col 54}{space 4} .0938033{col 67}{space 3} .4055355
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0988894{col 26}{space 2} .0072849{col 37}{space 1}  -13.57{col 46}{space 3}0.000{col 54}{space 4}-.1132299{col 67}{space 3}-.0845489
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0428322{col 26}{space 2} .0058942{col 37}{space 1}   -7.27{col 46}{space 3}0.000{col 54}{space 4}-.0544351{col 67}{space 3}-.0312293
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.0575624{col 26}{space 2} .0441426{col 37}{space 1}   -1.30{col 46}{space 3}0.193{col 54}{space 4}-.1444585{col 67}{space 3} .0293338
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.0848703{col 26}{space 2} .0421031{col 37}{space 1}   -2.02{col 46}{space 3}0.045{col 54}{space 4}-.1677517{col 67}{space 3}-.0019889
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.0694965{col 26}{space 2}  .041059{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-.1503225{col 67}{space 3} .0113295
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0310972{col 26}{space 2} .0346419{col 37}{space 1}    0.90{col 46}{space 3}0.370{col 54}{space 4}-.0370965{col 67}{space 3}  .099291
{txt}{space 10}p4 {c |}{col 14}{res}{space 2}-.0640072{col 26}{space 2} .0401038{col 37}{space 1}   -1.60{col 46}{space 3}0.112{col 54}{space 4}-.1429528{col 67}{space 3} .0149385
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.0746702{col 26}{space 2}  .041428{col 37}{space 1}   -1.80{col 46}{space 3}0.073{col 54}{space 4}-.1562226{col 67}{space 3} .0068823
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.1017824{col 26}{space 2} .0395745{col 37}{space 1}   -2.57{col 46}{space 3}0.011{col 54}{space 4}-.1796861{col 67}{space 3}-.0238787
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.0692314{col 26}{space 2} .0424657{col 37}{space 1}   -1.63{col 46}{space 3}0.104{col 54}{space 4}-.1528265{col 67}{space 3} .0143638
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.0471934{col 26}{space 2} .0423111{col 37}{space 1}   -1.12{col 46}{space 3}0.266{col 54}{space 4}-.1304842{col 67}{space 3} .0360975
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.1113309{col 26}{space 2} .0395237{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.1891347{col 67}{space 3} -.033527
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.1114189{col 26}{space 2} .0423611{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.1948082{col 67}{space 3}-.0280296
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.1122597{col 26}{space 2} .0406896{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-.1923586{col 67}{space 3}-.0321608
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.0726946{col 26}{space 2}  .041149{col 37}{space 1}   -1.77{col 46}{space 3}0.078{col 54}{space 4}-.1536978{col 67}{space 3} .0083086
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.1043953{col 26}{space 2} .0401586{col 37}{space 1}   -2.60{col 46}{space 3}0.010{col 54}{space 4}-.1834489{col 67}{space 3}-.0253417
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.1231705{col 26}{space 2} .0405301{col 37}{space 1}   -3.04{col 46}{space 3}0.003{col 54}{space 4}-.2029554{col 67}{space 3}-.0433857
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.1000647{col 26}{space 2} .0403393{col 37}{space 1}   -2.48{col 46}{space 3}0.014{col 54}{space 4}-.1794739{col 67}{space 3}-.0206555
{txt}{space 9}p16 {c |}{col 14}{res}{space 2} -.112691{col 26}{space 2} .0400749{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-.1915797{col 67}{space 3}-.0338023
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0746619{col 26}{space 2} .0344528{col 37}{space 1}   -2.17{col 46}{space 3}0.031{col 54}{space 4}-.1424834{col 67}{space 3}-.0068404
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.0989925{col 26}{space 2} .0555678{col 37}{space 1}   -1.78{col 46}{space 3}0.076{col 54}{space 4}-.2083796{col 67}{space 3} .0103946
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.0716823{col 26}{space 2} .0386935{col 37}{space 1}   -1.85{col 46}{space 3}0.065{col 54}{space 4}-.1478517{col 67}{space 3} .0044871
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}-.0642161{col 26}{space 2} .0391801{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-.1413434{col 67}{space 3} .0129112
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}-.1148255{col 26}{space 2} .0409969{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-.1955292{col 67}{space 3}-.0341217
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} -.062226{col 26}{space 2} .0387016{col 37}{space 1}   -1.61{col 46}{space 3}0.109{col 54}{space 4}-.1384114{col 67}{space 3} .0139594
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}-.0232675{col 26}{space 2} .0389963{col 37}{space 1}   -0.60{col 46}{space 3}0.551{col 54}{space 4} -.100033{col 67}{space 3}  .053498
{txt}{space 9}p27 {c |}{col 14}{res}{space 2} .0099649{col 26}{space 2}  .032743{col 37}{space 1}    0.30{col 46}{space 3}0.761{col 54}{space 4}-.0544908{col 67}{space 3} .0744207
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.400559{col 26}{space 2} .0822513{col 37}{space 1}   17.03{col 46}{space 3}0.000{col 54}{space 4} 1.238645{col 67}{space 3} 1.562474
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross.tex"'"':estcross.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross.txt""':seeout}
2006
note: p3 omitted because of collinearity
note: p5 omitted because of collinearity
note: p16 omitted because of collinearity
note: p17 omitted because of collinearity
note: p18 omitted because of collinearity
note: p19 omitted because of collinearity
note: p20 omitted because of collinearity
note: p21 omitted because of collinearity
note: p22 omitted because of collinearity
note: p23 omitted because of collinearity
note: p24 omitted because of collinearity
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity
note: p27 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       182
{txt}{hline 13}{c +}{hline 34}   F(17, 164)      = {res}    24.96
{txt}       Model {c |} {res} .278635472        17  .016390322   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .107686546       164  .000656625   {txt}R-squared       ={res}    0.7213
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6924
{txt}       Total {c |} {res} .386322018       181  .002134376   {txt}Root MSE        =   {res} .02562

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .2724255{col 26}{space 2} .0518791{col 37}{space 1}    5.25{col 46}{space 3}0.000{col 54}{space 4} .1699884{col 67}{space 3} .3748626
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0661056{col 26}{space 2} .0045859{col 37}{space 1}  -14.42{col 46}{space 3}0.000{col 54}{space 4}-.0751606{col 67}{space 3}-.0570506
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0182138{col 26}{space 2} .0034218{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-.0249702{col 67}{space 3}-.0114574
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0420828{col 26}{space 2} .0120482{col 37}{space 1}    3.49{col 46}{space 3}0.001{col 54}{space 4} .0182931{col 67}{space 3} .0658724
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.0294414{col 26}{space 2} .0118709{col 37}{space 1}   -2.48{col 46}{space 3}0.014{col 54}{space 4}-.0528809{col 67}{space 3} -.006002
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.0008334{col 26}{space 2}  .011778{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4}-.0240894{col 67}{space 3} .0224227
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2} .0034307{col 26}{space 2}  .011018{col 37}{space 1}    0.31{col 46}{space 3}0.756{col 54}{space 4}-.0183247{col 67}{space 3}  .025186
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p6 {c |}{col 14}{res}{space 2} .0002872{col 26}{space 2}   .01127{col 37}{space 1}    0.03{col 46}{space 3}0.980{col 54}{space 4}-.0219658{col 67}{space 3} .0225403
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.0250425{col 26}{space 2} .0121243{col 37}{space 1}   -2.07{col 46}{space 3}0.040{col 54}{space 4}-.0489824{col 67}{space 3}-.0011026
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.0129451{col 26}{space 2} .0121818{col 37}{space 1}   -1.06{col 46}{space 3}0.290{col 54}{space 4}-.0369985{col 67}{space 3} .0111083
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.0252937{col 26}{space 2} .0108589{col 37}{space 1}   -2.33{col 46}{space 3}0.021{col 54}{space 4} -.046735{col 67}{space 3}-.0038524
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.0475777{col 26}{space 2} .0123583{col 37}{space 1}   -3.85{col 46}{space 3}0.000{col 54}{space 4}-.0719796{col 67}{space 3}-.0231757
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.0231274{col 26}{space 2} .0116046{col 37}{space 1}   -1.99{col 46}{space 3}0.048{col 54}{space 4} -.046041{col 67}{space 3}-.0002138
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.0307809{col 26}{space 2} .0112129{col 37}{space 1}   -2.75{col 46}{space 3}0.007{col 54}{space 4}-.0529213{col 67}{space 3}-.0086406
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.0321041{col 26}{space 2} .0109115{col 37}{space 1}   -2.94{col 46}{space 3}0.004{col 54}{space 4}-.0536492{col 67}{space 3}-.0105591
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.0347253{col 26}{space 2} .0116273{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-.0576837{col 67}{space 3}-.0117669
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.0160945{col 26}{space 2} .0111386{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4} -.038088{col 67}{space 3} .0058991
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p17 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p24 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2}  .887911{col 26}{space 2} .0532188{col 37}{space 1}   16.68{col 46}{space 3}0.000{col 54}{space 4} .7828287{col 67}{space 3} .9929932
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross.tex"'"':estcross.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross.txt""':seeout}
2007
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       299
{txt}{hline 13}{c +}{hline 34}   F(28, 270)      = {res}    11.08
{txt}       Model {c |} {res} 2.98459141        28   .10659255   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.59797827       270  .009622142   {txt}R-squared       ={res}    0.5346
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4864
{txt}       Total {c |} {res} 5.58256968       298  .018733455   {txt}Root MSE        =   {res} .09809

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2}  .279615{col 26}{space 2} .1258159{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} .0319099{col 67}{space 3}   .52732
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1334903{col 26}{space 2} .0123531{col 37}{space 1}  -10.81{col 46}{space 3}0.000{col 54}{space 4}-.1578109{col 67}{space 3}-.1091697
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0509285{col 26}{space 2} .0098506{col 37}{space 1}   -5.17{col 46}{space 3}0.000{col 54}{space 4}-.0703223{col 67}{space 3}-.0315347
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0628993{col 26}{space 2} .0855082{col 37}{space 1}    0.74{col 46}{space 3}0.463{col 54}{space 4}-.1054483{col 67}{space 3} .2312469
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0247351{col 26}{space 2} .0774392{col 37}{space 1}    0.32{col 46}{space 3}0.750{col 54}{space 4}-.1277264{col 67}{space 3} .1771966
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0263143{col 26}{space 2} .0767504{col 37}{space 1}    0.34{col 46}{space 3}0.732{col 54}{space 4}-.1247911{col 67}{space 3} .1774197
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0333703{col 26}{space 2} .0588726{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.0825374{col 67}{space 3} .1492779
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0455315{col 26}{space 2} .0749092{col 37}{space 1}    0.61{col 46}{space 3}0.544{col 54}{space 4}-.1019489{col 67}{space 3} .1930119
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0355323{col 26}{space 2} .0773299{col 37}{space 1}    0.46{col 46}{space 3}0.646{col 54}{space 4}-.1167141{col 67}{space 3} .1877786
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0049884{col 26}{space 2}  .075019{col 37}{space 1}    0.07{col 46}{space 3}0.947{col 54}{space 4}-.1427082{col 67}{space 3} .1526849
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0571098{col 26}{space 2} .0771873{col 37}{space 1}    0.74{col 46}{space 3}0.460{col 54}{space 4}-.0948557{col 67}{space 3} .2090753
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}  .055131{col 26}{space 2} .0774218{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4}-.0972961{col 67}{space 3} .2075581
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0037322{col 26}{space 2} .0747309{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-.1433972{col 67}{space 3} .1508615
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0083268{col 26}{space 2}  .078743{col 37}{space 1}    0.11{col 46}{space 3}0.916{col 54}{space 4}-.1467015{col 67}{space 3} .1633551
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}  .002794{col 26}{space 2} .0763967{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 54}{space 4}-.1476149{col 67}{space 3} .1532029
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0420462{col 26}{space 2} .0754382{col 37}{space 1}    0.56{col 46}{space 3}0.578{col 54}{space 4}-.1064757{col 67}{space 3} .1905682
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0035395{col 26}{space 2} .0750968{col 37}{space 1}    0.05{col 46}{space 3}0.962{col 54}{space 4}-.1443103{col 67}{space 3} .1513892
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.0127404{col 26}{space 2} .0761287{col 37}{space 1}   -0.17{col 46}{space 3}0.867{col 54}{space 4}-.1626217{col 67}{space 3}  .137141
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}  .011431{col 26}{space 2} .0757125{col 37}{space 1}    0.15{col 46}{space 3}0.880{col 54}{space 4} -.137631{col 67}{space 3} .1604929
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0050536{col 26}{space 2} .0745083{col 37}{space 1}   -0.07{col 46}{space 3}0.946{col 54}{space 4}-.1517448{col 67}{space 3} .1416377
{txt}{space 9}p17 {c |}{col 14}{res}{space 2} -.087302{col 26}{space 2} .0563479{col 37}{space 1}   -1.55{col 46}{space 3}0.122{col 54}{space 4}-.1982392{col 67}{space 3} .0236352
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .1392969{col 26}{space 2} .0740361{col 37}{space 1}    1.88{col 46}{space 3}0.061{col 54}{space 4}-.0064645{col 67}{space 3} .2850583
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0434766{col 26}{space 2}  .081755{col 37}{space 1}    0.53{col 46}{space 3}0.595{col 54}{space 4}-.1174818{col 67}{space 3}  .204435
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}  .039322{col 26}{space 2} .0759794{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4}-.1102655{col 67}{space 3} .1889094
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0208312{col 26}{space 2} .0770392{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-.1308426{col 67}{space 3} .1725051
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .1310653{col 26}{space 2} .0748753{col 37}{space 1}    1.75{col 46}{space 3}0.081{col 54}{space 4}-.0163483{col 67}{space 3} .2784789
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .0380912{col 26}{space 2} .0984328{col 37}{space 1}    0.39{col 46}{space 3}0.699{col 54}{space 4}-.1557022{col 67}{space 3} .2318846
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0431322{col 26}{space 2} .0570662{col 37}{space 1}   -0.76{col 46}{space 3}0.450{col 54}{space 4}-.1554835{col 67}{space 3} .0692191
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.732393{col 26}{space 2}  .157952{col 37}{space 1}   10.97{col 46}{space 3}0.000{col 54}{space 4} 1.421419{col 67}{space 3} 2.043367
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross.tex"'"':estcross.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross.txt""':seeout}
2008
note: p22 omitted because of collinearity
note: p25 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       302
{txt}{hline 13}{c +}{hline 34}   F(29, 272)      = {res}    12.88
{txt}       Model {c |} {res} 4.02638095        29  .138840722   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.93317549       272  .010783733   {txt}R-squared       ={res}    0.5785
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5336
{txt}       Total {c |} {res} 6.95955644       301   .02312145   {txt}Root MSE        =   {res} .10384

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .4023867{col 26}{space 2} .1756781{col 37}{space 1}    2.29{col 46}{space 3}0.023{col 54}{space 4}  .056525{col 67}{space 3} .7482484
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1623997{col 26}{space 2} .0133918{col 37}{space 1}  -12.13{col 46}{space 3}0.000{col 54}{space 4}-.1887644{col 67}{space 3} -.136035
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0630807{col 26}{space 2} .0105702{col 37}{space 1}   -5.97{col 46}{space 3}0.000{col 54}{space 4}-.0838905{col 67}{space 3}-.0422709
{txt}{space 9}anr {c |}{col 14}{res}{space 2}  .108739{col 26}{space 2} .1182007{col 37}{space 1}    0.92{col 46}{space 3}0.358{col 54}{space 4}-.1239655{col 67}{space 3} .3414435
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0212838{col 26}{space 2} .1091438{col 37}{space 1}    0.20{col 46}{space 3}0.846{col 54}{space 4}-.1935901{col 67}{space 3} .2361578
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0107453{col 26}{space 2} .1089858{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 54}{space 4}-.2038176{col 67}{space 3} .2253081
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0010151{col 26}{space 2} .0657412{col 37}{space 1}    0.02{col 46}{space 3}0.988{col 54}{space 4}-.1284113{col 67}{space 3} .1304414
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0551604{col 26}{space 2} .1076594{col 37}{space 1}    0.51{col 46}{space 3}0.609{col 54}{space 4}-.1567912{col 67}{space 3}  .267112
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0359996{col 26}{space 2} .1095271{col 37}{space 1}    0.33{col 46}{space 3}0.743{col 54}{space 4}-.1796291{col 67}{space 3} .2516283
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0026725{col 26}{space 2} .1078327{col 37}{space 1}    0.02{col 46}{space 3}0.980{col 54}{space 4}-.2096203{col 67}{space 3} .2149652
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0690736{col 26}{space 2} .1093172{col 37}{space 1}    0.63{col 46}{space 3}0.528{col 54}{space 4}-.1461418{col 67}{space 3} .2842889
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0528223{col 26}{space 2} .1093994{col 37}{space 1}    0.48{col 46}{space 3}0.630{col 54}{space 4} -.162555{col 67}{space 3} .2681996
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.0011355{col 26}{space 2} .1073663{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-.2125102{col 67}{space 3} .2102392
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0065213{col 26}{space 2} .1107419{col 37}{space 1}    0.06{col 46}{space 3}0.953{col 54}{space 4}-.2114989{col 67}{space 3} .2245416
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}  -.00089{col 26}{space 2} .1090779{col 37}{space 1}   -0.01{col 46}{space 3}0.993{col 54}{space 4}-.2156343{col 67}{space 3} .2138542
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0390057{col 26}{space 2} .1080674{col 37}{space 1}    0.36{col 46}{space 3}0.718{col 54}{space 4}-.1737492{col 67}{space 3} .2517605
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} -.000505{col 26}{space 2} .1073136{col 37}{space 1}   -0.00{col 46}{space 3}0.996{col 54}{space 4}-.2117759{col 67}{space 3} .2107659
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0011932{col 26}{space 2} .1082974{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-.2120145{col 67}{space 3} .2144008
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0100832{col 26}{space 2} .1078431{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-.2022301{col 67}{space 3} .2223965
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0247123{col 26}{space 2} .1077168{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4}-.2367769{col 67}{space 3} .1873523
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1391508{col 26}{space 2} .0649943{col 37}{space 1}   -2.14{col 46}{space 3}0.033{col 54}{space 4}-.2671067{col 67}{space 3}-.0111949
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}  .003151{col 26}{space 2} .1274846{col 37}{space 1}    0.02{col 46}{space 3}0.980{col 54}{space 4} -.247831{col 67}{space 3}  .254133
{txt}{space 9}p19 {c |}{col 14}{res}{space 2} .1204641{col 26}{space 2} .1068138{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4}-.0898228{col 67}{space 3}  .330751
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0177838{col 26}{space 2} .1115335{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4}-.2017949{col 67}{space 3} .2373625
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0293405{col 26}{space 2} .1081429{col 37}{space 1}    0.27{col 46}{space 3}0.786{col 54}{space 4} -.183563{col 67}{space 3}  .242244
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0243912{col 26}{space 2} .1090547{col 37}{space 1}    0.22{col 46}{space 3}0.823{col 54}{space 4}-.1903074{col 67}{space 3} .2390898
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}  .126302{col 26}{space 2} .1078394{col 37}{space 1}    1.17{col 46}{space 3}0.243{col 54}{space 4}-.0860041{col 67}{space 3} .3386081
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2} -.041532{col 26}{space 2} .0714176{col 37}{space 1}   -0.58{col 46}{space 3}0.561{col 54}{space 4}-.1821336{col 67}{space 3} .0990695
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}-.0551819{col 26}{space 2} .0620423{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-.1773261{col 67}{space 3} .0669622
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.128644{col 26}{space 2} .1893676{col 37}{space 1}   11.24{col 46}{space 3}0.000{col 54}{space 4} 1.755831{col 67}{space 3} 2.501456
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross.tex"'"':estcross.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross.txt""':seeout}
2009
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       311
{txt}{hline 13}{c +}{hline 34}   F(29, 281)      = {res}    13.31
{txt}       Model {c |} {res} 5.38260878        29  .185607199   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.91799644       281  .013943048   {txt}R-squared       ={res}    0.5787
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5353
{txt}       Total {c |} {res} 9.30060522       310  .030001952   {txt}Root MSE        =   {res} .11808

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .3606156{col 26}{space 2} .1764265{col 37}{space 1}    2.04{col 46}{space 3}0.042{col 54}{space 4} .0133302{col 67}{space 3}  .707901
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1946369{col 26}{space 2} .0153707{col 37}{space 1}  -12.66{col 46}{space 3}0.000{col 54}{space 4}-.2248933{col 67}{space 3}-.1643806
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0803879{col 26}{space 2} .0117261{col 37}{space 1}   -6.86{col 46}{space 3}0.000{col 54}{space 4}  -.10347{col 67}{space 3}-.0573057
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0693353{col 26}{space 2} .1099715{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4}-.1471371{col 67}{space 3} .2858077
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0356776{col 26}{space 2} .0931095{col 37}{space 1}    0.38{col 46}{space 3}0.702{col 54}{space 4} -.147603{col 67}{space 3} .2189583
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0074183{col 26}{space 2} .0924936{col 37}{space 1}    0.08{col 46}{space 3}0.936{col 54}{space 4}  -.17465{col 67}{space 3} .1894866
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0518993{col 26}{space 2} .0828811{col 37}{space 1}    0.63{col 46}{space 3}0.532{col 54}{space 4}-.1112473{col 67}{space 3} .2150459
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0649113{col 26}{space 2} .0901444{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4}-.1125327{col 67}{space 3} .2423553
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0393596{col 26}{space 2} .0931391{col 37}{space 1}    0.42{col 46}{space 3}0.673{col 54}{space 4}-.1439793{col 67}{space 3} .2226984
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0158802{col 26}{space 2} .0902875{col 37}{space 1}    0.18{col 46}{space 3}0.861{col 54}{space 4}-.1618455{col 67}{space 3} .1936059
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .1024092{col 26}{space 2} .0926979{col 37}{space 1}    1.10{col 46}{space 3}0.270{col 54}{space 4}-.0800612{col 67}{space 3} .2848796
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0690371{col 26}{space 2} .0924369{col 37}{space 1}    0.75{col 46}{space 3}0.456{col 54}{space 4}-.1129196{col 67}{space 3} .2509938
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-4.87e-07{col 26}{space 2} .0899499{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-.1770616{col 67}{space 3} .1770606
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0129427{col 26}{space 2} .0935801{col 37}{space 1}    0.14{col 46}{space 3}0.890{col 54}{space 4}-.1712643{col 67}{space 3} .1971498
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0014082{col 26}{space 2} .0919171{col 37}{space 1}    0.02{col 46}{space 3}0.988{col 54}{space 4}-.1795253{col 67}{space 3} .1823417
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0626356{col 26}{space 2} .0905501{col 37}{space 1}    0.69{col 46}{space 3}0.490{col 54}{space 4}-.1156071{col 67}{space 3} .2408783
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0025933{col 26}{space 2} .0904579{col 37}{space 1}    0.03{col 46}{space 3}0.977{col 54}{space 4}-.1754678{col 67}{space 3} .1806543
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0051172{col 26}{space 2} .0916165{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-.1752245{col 67}{space 3}  .185459
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0112109{col 26}{space 2} .0911675{col 37}{space 1}    0.12{col 46}{space 3}0.902{col 54}{space 4} -.168247{col 67}{space 3} .1906688
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0188035{col 26}{space 2} .0892902{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-.1945661{col 67}{space 3} .1569591
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0936132{col 26}{space 2} .0814926{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-.2540267{col 67}{space 3} .0668002
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .1198711{col 26}{space 2} .0889809{col 37}{space 1}    1.35{col 46}{space 3}0.179{col 54}{space 4}-.0552826{col 67}{space 3} .2950248
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0411794{col 26}{space 2} .0967096{col 37}{space 1}    0.43{col 46}{space 3}0.671{col 54}{space 4}-.1491878{col 67}{space 3} .2315465
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0220197{col 26}{space 2} .0906689{col 37}{space 1}    0.24{col 46}{space 3}0.808{col 54}{space 4}-.1564568{col 67}{space 3} .2004962
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0423084{col 26}{space 2} .0927331{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-.1402313{col 67}{space 3} .2248482
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .0994159{col 26}{space 2} .0902694{col 37}{space 1}    1.10{col 46}{space 3}0.272{col 54}{space 4}-.0782741{col 67}{space 3}  .277106
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .0920235{col 26}{space 2} .1086589{col 37}{space 1}    0.85{col 46}{space 3}0.398{col 54}{space 4}-.1218654{col 67}{space 3} .3059123
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}  .017822{col 26}{space 2} .0884094{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.1562068{col 67}{space 3} .1918508
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}  .020212{col 26}{space 2} .0778183{col 37}{space 1}    0.26{col 46}{space 3}0.795{col 54}{space 4}-.1329687{col 67}{space 3} .1733928
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.587713{col 26}{space 2} .1988571{col 37}{space 1}   13.01{col 46}{space 3}0.000{col 54}{space 4} 2.196274{col 67}{space 3} 2.979151
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross.tex"'"':estcross.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross.txt""':seeout}
2010
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       309
{txt}{hline 13}{c +}{hline 34}   F(28, 280)      = {res}    18.66
{txt}       Model {c |} {res} 5.11722277        28  .182757956   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.74163092       280  .009791539   {txt}R-squared       ={res}    0.6511
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6163
{txt}       Total {c |} {res} 7.85885369       308  .025515759   {txt}Root MSE        =   {res} .09895

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .4373633{col 26}{space 2} .1487922{col 37}{space 1}    2.94{col 46}{space 3}0.004{col 54}{space 4}   .14447{col 67}{space 3} .7302567
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1974098{col 26}{space 2} .0130473{col 37}{space 1}  -15.13{col 46}{space 3}0.000{col 54}{space 4} -.223093{col 67}{space 3}-.1717266
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0706505{col 26}{space 2} .0098926{col 37}{space 1}   -7.14{col 46}{space 3}0.000{col 54}{space 4}-.0901239{col 67}{space 3}-.0511771
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .1231283{col 26}{space 2} .0829327{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.0401224{col 67}{space 3}  .286379
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0414451{col 26}{space 2} .0780721{col 37}{space 1}    0.53{col 46}{space 3}0.596{col 54}{space 4}-.1122378{col 67}{space 3} .1951279
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}  .018142{col 26}{space 2} .0773819{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-.1341822{col 67}{space 3} .1704662
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}  .016859{col 26}{space 2} .0548124{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-.0910376{col 67}{space 3} .1247557
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0792976{col 26}{space 2} .0755962{col 37}{space 1}    1.05{col 46}{space 3}0.295{col 54}{space 4}-.0695115{col 67}{space 3} .2281066
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0548775{col 26}{space 2} .0779621{col 37}{space 1}    0.70{col 46}{space 3}0.482{col 54}{space 4}-.0985888{col 67}{space 3} .2083438
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0207929{col 26}{space 2} .0755938{col 37}{space 1}    0.28{col 46}{space 3}0.783{col 54}{space 4}-.1280113{col 67}{space 3} .1695971
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .1100561{col 26}{space 2} .0781877{col 37}{space 1}    1.41{col 46}{space 3}0.160{col 54}{space 4}-.0438543{col 67}{space 3} .2639665
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0870732{col 26}{space 2} .0780994{col 37}{space 1}    1.11{col 46}{space 3}0.266{col 54}{space 4}-.0666634{col 67}{space 3} .2408097
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}    .0252{col 26}{space 2} .0754108{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4} -.123244{col 67}{space 3} .1736441
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0257267{col 26}{space 2} .0787729{col 37}{space 1}    0.33{col 46}{space 3}0.744{col 54}{space 4}-.1293357{col 67}{space 3}  .180789
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0182346{col 26}{space 2} .0770004{col 37}{space 1}    0.24{col 46}{space 3}0.813{col 54}{space 4}-.1333386{col 67}{space 3} .1698078
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0604051{col 26}{space 2} .0761541{col 37}{space 1}    0.79{col 46}{space 3}0.428{col 54}{space 4}-.0895022{col 67}{space 3} .2103124
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0117547{col 26}{space 2}  .075712{col 37}{space 1}    0.16{col 46}{space 3}0.877{col 54}{space 4}-.1372822{col 67}{space 3} .1607917
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0301925{col 26}{space 2}   .07664{col 37}{space 1}    0.39{col 46}{space 3}0.694{col 54}{space 4}-.1206711{col 67}{space 3} .1810562
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0218828{col 26}{space 2} .0762697{col 37}{space 1}    0.29{col 46}{space 3}0.774{col 54}{space 4} -.128252{col 67}{space 3} .1720176
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0193658{col 26}{space 2} .0753689{col 37}{space 1}   -0.26{col 46}{space 3}0.797{col 54}{space 4}-.1677273{col 67}{space 3} .1289957
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1351815{col 26}{space 2} .0526148{col 37}{space 1}   -2.57{col 46}{space 3}0.011{col 54}{space 4}-.2387523{col 67}{space 3}-.0316107
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .0765938{col 26}{space 2} .0743217{col 37}{space 1}    1.03{col 46}{space 3}0.304{col 54}{space 4}-.0697064{col 67}{space 3} .2228941
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0743259{col 26}{space 2} .0807364{col 37}{space 1}    0.92{col 46}{space 3}0.358{col 54}{space 4}-.0846015{col 67}{space 3} .2332533
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0725351{col 26}{space 2} .0757015{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.0764812{col 67}{space 3} .2215515
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0545404{col 26}{space 2} .0775431{col 37}{space 1}    0.70{col 46}{space 3}0.482{col 54}{space 4} -.098101{col 67}{space 3} .2071819
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .1001686{col 26}{space 2} .0753434{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-.0481428{col 67}{space 3} .2484801
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .2468429{col 26}{space 2} .0906525{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 54}{space 4} .0683959{col 67}{space 3} .4252898
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}  .021524{col 26}{space 2} .0521301{col 37}{space 1}    0.41{col 46}{space 3}0.680{col 54}{space 4}-.0810926{col 67}{space 3} .1241405
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.585186{col 26}{space 2}   .16902{col 37}{space 1}   15.30{col 46}{space 3}0.000{col 54}{space 4} 2.252475{col 67}{space 3} 2.917898
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross.tex"'"':estcross.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross.txt""':seeout}
2011
note: p3 omitted because of collinearity
note: p22 omitted because of collinearity
note: p25 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       307
{txt}{hline 13}{c +}{hline 34}   F(28, 278)      = {res}    18.25
{txt}       Model {c |} {res} 5.27966993        28  .188559641   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.87219075       278  .010331621   {txt}R-squared       ={res}    0.6477
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6122
{txt}       Total {c |} {res} 8.15186069       306  .026640068   {txt}Root MSE        =   {res} .10164

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .4545183{col 26}{space 2} .1570265{col 37}{space 1}    2.89{col 46}{space 3}0.004{col 54}{space 4} .1454063{col 67}{space 3} .7636303
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.2053848{col 26}{space 2} .0135099{col 37}{space 1}  -15.20{col 46}{space 3}0.000{col 54}{space 4}-.2319794{col 67}{space 3}-.1787901
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0676591{col 26}{space 2}  .010177{col 37}{space 1}   -6.65{col 46}{space 3}0.000{col 54}{space 4}-.0876929{col 67}{space 3}-.0476253
{txt}{space 9}anr {c |}{col 14}{res}{space 2} -.071777{col 26}{space 2} .0681768{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-.2059852{col 67}{space 3} .0624313
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.1850329{col 26}{space 2} .0703073{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.3234353{col 67}{space 3}-.0466305
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.2031603{col 26}{space 2} .0688488{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.3386914{col 67}{space 3}-.0676291
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2}-.1341883{col 26}{space 2} .0674879{col 37}{space 1}   -1.99{col 46}{space 3}0.048{col 54}{space 4}-.2670405{col 67}{space 3}-.0013362
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} -.163578{col 26}{space 2} .0696048{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.3005974{col 67}{space 3}-.0265587
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.2013321{col 26}{space 2} .0665642{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4} -.332366{col 67}{space 3}-.0702982
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.1112301{col 26}{space 2} .0710889{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4} -.251171{col 67}{space 3} .0287109
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.1439292{col 26}{space 2} .0707989{col 37}{space 1}   -2.03{col 46}{space 3}0.043{col 54}{space 4}-.2832994{col 67}{space 3}-.0045591
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.1836015{col 26}{space 2} .0665647{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-.3146364{col 67}{space 3}-.0525667
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.1947315{col 26}{space 2} .0712923{col 37}{space 1}   -2.73{col 46}{space 3}0.007{col 54}{space 4}-.3350727{col 67}{space 3}-.0543903
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.1922673{col 26}{space 2} .0685145{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-.3271405{col 67}{space 3}-.0573942
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.1636236{col 26}{space 2} .0683352{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.2981438{col 67}{space 3}-.0291033
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.2165915{col 26}{space 2}  .066962{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.3484085{col 67}{space 3}-.0847744
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.1944146{col 26}{space 2} .0685752{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.3294071{col 67}{space 3}-.0594221
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.1975967{col 26}{space 2} .0677826{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4}-.3310291{col 67}{space 3}-.0641644
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.2463327{col 26}{space 2} .0672578{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}-.3787319{col 67}{space 3}-.1139335
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1546485{col 26}{space 2}    .0437{col 37}{space 1}   -3.54{col 46}{space 3}0.000{col 54}{space 4}-.2406735{col 67}{space 3}-.0686235
{txt}{space 9}p18 {c |}{col 14}{res}{space 2} -.224125{col 26}{space 2} .0930584{col 37}{space 1}   -2.41{col 46}{space 3}0.017{col 54}{space 4}-.4073136{col 67}{space 3}-.0409365
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.1410662{col 26}{space 2} .0651103{col 37}{space 1}   -2.17{col 46}{space 3}0.031{col 54}{space 4}-.2692381{col 67}{space 3}-.0128943
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.1340187{col 26}{space 2} .0725108{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-.2767587{col 67}{space 3} .0087212
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}-.1473144{col 26}{space 2} .0661847{col 37}{space 1}   -2.23{col 46}{space 3}0.027{col 54}{space 4}-.2776012{col 67}{space 3}-.0170276
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}-.1577295{col 26}{space 2} .0690778{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.2937115{col 67}{space 3}-.0217476
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} -.106756{col 26}{space 2} .0654042{col 37}{space 1}   -1.63{col 46}{space 3}0.104{col 54}{space 4}-.2355063{col 67}{space 3} .0219943
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2} .0153551{col 26}{space 2} .0563277{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-.0955278{col 67}{space 3} .1262381
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}  .003989{col 26}{space 2} .0437372{col 37}{space 1}    0.09{col 46}{space 3}0.927{col 54}{space 4}-.0821091{col 67}{space 3} .0900872
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.902851{col 26}{space 2} .1653107{col 37}{space 1}   17.56{col 46}{space 3}0.000{col 54}{space 4} 2.577431{col 67}{space 3}  3.22827
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross.tex"'"':estcross.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross.txt""':seeout}
2012
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       312
{txt}{hline 13}{c +}{hline 34}   F(29, 282)      = {res}    17.15
{txt}       Model {c |} {res} 8.21610718        29  .283314041   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4.65932725       282  .016522437   {txt}R-squared       ={res}    0.6381
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6009
{txt}       Total {c |} {res} 12.8754344       311  .041400111   {txt}Root MSE        =   {res} .12854

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .5978584{col 26}{space 2} .1894621{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4}  .224919{col 67}{space 3} .9707978
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1998486{col 26}{space 2} .0174507{col 37}{space 1}  -11.45{col 46}{space 3}0.000{col 54}{space 4}-.2341989{col 67}{space 3}-.1654984
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0638974{col 26}{space 2} .0126021{col 37}{space 1}   -5.07{col 46}{space 3}0.000{col 54}{space 4}-.0887035{col 67}{space 3}-.0390913
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.0631341{col 26}{space 2}  .094302{col 37}{space 1}   -0.67{col 46}{space 3}0.504{col 54}{space 4}-.2487593{col 67}{space 3} .1224911
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.1782281{col 26}{space 2} .0888671{col 37}{space 1}   -2.01{col 46}{space 3}0.046{col 54}{space 4}-.3531553{col 67}{space 3} -.003301
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.1860213{col 26}{space 2} .0870927{col 37}{space 1}   -2.14{col 46}{space 3}0.034{col 54}{space 4}-.3574556{col 67}{space 3} -.014587
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}-.0048589{col 26}{space 2} .0710853{col 37}{space 1}   -0.07{col 46}{space 3}0.946{col 54}{space 4}-.1447841{col 67}{space 3} .1350663
{txt}{space 10}p4 {c |}{col 14}{res}{space 2}-.1308719{col 26}{space 2} .0850037{col 37}{space 1}   -1.54{col 46}{space 3}0.125{col 54}{space 4}-.2981942{col 67}{space 3} .0364504
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.1576167{col 26}{space 2} .0882502{col 37}{space 1}   -1.79{col 46}{space 3}0.075{col 54}{space 4}-.3313295{col 67}{space 3} .0160962
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.1919373{col 26}{space 2} .0840913{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-.3574637{col 67}{space 3}-.0264109
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.1102498{col 26}{space 2} .0900574{col 37}{space 1}   -1.22{col 46}{space 3}0.222{col 54}{space 4}-.2875198{col 67}{space 3} .0670202
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.1642106{col 26}{space 2}  .089361{col 37}{space 1}   -1.84{col 46}{space 3}0.067{col 54}{space 4}-.3401099{col 67}{space 3} .0116886
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.1775985{col 26}{space 2} .0842393{col 37}{space 1}   -2.11{col 46}{space 3}0.036{col 54}{space 4}-.3434161{col 67}{space 3}-.0117808
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.1824139{col 26}{space 2} .0902743{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4}-.3601109{col 67}{space 3}-.0047169
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.1806367{col 26}{space 2} .0866583{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4} -.351216{col 67}{space 3}-.0100574
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} -.164985{col 26}{space 2}  .086652{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-.3355519{col 67}{space 3} .0055819
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.2034277{col 26}{space 2}  .085131{col 37}{space 1}   -2.39{col 46}{space 3}0.018{col 54}{space 4}-.3710006{col 67}{space 3}-.0358549
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.1789844{col 26}{space 2} .0870234{col 37}{space 1}   -2.06{col 46}{space 3}0.041{col 54}{space 4}-.3502823{col 67}{space 3}-.0076865
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.1803255{col 26}{space 2} .0857293{col 37}{space 1}   -2.10{col 46}{space 3}0.036{col 54}{space 4} -.349076{col 67}{space 3} -.011575
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.2476367{col 26}{space 2} .0849299{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4}-.4148137{col 67}{space 3}-.0804598
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1594606{col 26}{space 2} .0683556{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-.2940127{col 67}{space 3}-.0249085
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.1962058{col 26}{space 2} .1179379{col 37}{space 1}   -1.66{col 46}{space 3}0.097{col 54}{space 4}-.4283561{col 67}{space 3} .0359446
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.1046408{col 26}{space 2} .0823315{col 37}{space 1}   -1.27{col 46}{space 3}0.205{col 54}{space 4}-.2667032{col 67}{space 3} .0574216
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.1201816{col 26}{space 2}   .09162{col 37}{space 1}   -1.31{col 46}{space 3}0.191{col 54}{space 4}-.3005275{col 67}{space 3} .0601644
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}-.1364841{col 26}{space 2} .0836179{col 37}{space 1}   -1.63{col 46}{space 3}0.104{col 54}{space 4}-.3010786{col 67}{space 3} .0281104
{txt}{space 9}p22 {c |}{col 14}{res}{space 2} .5420595{col 26}{space 2} .0833097{col 37}{space 1}    6.51{col 46}{space 3}0.000{col 54}{space 4} .3780717{col 67}{space 3} .7060472
{txt}{space 9}p23 {c |}{col 14}{res}{space 2}-.1609386{col 26}{space 2} .0884249{col 37}{space 1}   -1.82{col 46}{space 3}0.070{col 54}{space 4}-.3349952{col 67}{space 3}  .013118
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.0992184{col 26}{space 2} .0826475{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-.2619027{col 67}{space 3} .0634659
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0103958{col 26}{space 2} .0677468{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4}-.1437493{col 67}{space 3} .1229578
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2.83382{col 26}{space 2}  .212471{col 37}{space 1}   13.34{col 46}{space 3}0.000{col 54}{space 4}  2.41559{col 67}{space 3} 3.252051
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross.tex"'"':estcross.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross.txt""':seeout}
2013

{com}. 
. *** 截面回归2
. forvalues i= 2006/2013{c -(}
{txt}  2{com}.         reg govsize open1 lngdppc lnpop anr p1-p27 if year == `i'
{txt}  3{com}.         if `i' == 2006 {c -(}
{txt}  4{com}.                 outreg2 using estcross2, tex drop(p* o.p*) ctitle(`i') replace title("安")
{txt}  5{com}.         {c )-}
{txt}  6{com}.         else{c -(}
{txt}  7{com}.                 outreg2 using estcross2, tex drop(p* o.p*) ctitle(`i') append
{txt}  8{com}.         {c )-}
{txt}  9{com}.         di `i'
{txt} 10{com}. {c )-}
{txt}note: p20 omitted because of collinearity
note: p22 omitted because of collinearity
note: p25 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       307
{txt}{hline 13}{c +}{hline 34}   F(28, 278)      = {res}    15.25
{txt}       Model {c |} {res} 1.59924339        28  .057115835   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.04142078       278  .003746118   {txt}R-squared       ={res}    0.6056
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5659
{txt}       Total {c |} {res} 2.64066417       306  .008629621   {txt}Root MSE        =   {res} .06121

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}open1 {c |}{col 14}{res}{space 2}-.0034124{col 26}{space 2} .0186983{col 37}{space 1}   -0.18{col 46}{space 3}0.855{col 54}{space 4}-.0402207{col 67}{space 3} .0333959
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0900439{col 26}{space 2} .0069628{col 37}{space 1}  -12.93{col 46}{space 3}0.000{col 54}{space 4}-.1037503{col 67}{space 3}-.0763375
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0444374{col 26}{space 2} .0059897{col 37}{space 1}   -7.42{col 46}{space 3}0.000{col 54}{space 4}-.0562283{col 67}{space 3}-.0326465
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.0615664{col 26}{space 2} .0449074{col 37}{space 1}   -1.37{col 46}{space 3}0.171{col 54}{space 4} -.149968{col 67}{space 3} .0268353
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} -.084498{col 26}{space 2} .0428486{col 37}{space 1}   -1.97{col 46}{space 3}0.050{col 54}{space 4} -.168847{col 67}{space 3} -.000149
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} -.071135{col 26}{space 2} .0417809{col 37}{space 1}   -1.70{col 46}{space 3}0.090{col 54}{space 4}-.1533822{col 67}{space 3} .0111122
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}  .029774{col 26}{space 2} .0352513{col 37}{space 1}    0.84{col 46}{space 3}0.399{col 54}{space 4}-.0396194{col 67}{space 3} .0991675
{txt}{space 10}p4 {c |}{col 14}{res}{space 2}-.0635875{col 26}{space 2} .0408129{col 37}{space 1}   -1.56{col 46}{space 3}0.120{col 54}{space 4}-.1439291{col 67}{space 3} .0167541
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.0753262{col 26}{space 2} .0421595{col 37}{space 1}   -1.79{col 46}{space 3}0.075{col 54}{space 4}-.1583187{col 67}{space 3} .0076662
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.0973611{col 26}{space 2} .0402592{col 37}{space 1}   -2.42{col 46}{space 3}0.016{col 54}{space 4}-.1766127{col 67}{space 3}-.0181095
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.0578144{col 26}{space 2} .0430957{col 37}{space 1}   -1.34{col 46}{space 3}0.181{col 54}{space 4}-.1426499{col 67}{space 3}  .027021
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.0385299{col 26}{space 2} .0431508{col 37}{space 1}   -0.89{col 46}{space 3}0.373{col 54}{space 4}-.1234738{col 67}{space 3}  .046414
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.1091804{col 26}{space 2} .0402194{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.1883537{col 67}{space 3}-.0300072
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} -.101945{col 26}{space 2} .0430317{col 37}{space 1}   -2.37{col 46}{space 3}0.019{col 54}{space 4}-.1866545{col 67}{space 3}-.0172356
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.1097111{col 26}{space 2} .0414044{col 37}{space 1}   -2.65{col 46}{space 3}0.009{col 54}{space 4}-.1912171{col 67}{space 3}-.0282052
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.0722562{col 26}{space 2} .0418764{col 37}{space 1}   -1.73{col 46}{space 3}0.086{col 54}{space 4}-.1546913{col 67}{space 3}  .010179
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.1047266{col 26}{space 2} .0408688{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-.1851782{col 67}{space 3} -.024275
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.1218563{col 26}{space 2} .0412468{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4} -.203052{col 67}{space 3}-.0406606
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.0985746{col 26}{space 2} .0410527{col 37}{space 1}   -2.40{col 46}{space 3}0.017{col 54}{space 4}-.1793882{col 67}{space 3} -.017761
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0889111{col 26}{space 2} .0402183{col 37}{space 1}   -2.21{col 46}{space 3}0.028{col 54}{space 4}-.1680822{col 67}{space 3}  -.00974
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0664017{col 26}{space 2}  .034988{col 37}{space 1}   -1.90{col 46}{space 3}0.059{col 54}{space 4}-.1352768{col 67}{space 3} .0024734
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.1069543{col 26}{space 2} .0564994{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.2181754{col 67}{space 3} .0042668
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.0698123{col 26}{space 2} .0393762{col 37}{space 1}   -1.77{col 46}{space 3}0.077{col 54}{space 4}-.1473256{col 67}{space 3}  .007701
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}-.0603597{col 26}{space 2} .0398606{col 37}{space 1}   -1.51{col 46}{space 3}0.131{col 54}{space 4}-.1388266{col 67}{space 3} .0181072
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}-.1137871{col 26}{space 2} .0417221{col 37}{space 1}   -2.73{col 46}{space 3}0.007{col 54}{space 4}-.1959185{col 67}{space 3}-.0316557
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.0583182{col 26}{space 2} .0393692{col 37}{space 1}   -1.48{col 46}{space 3}0.140{col 54}{space 4}-.1358179{col 67}{space 3} .0191814
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}-.0178293{col 26}{space 2} .0396554{col 37}{space 1}   -0.45{col 46}{space 3}0.653{col 54}{space 4}-.0958924{col 67}{space 3} .0602337
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}  .017925{col 26}{space 2} .0332541{col 37}{space 1}    0.54{col 46}{space 3}0.590{col 54}{space 4}-.0475368{col 67}{space 3} .0833868
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.328929{col 26}{space 2} .0810378{col 37}{space 1}   16.40{col 46}{space 3}0.000{col 54}{space 4} 1.169403{col 67}{space 3} 1.488455
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross2.tex"'"':estcross2.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross2.txt""':seeout}
2006
note: p3 omitted because of collinearity
note: p5 omitted because of collinearity
note: p16 omitted because of collinearity
note: p17 omitted because of collinearity
note: p18 omitted because of collinearity
note: p19 omitted because of collinearity
note: p20 omitted because of collinearity
note: p21 omitted because of collinearity
note: p22 omitted because of collinearity
note: p23 omitted because of collinearity
note: p24 omitted because of collinearity
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity
note: p27 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       182
{txt}{hline 13}{c +}{hline 34}   F(17, 164)      = {res}    25.65
{txt}       Model {c |} {res} .280744294        17   .01651437   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .105577724       164  .000643767   {txt}R-squared       ={res}    0.7267
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6984
{txt}       Total {c |} {res} .386322018       181  .002134376   {txt}Root MSE        =   {res} .02537

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}open1 {c |}{col 14}{res}{space 2} .1685541{col 26}{space 2} .0300792{col 37}{space 1}    5.60{col 46}{space 3}0.000{col 54}{space 4} .1091617{col 67}{space 3} .2279464
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0665616{col 26}{space 2} .0045344{col 37}{space 1}  -14.68{col 46}{space 3}0.000{col 54}{space 4}-.0755148{col 67}{space 3}-.0576083
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0186817{col 26}{space 2} .0033925{col 37}{space 1}   -5.51{col 46}{space 3}0.000{col 54}{space 4}-.0253803{col 67}{space 3} -.011983
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0420499{col 26}{space 2} .0119261{col 37}{space 1}    3.53{col 46}{space 3}0.001{col 54}{space 4} .0185013{col 67}{space 3} .0655984
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} -.028996{col 26}{space 2} .0117539{col 37}{space 1}   -2.47{col 46}{space 3}0.015{col 54}{space 4}-.0522046{col 67}{space 3}-.0057875
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.0009572{col 26}{space 2} .0116621{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4}-.0239843{col 67}{space 3}   .02207
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2} .0035797{col 26}{space 2} .0109085{col 37}{space 1}    0.33{col 46}{space 3}0.743{col 54}{space 4}-.0179596{col 67}{space 3}  .025119
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p6 {c |}{col 14}{res}{space 2}-.0010823{col 26}{space 2} .0111824{col 37}{space 1}   -0.10{col 46}{space 3}0.923{col 54}{space 4}-.0231624{col 67}{space 3} .0209977
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.0242167{col 26}{space 2} .0119546{col 37}{space 1}   -2.03{col 46}{space 3}0.044{col 54}{space 4}-.0478214{col 67}{space 3} -.000612
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.0130534{col 26}{space 2} .0120497{col 37}{space 1}   -1.08{col 46}{space 3}0.280{col 54}{space 4}-.0368459{col 67}{space 3} .0107391
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.0250247{col 26}{space 2} .0107476{col 37}{space 1}   -2.33{col 46}{space 3}0.021{col 54}{space 4}-.0462462{col 67}{space 3}-.0038033
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.0484399{col 26}{space 2} .0122446{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0726173{col 67}{space 3}-.0242625
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.0223762{col 26}{space 2} .0114793{col 37}{space 1}   -1.95{col 46}{space 3}0.053{col 54}{space 4}-.0450424{col 67}{space 3}   .00029
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.0296095{col 26}{space 2} .0111012{col 37}{space 1}   -2.67{col 46}{space 3}0.008{col 54}{space 4}-.0515292{col 67}{space 3}-.0076897
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.0315373{col 26}{space 2} .0108067{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4}-.0528756{col 67}{space 3}-.0101991
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} -.034715{col 26}{space 2} .0115123{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.0574464{col 67}{space 3}-.0119835
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.0159213{col 26}{space 2} .0110282{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4}-.0376968{col 67}{space 3} .0058541
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p17 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p24 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} .8948771{col 26}{space 2}  .052791{col 37}{space 1}   16.95{col 46}{space 3}0.000{col 54}{space 4} .7906394{col 67}{space 3} .9991148
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross2.tex"'"':estcross2.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross2.txt""':seeout}
2007
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       299
{txt}{hline 13}{c +}{hline 34}   F(28, 270)      = {res}    11.21
{txt}       Model {c |} {res} 3.00141921        28  .107193543   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.58115047       270  .009559817   {txt}R-squared       ={res}    0.5376
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4897
{txt}       Total {c |} {res} 5.58256968       298  .018733455   {txt}Root MSE        =   {res} .09777

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}open1 {c |}{col 14}{res}{space 2}  .177335{col 26}{space 2} .0683496{col 37}{space 1}    2.59{col 46}{space 3}0.010{col 54}{space 4} .0427691{col 67}{space 3} .3119009
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1346818{col 26}{space 2} .0122568{col 37}{space 1}  -10.99{col 46}{space 3}0.000{col 54}{space 4} -.158813{col 67}{space 3}-.1105507
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0514687{col 26}{space 2}   .00979{col 37}{space 1}   -5.26{col 46}{space 3}0.000{col 54}{space 4}-.0707431{col 67}{space 3}-.0321942
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0720017{col 26}{space 2} .0853393{col 37}{space 1}    0.84{col 46}{space 3}0.400{col 54}{space 4}-.0960134{col 67}{space 3} .2400167
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0353865{col 26}{space 2} .0773159{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4}-.1168322{col 67}{space 3} .1876053
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0362599{col 26}{space 2} .0766785{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 54}{space 4} -.114704{col 67}{space 3} .1872237
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0348922{col 26}{space 2} .0586784{col 37}{space 1}    0.59{col 46}{space 3}0.553{col 54}{space 4}-.0806331{col 67}{space 3} .1504176
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0560941{col 26}{space 2} .0748479{col 37}{space 1}    0.75{col 46}{space 3}0.454{col 54}{space 4}-.0912657{col 67}{space 3} .2034539
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0456775{col 26}{space 2} .0772735{col 37}{space 1}    0.59{col 46}{space 3}0.555{col 54}{space 4}-.1064577{col 67}{space 3} .1978127
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0136551{col 26}{space 2} .0747939{col 37}{space 1}    0.18{col 46}{space 3}0.855{col 54}{space 4}-.1335982{col 67}{space 3} .1609084
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0676034{col 26}{space 2} .0767949{col 37}{space 1}    0.88{col 46}{space 3}0.379{col 54}{space 4}-.0835896{col 67}{space 3} .2187963
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0650105{col 26}{space 2} .0770573{col 37}{space 1}    0.84{col 46}{space 3}0.400{col 54}{space 4} -.086699{col 67}{space 3}   .21672
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0140472{col 26}{space 2} .0746099{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4} -.132844{col 67}{space 3} .1609384
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0172558{col 26}{space 2} .0784105{col 37}{space 1}    0.22{col 46}{space 3}0.826{col 54}{space 4} -.137118{col 67}{space 3} .1716295
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0136567{col 26}{space 2} .0762398{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4}-.1364435{col 67}{space 3} .1637568
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0536566{col 26}{space 2} .0753427{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4}-.0946773{col 67}{space 3} .2019904
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0143565{col 26}{space 2}  .075057{col 37}{space 1}    0.19{col 46}{space 3}0.848{col 54}{space 4} -.133415{col 67}{space 3} .1621279
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.0027646{col 26}{space 2} .0760204{col 37}{space 1}   -0.04{col 46}{space 3}0.971{col 54}{space 4}-.1524328{col 67}{space 3} .1469036
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0216772{col 26}{space 2} .0756084{col 37}{space 1}    0.29{col 46}{space 3}0.775{col 54}{space 4}-.1271798{col 67}{space 3} .1705343
{txt}{space 9}p16 {c |}{col 14}{res}{space 2} .0022646{col 26}{space 2} .0738352{col 37}{space 1}    0.03{col 46}{space 3}0.976{col 54}{space 4}-.1431013{col 67}{space 3} .1476304
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0861814{col 26}{space 2} .0561446{col 37}{space 1}   -1.53{col 46}{space 3}0.126{col 54}{space 4}-.1967184{col 67}{space 3} .0243555
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2}  .149301{col 26}{space 2} .0739238{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 54}{space 4} .0037607{col 67}{space 3} .2948412
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0527704{col 26}{space 2} .0815237{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-.1077326{col 67}{space 3} .2132735
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0483065{col 26}{space 2}  .075781{col 37}{space 1}    0.64{col 46}{space 3}0.524{col 54}{space 4}-.1008904{col 67}{space 3} .1975034
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0306801{col 26}{space 2} .0769487{col 37}{space 1}    0.40{col 46}{space 3}0.690{col 54}{space 4}-.1208157{col 67}{space 3} .1821759
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}  .141586{col 26}{space 2} .0746974{col 37}{space 1}    1.90{col 46}{space 3}0.059{col 54}{space 4}-.0054775{col 67}{space 3} .2886494
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .0472277{col 26}{space 2} .0982602{col 37}{space 1}    0.48{col 46}{space 3}0.631{col 54}{space 4}-.1462258{col 67}{space 3} .2406813
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0450415{col 26}{space 2} .0568993{col 37}{space 1}   -0.79{col 46}{space 3}0.429{col 54}{space 4}-.1570642{col 67}{space 3} .0669812
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.73696{col 26}{space 2} .1567955{col 37}{space 1}   11.08{col 46}{space 3}0.000{col 54}{space 4} 1.428263{col 67}{space 3} 2.045657
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross2.tex"'"':estcross2.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross2.txt""':seeout}
2008
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       301
{txt}{hline 13}{c +}{hline 34}   F(29, 271)      = {res}    12.95
{txt}       Model {c |} {res} 4.03499746        29  .139137843   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.91191528       271  .010745075   {txt}R-squared       ={res}    0.5808
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5360
{txt}       Total {c |} {res} 6.94691274       300  .023156376   {txt}Root MSE        =   {res} .10366

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}open1 {c |}{col 14}{res}{space 2} .2456681{col 26}{space 2} .0915347{col 37}{space 1}    2.68{col 46}{space 3}0.008{col 54}{space 4} .0654585{col 67}{space 3} .4258776
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1641726{col 26}{space 2} .0133567{col 37}{space 1}  -12.29{col 46}{space 3}0.000{col 54}{space 4}-.1904687{col 67}{space 3}-.1378764
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0637632{col 26}{space 2} .0105292{col 37}{space 1}   -6.06{col 46}{space 3}0.000{col 54}{space 4}-.0844925{col 67}{space 3}-.0430338
{txt}{space 9}anr {c |}{col 14}{res}{space 2}  .066957{col 26}{space 2} .1137723{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 54}{space 4}-.1570329{col 67}{space 3} .2909469
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0226461{col 26}{space 2} .1089333{col 37}{space 1}    0.21{col 46}{space 3}0.835{col 54}{space 4}-.1918171{col 67}{space 3} .2371092
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0109205{col 26}{space 2} .1087901{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-.2032606{col 67}{space 3} .2251017
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0444436{col 26}{space 2} .0576057{col 37}{space 1}    0.77{col 46}{space 3}0.441{col 54}{space 4}-.0689681{col 67}{space 3} .1578553
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0563639{col 26}{space 2} .1074606{col 37}{space 1}    0.52{col 46}{space 3}0.600{col 54}{space 4}-.1551998{col 67}{space 3} .2679277
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0367713{col 26}{space 2} .1093314{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4}-.1784755{col 67}{space 3} .2520181
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0025476{col 26}{space 2} .1076269{col 37}{space 1}    0.02{col 46}{space 3}0.981{col 54}{space 4}-.2093435{col 67}{space 3} .2144388
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0707215{col 26}{space 2} .1090261{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4}-.1439243{col 67}{space 3} .2853674
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0532525{col 26}{space 2}    .1091{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-.1615387{col 67}{space 3} .2680438
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.0002903{col 26}{space 2} .1071636{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.2112693{col 67}{space 3} .2106887
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0044154{col 26}{space 2} .1105264{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-.2131842{col 67}{space 3}  .222015
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0004959{col 26}{space 2} .1088546{col 37}{space 1}    0.00{col 46}{space 3}0.996{col 54}{space 4}-.2138123{col 67}{space 3} .2148041
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0424174{col 26}{space 2} .1080917{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-.1703887{col 67}{space 3} .2552235
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0007831{col 26}{space 2} .1071192{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4}-.2101085{col 67}{space 3} .2116747
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0016772{col 26}{space 2} .1080979{col 37}{space 1}    0.02{col 46}{space 3}0.988{col 54}{space 4}-.2111413{col 67}{space 3} .2144957
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0107485{col 26}{space 2} .1076442{col 37}{space 1}    0.10{col 46}{space 3}0.921{col 54}{space 4}-.2011768{col 67}{space 3} .2226738
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0280639{col 26}{space 2} .1074023{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-.2395129{col 67}{space 3}  .183385
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0969368{col 26}{space 2}  .055586{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-.2063721{col 67}{space 3} .0124984
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.0127909{col 26}{space 2} .1275541{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-.2639138{col 67}{space 3} .2383321
{txt}{space 9}p19 {c |}{col 14}{res}{space 2} .1207538{col 26}{space 2} .1066136{col 37}{space 1}    1.13{col 46}{space 3}0.258{col 54}{space 4}-.0891424{col 67}{space 3} .3306501
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0170103{col 26}{space 2} .1113259{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-.2021634{col 67}{space 3} .2361839
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0286308{col 26}{space 2} .1079416{col 37}{space 1}    0.27{col 46}{space 3}0.791{col 54}{space 4}-.1838798{col 67}{space 3} .2411415
{txt}{space 9}p22 {c |}{col 14}{res}{space 2} .0385301{col 26}{space 2} .0712804{col 37}{space 1}    0.54{col 46}{space 3}0.589{col 54}{space 4}-.1018036{col 67}{space 3} .1788639
{txt}{space 9}p23 {c |}{col 14}{res}{space 2} .0245433{col 26}{space 2} .1088581{col 37}{space 1}    0.23{col 46}{space 3}0.822{col 54}{space 4}-.1897717{col 67}{space 3} .2388583
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}  .126786{col 26}{space 2} .1076301{col 37}{space 1}    1.18{col 46}{space 3}0.240{col 54}{space 4}-.0851115{col 67}{space 3} .3386835
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0144193{col 26}{space 2} .0552798{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-.1232518{col 67}{space 3} .0944131
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.149538{col 26}{space 2} .1894067{col 37}{space 1}   11.35{col 46}{space 3}0.000{col 54}{space 4} 1.776642{col 67}{space 3} 2.522433
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross2.tex"'"':estcross2.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross2.txt""':seeout}
2009
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       311
{txt}{hline 13}{c +}{hline 34}   F(29, 281)      = {res}    13.54
{txt}       Model {c |} {res} 5.42138411        29   .18694428   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.87922111       281  .013805057   {txt}R-squared       ={res}    0.5829
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5399
{txt}       Total {c |} {res} 9.30060522       310  .030001952   {txt}Root MSE        =   {res} .11749

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}open1 {c |}{col 14}{res}{space 2} .2532812{col 26}{space 2} .0955372{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} .0652217{col 67}{space 3} .4413407
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1977928{col 26}{space 2} .0152924{col 37}{space 1}  -12.93{col 46}{space 3}0.000{col 54}{space 4}-.2278949{col 67}{space 3}-.1676907
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0811029{col 26}{space 2} .0116254{col 37}{space 1}   -6.98{col 46}{space 3}0.000{col 54}{space 4}-.1039868{col 67}{space 3}-.0582189
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0835248{col 26}{space 2} .1097175{col 37}{space 1}    0.76{col 46}{space 3}0.447{col 54}{space 4}-.1324478{col 67}{space 3} .2994974
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0571075{col 26}{space 2} .0931255{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 54}{space 4}-.1262046{col 67}{space 3} .2404196
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0279454{col 26}{space 2}  .092603{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.1543382{col 67}{space 3}  .210229
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0609782{col 26}{space 2} .0826271{col 37}{space 1}    0.74{col 46}{space 3}0.461{col 54}{space 4}-.1016686{col 67}{space 3} .2236249
{txt}{space 10}p4 {c |}{col 14}{res}{space 2}  .086511{col 26}{space 2} .0903084{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.0912558{col 67}{space 3} .2642778
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0607964{col 26}{space 2} .0933306{col 37}{space 1}    0.65{col 46}{space 3}0.515{col 54}{space 4}-.1229196{col 67}{space 3} .2445124
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0351616{col 26}{space 2} .0901927{col 37}{space 1}    0.39{col 46}{space 3}0.697{col 54}{space 4}-.1423775{col 67}{space 3} .2127007
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .1212053{col 26}{space 2} .0922831{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.0604486{col 67}{space 3} .3028591
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0865218{col 26}{space 2} .0918496{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}-.0942788{col 67}{space 3} .2673223
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0212173{col 26}{space 2}  .090037{col 37}{space 1}    0.24{col 46}{space 3}0.814{col 54}{space 4}-.1560153{col 67}{space 3} .1984498
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0299314{col 26}{space 2}  .093171{col 37}{space 1}    0.32{col 46}{space 3}0.748{col 54}{space 4}-.1534703{col 67}{space 3} .2133331
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0226218{col 26}{space 2} .0918452{col 37}{space 1}    0.25{col 46}{space 3}0.806{col 54}{space 4}-.1581702{col 67}{space 3} .2034137
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0845647{col 26}{space 2} .0905461{col 37}{space 1}    0.93{col 46}{space 3}0.351{col 54}{space 4}  -.09367{col 67}{space 3} .2627994
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0244709{col 26}{space 2} .0906339{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-.1539367{col 67}{space 3} .2028785
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0258841{col 26}{space 2}  .091695{col 37}{space 1}    0.28{col 46}{space 3}0.778{col 54}{space 4}-.1546122{col 67}{space 3} .2063804
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0322278{col 26}{space 2} .0912504{col 37}{space 1}    0.35{col 46}{space 3}0.724{col 54}{space 4}-.1473934{col 67}{space 3}  .211849
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0059539{col 26}{space 2}  .088258{col 37}{space 1}   -0.07{col 46}{space 3}0.946{col 54}{space 4}-.1796846{col 67}{space 3} .1677768
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0875602{col 26}{space 2} .0809353{col 37}{space 1}   -1.08{col 46}{space 3}0.280{col 54}{space 4}-.2468765{col 67}{space 3} .0717562
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .1402228{col 26}{space 2} .0890374{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4}-.0350421{col 67}{space 3} .3154878
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0601854{col 26}{space 2} .0965684{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4}-.1299039{col 67}{space 3} .2502747
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0403474{col 26}{space 2} .0904988{col 37}{space 1}    0.45{col 46}{space 3}0.656{col 54}{space 4}-.1377941{col 67}{space 3}  .218489
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}     .063{col 26}{space 2} .0928439{col 37}{space 1}    0.68{col 46}{space 3}0.498{col 54}{space 4}-.1197578{col 67}{space 3} .2457579
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .1197993{col 26}{space 2} .0901785{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-.0577119{col 67}{space 3} .2973104
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .1114419{col 26}{space 2} .1086188{col 37}{space 1}    1.03{col 46}{space 3}0.306{col 54}{space 4}-.1023679{col 67}{space 3} .3252517
{txt}{space 9}p26 {c |}{col 14}{res}{space 2} .0235304{col 26}{space 2} .0879601{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.1496139{col 67}{space 3} .1966746
{txt}{space 9}p27 {c |}{col 14}{res}{space 2} .0250011{col 26}{space 2} .0773863{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-.1273293{col 67}{space 3} .1773316
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.602234{col 26}{space 2} .1971221{col 37}{space 1}   13.20{col 46}{space 3}0.000{col 54}{space 4} 2.214211{col 67}{space 3} 2.990257
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross2.tex"'"':estcross2.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross2.txt""':seeout}
2010
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       309
{txt}{hline 13}{c +}{hline 34}   F(28, 280)      = {res}    19.12
{txt}       Model {c |} {res}  5.1598083        28  .184278868   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.69904539       280  .009639448   {txt}R-squared       ={res}    0.6566
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6222
{txt}       Total {c |} {res} 7.85885369       308  .025515759   {txt}Root MSE        =   {res} .09818

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}open1 {c |}{col 14}{res}{space 2} .2883277{col 26}{space 2} .0793765{col 37}{space 1}    3.63{col 46}{space 3}0.000{col 54}{space 4} .1320772{col 67}{space 3} .4445781
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2} -.200419{col 26}{space 2} .0129496{col 37}{space 1}  -15.48{col 46}{space 3}0.000{col 54}{space 4}  -.22591{col 67}{space 3} -.174928
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0715877{col 26}{space 2} .0097801{col 37}{space 1}   -7.32{col 46}{space 3}0.000{col 54}{space 4}-.0908395{col 67}{space 3}-.0523359
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .1348909{col 26}{space 2} .0823768{col 37}{space 1}    1.64{col 46}{space 3}0.103{col 54}{space 4}-.0272656{col 67}{space 3} .2970474
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0550808{col 26}{space 2} .0774826{col 37}{space 1}    0.71{col 46}{space 3}0.478{col 54}{space 4}-.0974416{col 67}{space 3} .2076031
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0306941{col 26}{space 2} .0768782{col 37}{space 1}    0.40{col 46}{space 3}0.690{col 54}{space 4}-.1206385{col 67}{space 3} .1820268
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0197644{col 26}{space 2} .0543917{col 37}{space 1}    0.36{col 46}{space 3}0.717{col 54}{space 4}-.0873041{col 67}{space 3} .1268328
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0930751{col 26}{space 2}  .075116{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4}-.0547887{col 67}{space 3} .2409388
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0682356{col 26}{space 2} .0774951{col 37}{space 1}    0.88{col 46}{space 3}0.379{col 54}{space 4}-.0843113{col 67}{space 3} .2207826
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}  .032666{col 26}{space 2} .0749548{col 37}{space 1}    0.44{col 46}{space 3}0.663{col 54}{space 4}-.1148805{col 67}{space 3} .1802125
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .1209036{col 26}{space 2} .0773507{col 37}{space 1}    1.56{col 46}{space 3}0.119{col 54}{space 4}-.0313592{col 67}{space 3} .2731663
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0970528{col 26}{space 2} .0771692{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4}-.0548526{col 67}{space 3} .2489583
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0386775{col 26}{space 2} .0748698{col 37}{space 1}    0.52{col 46}{space 3}0.606{col 54}{space 4}-.1087017{col 67}{space 3} .1860567
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0357642{col 26}{space 2}  .077959{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4} -.117696{col 67}{space 3} .1892244
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0321887{col 26}{space 2} .0763554{col 37}{space 1}    0.42{col 46}{space 3}0.674{col 54}{space 4}-.1181147{col 67}{space 3} .1824921
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}  .074234{col 26}{space 2} .0754903{col 37}{space 1}    0.98{col 46}{space 3}0.326{col 54}{space 4}-.0743666{col 67}{space 3} .2228345
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0254964{col 26}{space 2} .0752124{col 37}{space 1}    0.34{col 46}{space 3}0.735{col 54}{space 4}-.1225572{col 67}{space 3} .1735499
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0431694{col 26}{space 2} .0761199{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.1066706{col 67}{space 3} .1930094
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0350361{col 26}{space 2} .0757442{col 37}{space 1}    0.46{col 46}{space 3}0.644{col 54}{space 4}-.1140643{col 67}{space 3} .1841365
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0143762{col 26}{space 2} .0742654{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-.1605656{col 67}{space 3} .1318132
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1340721{col 26}{space 2} .0521419{col 37}{space 1}   -2.57{col 46}{space 3}0.011{col 54}{space 4}-.2367119{col 67}{space 3}-.0314322
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .0889571{col 26}{space 2} .0737947{col 37}{space 1}    1.21{col 46}{space 3}0.229{col 54}{space 4}-.0563058{col 67}{space 3} .2342199
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0852459{col 26}{space 2} .0800937{col 37}{space 1}    1.06{col 46}{space 3}0.288{col 54}{space 4}-.0724164{col 67}{space 3} .2429081
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}  .083172{col 26}{space 2} .0750834{col 37}{space 1}    1.11{col 46}{space 3}0.269{col 54}{space 4}-.0646276{col 67}{space 3} .2309716
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0671735{col 26}{space 2} .0770428{col 37}{space 1}    0.87{col 46}{space 3}0.384{col 54}{space 4}-.0844832{col 67}{space 3} .2188303
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .1124941{col 26}{space 2} .0747208{col 37}{space 1}    1.51{col 46}{space 3}0.133{col 54}{space 4}-.0345917{col 67}{space 3}   .25958
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .2579034{col 26}{space 2} .0900514{col 37}{space 1}    2.86{col 46}{space 3}0.005{col 54}{space 4} .0806397{col 67}{space 3} .4351671
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2} .0200333{col 26}{space 2} .0517257{col 37}{space 1}    0.39{col 46}{space 3}0.699{col 54}{space 4}-.0817874{col 67}{space 3} .1218539
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.608375{col 26}{space 2} .1675624{col 37}{space 1}   15.57{col 46}{space 3}0.000{col 54}{space 4} 2.278533{col 67}{space 3} 2.938217
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross2.tex"'"':estcross2.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross2.txt""':seeout}
2011
note: p3 omitted because of collinearity
note: p22 omitted because of collinearity
note: p25 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       307
{txt}{hline 13}{c +}{hline 34}   F(28, 278)      = {res}    18.61
{txt}       Model {c |} {res} 5.31586911        28  .189852468   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.83599158       278  .010201409   {txt}R-squared       ={res}    0.6521
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6171
{txt}       Total {c |} {res} 8.15186069       306  .026640068   {txt}Root MSE        =   {res}   .101

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}open1 {c |}{col 14}{res}{space 2} .2790135{col 26}{space 2} .0804314{col 37}{space 1}    3.47{col 46}{space 3}0.001{col 54}{space 4} .1206816{col 67}{space 3} .4373454
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.2079498{col 26}{space 2} .0134367{col 37}{space 1}  -15.48{col 46}{space 3}0.000{col 54}{space 4}-.2344004{col 67}{space 3}-.1814992
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0685754{col 26}{space 2} .0100741{col 37}{space 1}   -6.81{col 46}{space 3}0.000{col 54}{space 4}-.0884067{col 67}{space 3}-.0487441
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.0683938{col 26}{space 2} .0677686{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-.2017986{col 67}{space 3} .0650111
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.1823258{col 26}{space 2} .0697869{col 37}{space 1}   -2.61{col 46}{space 3}0.009{col 54}{space 4}-.3197037{col 67}{space 3}-.0449478
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.2017099{col 26}{space 2} .0683947{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.3363472{col 67}{space 3}-.0670726
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2} -.131253{col 26}{space 2} .0670257{col 37}{space 1}   -1.96{col 46}{space 3}0.051{col 54}{space 4}-.2631954{col 67}{space 3} .0006894
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.1613003{col 26}{space 2} .0691575{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-.2974391{col 67}{space 3}-.0251615
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} -.199531{col 26}{space 2} .0660121{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.3294781{col 67}{space 3}-.0695839
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.1100679{col 26}{space 2} .0704475{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-.2487463{col 67}{space 3} .0286105
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.1437398{col 26}{space 2} .0700889{col 37}{space 1}   -2.05{col 46}{space 3}0.041{col 54}{space 4}-.2817123{col 67}{space 3}-.0057674
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.1810817{col 26}{space 2} .0660752{col 37}{space 1}   -2.74{col 46}{space 3}0.007{col 54}{space 4} -.311153{col 67}{space 3}-.0510104
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} -.194794{col 26}{space 2} .0706712{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-.3339126{col 67}{space 3}-.0556753
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.1893264{col 26}{space 2} .0679617{col 37}{space 1}   -2.79{col 46}{space 3}0.006{col 54}{space 4}-.3231113{col 67}{space 3}-.0555416
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} -.160375{col 26}{space 2} .0677544{col 37}{space 1}   -2.37{col 46}{space 3}0.019{col 54}{space 4}-.2937519{col 67}{space 3}-.0269981
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} -.214299{col 26}{space 2} .0664956{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-.3451978{col 67}{space 3}-.0834002
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} -.192305{col 26}{space 2} .0681138{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.3263893{col 67}{space 3}-.0582207
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.1955399{col 26}{space 2} .0673135{col 37}{space 1}   -2.90{col 46}{space 3}0.004{col 54}{space 4}-.3280488{col 67}{space 3} -.063031
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.2510027{col 26}{space 2} .0665837{col 37}{space 1}   -3.77{col 46}{space 3}0.000{col 54}{space 4}-.3820749{col 67}{space 3}-.1199306
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1557049{col 26}{space 2} .0432219{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.2407887{col 67}{space 3}-.0706211
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.2347267{col 26}{space 2} .0925862{col 37}{space 1}   -2.54{col 46}{space 3}0.012{col 54}{space 4}-.4169858{col 67}{space 3}-.0524676
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.1396556{col 26}{space 2} .0646563{col 37}{space 1}   -2.16{col 46}{space 3}0.032{col 54}{space 4}-.2669337{col 67}{space 3}-.0123774
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.1339173{col 26}{space 2} .0720138{col 37}{space 1}   -1.86{col 46}{space 3}0.064{col 54}{space 4} -.275679{col 67}{space 3} .0078443
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}-.1471889{col 26}{space 2} .0656935{col 37}{space 1}   -2.24{col 46}{space 3}0.026{col 54}{space 4}-.2765088{col 67}{space 3} -.017869
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}-.1561878{col 26}{space 2} .0686279{col 37}{space 1}   -2.28{col 46}{space 3}0.024{col 54}{space 4}-.2912842{col 67}{space 3}-.0210915
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.1055317{col 26}{space 2} .0649259{col 37}{space 1}   -1.63{col 46}{space 3}0.105{col 54}{space 4}-.2333404{col 67}{space 3} .0222771
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2} .0127334{col 26}{space 2} .0559837{col 37}{space 1}    0.23{col 46}{space 3}0.820{col 54}{space 4}-.0974725{col 67}{space 3} .1229393
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}-.0001845{col 26}{space 2} .0434949{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.0858058{col 67}{space 3} .0854368
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.933027{col 26}{space 2} .1648355{col 37}{space 1}   17.79{col 46}{space 3}0.000{col 54}{space 4} 2.608542{col 67}{space 3} 3.257511
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross2.tex"'"':estcross2.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross2.txt""':seeout}
2012
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       312
{txt}{hline 13}{c +}{hline 34}   F(29, 282)      = {res}    17.71
{txt}       Model {c |} {res} 8.31225424        29  .286629457   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4.56318019       282   .01618149   {txt}R-squared       ={res}    0.6456
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6091
{txt}       Total {c |} {res} 12.8754344       311  .041400111   {txt}Root MSE        =   {res} .12721

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}open1 {c |}{col 14}{res}{space 2} .3816151{col 26}{space 2}   .09508{col 37}{space 1}    4.01{col 46}{space 3}0.000{col 54}{space 4} .1944584{col 67}{space 3} .5687718
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.2049494{col 26}{space 2} .0173167{col 37}{space 1}  -11.84{col 46}{space 3}0.000{col 54}{space 4}-.2390359{col 67}{space 3} -.170863
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0653763{col 26}{space 2} .0124285{col 37}{space 1}   -5.26{col 46}{space 3}0.000{col 54}{space 4}-.0898406{col 67}{space 3}-.0409119
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.0615663{col 26}{space 2} .0933188{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-.2452561{col 67}{space 3} .1221236
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.1740429{col 26}{space 2} .0878659{col 37}{space 1}   -1.98{col 46}{space 3}0.049{col 54}{space 4}-.3469992{col 67}{space 3}-.0010866
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.1836246{col 26}{space 2} .0861722{col 37}{space 1}   -2.13{col 46}{space 3}0.034{col 54}{space 4}-.3532471{col 67}{space 3}-.0140021
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}-.0001328{col 26}{space 2} .0703628{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.1386359{col 67}{space 3} .1383702
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} -.125998{col 26}{space 2} .0840931{col 37}{space 1}   -1.50{col 46}{space 3}0.135{col 54}{space 4}-.2915278{col 67}{space 3} .0395318
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.1531338{col 26}{space 2} .0873395{col 37}{space 1}   -1.75{col 46}{space 3}0.081{col 54}{space 4}-.3250539{col 67}{space 3} .0187862
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.1899679{col 26}{space 2} .0830955{col 37}{space 1}   -2.29{col 46}{space 3}0.023{col 54}{space 4}-.3535341{col 67}{space 3}-.0264018
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.1082178{col 26}{space 2} .0889471{col 37}{space 1}   -1.22{col 46}{space 3}0.225{col 54}{space 4}-.2833023{col 67}{space 3} .0668667
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.1648801{col 26}{space 2} .0881284{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4} -.338353{col 67}{space 3} .0085929
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.1733985{col 26}{space 2} .0832828{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4}-.3373333{col 67}{space 3}-.0094636
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.1827204{col 26}{space 2} .0891527{col 37}{space 1}   -2.05{col 46}{space 3}0.041{col 54}{space 4}-.3582097{col 67}{space 3}-.0072311
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.1765635{col 26}{space 2} .0856457{col 37}{space 1}   -2.06{col 46}{space 3}0.040{col 54}{space 4}-.3451495{col 67}{space 3}-.0079775
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.1603067{col 26}{space 2} .0855856{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4}-.3287744{col 67}{space 3}  .008161
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.1992804{col 26}{space 2} .0842058{col 37}{space 1}   -2.37{col 46}{space 3}0.019{col 54}{space 4}-.3650321{col 67}{space 3}-.0335288
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.1751321{col 26}{space 2} .0860902{col 37}{space 1}   -2.03{col 46}{space 3}0.043{col 54}{space 4}-.3445931{col 67}{space 3}-.0056711
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.1767649{col 26}{space 2} .0848037{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4}-.3436936{col 67}{space 3}-.0098362
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.2556587{col 26}{space 2} .0837213{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-.4204567{col 67}{space 3}-.0908607
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1574323{col 26}{space 2} .0675117{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-.2903231{col 67}{space 3}-.0245415
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.2110462{col 26}{space 2} .1168192{col 37}{space 1}   -1.81{col 46}{space 3}0.072{col 54}{space 4}-.4409946{col 67}{space 3} .0189021
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.1021318{col 26}{space 2} .0814355{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-.2624303{col 67}{space 3} .0581667
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.1198175{col 26}{space 2} .0906323{col 37}{space 1}   -1.32{col 46}{space 3}0.187{col 54}{space 4}-.2982193{col 67}{space 3} .0585843
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}-.1367724{col 26}{space 2} .0826608{col 37}{space 1}   -1.65{col 46}{space 3}0.099{col 54}{space 4}-.2994828{col 67}{space 3}  .025938
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}  .531641{col 26}{space 2} .0825197{col 37}{space 1}    6.44{col 46}{space 3}0.000{col 54}{space 4} .3692082{col 67}{space 3} .6940738
{txt}{space 9}p23 {c |}{col 14}{res}{space 2} -.158205{col 26}{space 2} .0874955{col 37}{space 1}   -1.81{col 46}{space 3}0.072{col 54}{space 4}-.3304322{col 67}{space 3} .0140222
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.0979576{col 26}{space 2} .0817178{col 37}{space 1}   -1.20{col 46}{space 3}0.232{col 54}{space 4}-.2588118{col 67}{space 3} .0628966
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0122943{col 26}{space 2} .0670398{col 37}{space 1}   -0.18{col 46}{space 3}0.855{col 54}{space 4}-.1442562{col 67}{space 3} .1196676
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.892292{col 26}{space 2} .2113029{col 37}{space 1}   13.69{col 46}{space 3}0.000{col 54}{space 4}  2.47636{col 67}{space 3} 3.308223
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross2.tex"'"':estcross2.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross2.txt""':seeout}
2013

{com}. 
. *** 截面回归3
. forvalues i= 2007/2013{c -(}
{txt}  2{com}.         reg lgovsize open lngdppc lnpop anr p1-p27 if year == `i'
{txt}  3{com}.         if `i' == 2007 {c -(}
{txt}  4{com}.                 outreg2 using estcross3, tex drop(p* o.p*) ctitle(`i') replace title("安")
{txt}  5{com}.         {c )-}
{txt}  6{com}.         else{c -(}
{txt}  7{com}.                 outreg2 using estcross3, tex drop(p* o.p*) ctitle(`i') append
{txt}  8{com}.         {c )-}
{txt}  9{com}.         di `i'
{txt} 10{com}. {c )-}
{txt}note: p3 omitted because of collinearity
note: p10 omitted because of collinearity
note: p16 omitted because of collinearity
note: p17 omitted because of collinearity
note: p18 omitted because of collinearity
note: p19 omitted because of collinearity
note: p20 omitted because of collinearity
note: p21 omitted because of collinearity
note: p22 omitted because of collinearity
note: p23 omitted because of collinearity
note: p24 omitted because of collinearity
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity
note: p27 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       183
{txt}{hline 13}{c +}{hline 34}   F(17, 165)      = {res}    21.14
{txt}       Model {c |} {res} .253836152        17  .014931538   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  .11656048       165  .000706427   {txt}R-squared       ={res}    0.6853
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6529
{txt}       Total {c |} {res} .370396632       182  .002035146   {txt}Root MSE        =   {res} .02658

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lgovsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .2378889{col 26}{space 2} .0537857{col 37}{space 1}    4.42{col 46}{space 3}0.000{col 54}{space 4}  .131692{col 67}{space 3} .3440858
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0577766{col 26}{space 2} .0047549{col 37}{space 1}  -12.15{col 46}{space 3}0.000{col 54}{space 4} -.067165{col 67}{space 3}-.0483882
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2} -.018908{col 26}{space 2} .0035491{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-.0259154{col 67}{space 3}-.0119006
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .1044892{col 26}{space 2}  .012895{col 37}{space 1}    8.10{col 46}{space 3}0.000{col 54}{space 4} .0790286{col 67}{space 3} .1299497
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0194471{col 26}{space 2} .0122475{col 37}{space 1}    1.59{col 46}{space 3}0.114{col 54}{space 4}-.0047349{col 67}{space 3} .0436291
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0596029{col 26}{space 2} .0124963{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4} .0349296{col 67}{space 3} .0842762
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2} .0537354{col 26}{space 2} .0115262{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .0309775{col 67}{space 3} .0764933
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0590903{col 26}{space 2} .0128183{col 37}{space 1}    4.61{col 46}{space 3}0.000{col 54}{space 4} .0337812{col 67}{space 3} .0843993
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0360948{col 26}{space 2} .0118946{col 37}{space 1}    3.03{col 46}{space 3}0.003{col 54}{space 4} .0126096{col 67}{space 3}   .05958
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0192443{col 26}{space 2} .0119118{col 37}{space 1}    1.62{col 46}{space 3}0.108{col 54}{space 4}-.0042749{col 67}{space 3} .0427635
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0456651{col 26}{space 2} .0121153{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4}  .021744{col 67}{space 3} .0695861
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0222438{col 26}{space 2} .0115072{col 37}{space 1}    1.93{col 46}{space 3}0.055{col 54}{space 4}-.0004766{col 67}{space 3} .0449642
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p11 {c |}{col 14}{res}{space 2}  .022023{col 26}{space 2} .0122291{col 37}{space 1}    1.80{col 46}{space 3}0.074{col 54}{space 4}-.0021227{col 67}{space 3} .0461688
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0180364{col 26}{space 2} .0113746{col 37}{space 1}    1.59{col 46}{space 3}0.115{col 54}{space 4}-.0044222{col 67}{space 3}  .040495
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0164256{col 26}{space 2} .0113424{col 37}{space 1}    1.45{col 46}{space 3}0.149{col 54}{space 4}-.0059692{col 67}{space 3} .0388205
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}  .012894{col 26}{space 2}   .01229{col 37}{space 1}    1.05{col 46}{space 3}0.296{col 54}{space 4}-.0113718{col 67}{space 3} .0371599
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0297735{col 26}{space 2} .0117465{col 37}{space 1}    2.53{col 46}{space 3}0.012{col 54}{space 4} .0065807{col 67}{space 3} .0529664
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p17 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p24 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} .7546759{col 26}{space 2}  .056112{col 37}{space 1}   13.45{col 46}{space 3}0.000{col 54}{space 4} .6438859{col 67}{space 3} .8654659
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross3.tex"'"':estcross3.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross3.txt""':seeout}
2007
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       297
{txt}{hline 13}{c +}{hline 34}   F(28, 268)      = {res}    15.83
{txt}       Model {c |} {res} 1.53561435        28   .05484337   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .928507753       268  .003464581   {txt}R-squared       ={res}    0.6232
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5838
{txt}       Total {c |} {res}  2.4641221       296  .008324737   {txt}Root MSE        =   {res} .05886

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lgovsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .2121587{col 26}{space 2} .0755191{col 37}{space 1}    2.81{col 46}{space 3}0.005{col 54}{space 4} .0634726{col 67}{space 3} .3608448
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1042678{col 26}{space 2}  .007429{col 37}{space 1}  -14.04{col 46}{space 3}0.000{col 54}{space 4}-.1188944{col 67}{space 3}-.0896412
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0422409{col 26}{space 2} .0059117{col 37}{space 1}   -7.15{col 46}{space 3}0.000{col 54}{space 4}-.0538801{col 67}{space 3}-.0306017
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0771153{col 26}{space 2}  .051311{col 37}{space 1}    1.50{col 46}{space 3}0.134{col 54}{space 4}-.0239086{col 67}{space 3} .1781391
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0296973{col 26}{space 2} .0464684{col 37}{space 1}    0.64{col 46}{space 3}0.523{col 54}{space 4}-.0617922{col 67}{space 3} .1211867
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0368347{col 26}{space 2} .0460548{col 37}{space 1}    0.80{col 46}{space 3}0.425{col 54}{space 4}-.0538406{col 67}{space 3}   .12751
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0196968{col 26}{space 2} .0358554{col 37}{space 1}    0.55{col 46}{space 3}0.583{col 54}{space 4}-.0508973{col 67}{space 3}  .090291
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0561252{col 26}{space 2} .0449495{col 37}{space 1}    1.25{col 46}{space 3}0.213{col 54}{space 4}-.0323739{col 67}{space 3} .1446243
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0431677{col 26}{space 2} .0464023{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}-.0481918{col 67}{space 3} .1345272
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}  .028606{col 26}{space 2} .0450164{col 37}{space 1}    0.64{col 46}{space 3}0.526{col 54}{space 4}-.0600247{col 67}{space 3} .1172366
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0516508{col 26}{space 2} .0463167{col 37}{space 1}    1.12{col 46}{space 3}0.266{col 54}{space 4}-.0395401{col 67}{space 3} .1428416
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0512664{col 26}{space 2} .0464572{col 37}{space 1}    1.10{col 46}{space 3}0.271{col 54}{space 4}-.0402011{col 67}{space 3} .1427338
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0087867{col 26}{space 2} .0448436{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-.0795038{col 67}{space 3} .0970773
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0128021{col 26}{space 2} .0472503{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-.0802268{col 67}{space 3}  .105831
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0115128{col 26}{space 2} .0458434{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4}-.0787462{col 67}{space 3} .1017718
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}  .041772{col 26}{space 2} .0452669{col 37}{space 1}    0.92{col 46}{space 3}0.357{col 54}{space 4}-.0473521{col 67}{space 3}  .130896
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0207101{col 26}{space 2} .0451981{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4}-.0682785{col 67}{space 3} .1096987
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0026533{col 26}{space 2} .0456826{col 37}{space 1}    0.06{col 46}{space 3}0.954{col 54}{space 4}-.0872891{col 67}{space 3} .0925957
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0242489{col 26}{space 2} .0454331{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4}-.0652023{col 67}{space 3} .1137001
{txt}{space 9}p16 {c |}{col 14}{res}{space 2} .0087028{col 26}{space 2} .0447098{col 37}{space 1}    0.19{col 46}{space 3}0.846{col 54}{space 4}-.0793243{col 67}{space 3} .0967299
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0861332{col 26}{space 2} .0338118{col 37}{space 1}   -2.55{col 46}{space 3}0.011{col 54}{space 4}-.1527036{col 67}{space 3}-.0195627
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .0444481{col 26}{space 2} .0444277{col 37}{space 1}    1.00{col 46}{space 3}0.318{col 54}{space 4}-.0430237{col 67}{space 3} .1319199
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0342169{col 26}{space 2} .0490613{col 37}{space 1}    0.70{col 46}{space 3}0.486{col 54}{space 4}-.0623778{col 67}{space 3} .1308115
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0597068{col 26}{space 2} .0455947{col 37}{space 1}    1.31{col 46}{space 3}0.191{col 54}{space 4}-.0300626{col 67}{space 3} .1494762
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0232174{col 26}{space 2} .0462289{col 37}{space 1}    0.50{col 46}{space 3}0.616{col 54}{space 4}-.0678006{col 67}{space 3} .1142355
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .0666345{col 26}{space 2} .0449314{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-.0218289{col 67}{space 3} .1550978
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}  .063873{col 26}{space 2} .0590652{col 37}{space 1}    1.08{col 46}{space 3}0.280{col 54}{space 4}-.0524178{col 67}{space 3} .1801637
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0221335{col 26}{space 2} .0342436{col 37}{space 1}   -0.65{col 46}{space 3}0.519{col 54}{space 4}-.0895542{col 67}{space 3} .0452872
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.376099{col 26}{space 2} .0948902{col 37}{space 1}   14.50{col 46}{space 3}0.000{col 54}{space 4} 1.189274{col 67}{space 3} 1.562925
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross3.tex"'"':estcross3.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross3.txt""':seeout}
2008
note: p18 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       303
{txt}{hline 13}{c +}{hline 34}   F(29, 273)      = {res}    10.76
{txt}       Model {c |} {res} 3.26086438        29  .112443599   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.85334889       273  .010451827   {txt}R-squared       ={res}    0.5333
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4838
{txt}       Total {c |} {res} 6.11421327       302  .020245739   {txt}Root MSE        =   {res} .10223

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lgovsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .3753931{col 26}{space 2} .1729172{col 37}{space 1}    2.17{col 46}{space 3}0.031{col 54}{space 4} .0349723{col 67}{space 3} .7158138
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1389652{col 26}{space 2} .0131832{col 37}{space 1}  -10.54{col 46}{space 3}0.000{col 54}{space 4}-.1649188{col 67}{space 3}-.1130116
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2} -.052356{col 26}{space 2} .0103688{col 37}{space 1}   -5.05{col 46}{space 3}0.000{col 54}{space 4} -.072769{col 67}{space 3}-.0319431
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0544992{col 26}{space 2}  .085945{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4}-.1147001{col 67}{space 3} .2236984
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0209265{col 26}{space 2} .0807173{col 37}{space 1}    0.26{col 46}{space 3}0.796{col 54}{space 4}-.1379809{col 67}{space 3} .1798339
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0283475{col 26}{space 2} .0800553{col 37}{space 1}    0.35{col 46}{space 3}0.724{col 54}{space 4}-.1292567{col 67}{space 3} .1859516
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0616176{col 26}{space 2} .0568071{col 37}{space 1}    1.08{col 46}{space 3}0.279{col 54}{space 4} -.050218{col 67}{space 3} .1734531
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0458106{col 26}{space 2} .0781025{col 37}{space 1}    0.59{col 46}{space 3}0.558{col 54}{space 4}-.1079491{col 67}{space 3} .1995703
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0440984{col 26}{space 2} .0806705{col 37}{space 1}    0.55{col 46}{space 3}0.585{col 54}{space 4} -.114717{col 67}{space 3} .2029138
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0066957{col 26}{space 2} .0781672{col 37}{space 1}    0.09{col 46}{space 3}0.932{col 54}{space 4}-.1471914{col 67}{space 3} .1605827
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0702885{col 26}{space 2} .0804421{col 37}{space 1}    0.87{col 46}{space 3}0.383{col 54}{space 4}-.0880772{col 67}{space 3} .2286542
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0503406{col 26}{space 2} .0801728{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-.1074948{col 67}{space 3}  .208176
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0049801{col 26}{space 2} .0778973{col 37}{space 1}    0.06{col 46}{space 3}0.949{col 54}{space 4}-.1483758{col 67}{space 3} .1583359
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}  .014659{col 26}{space 2}  .082054{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4}-.1468801{col 67}{space 3}  .176198
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0035018{col 26}{space 2} .0801191{col 37}{space 1}    0.04{col 46}{space 3}0.965{col 54}{space 4}-.1542279{col 67}{space 3} .1612316
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0399704{col 26}{space 2} .0789658{col 37}{space 1}    0.51{col 46}{space 3}0.613{col 54}{space 4}-.1154889{col 67}{space 3} .1954297
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} 4.34e-06{col 26}{space 2} .0783047{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1541534{col 67}{space 3} .1541621
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.0081458{col 26}{space 2} .0793437{col 37}{space 1}   -0.10{col 46}{space 3}0.918{col 54}{space 4} -.164349{col 67}{space 3} .1480575
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0156401{col 26}{space 2} .0789184{col 37}{space 1}    0.20{col 46}{space 3}0.843{col 54}{space 4}-.1397258{col 67}{space 3} .1710061
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0140134{col 26}{space 2} .0776373{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-.1668574{col 67}{space 3} .1388306
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0825365{col 26}{space 2} .0548477{col 37}{space 1}   -1.50{col 46}{space 3}0.134{col 54}{space 4}-.1905148{col 67}{space 3} .0254417
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .1411298{col 26}{space 2} .0771447{col 37}{space 1}    1.83{col 46}{space 3}0.068{col 54}{space 4}-.0107442{col 67}{space 3} .2930039
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0520342{col 26}{space 2} .0836546{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4} -.112656{col 67}{space 3} .2167244
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0340407{col 26}{space 2} .0787659{col 37}{space 1}    0.43{col 46}{space 3}0.666{col 54}{space 4}-.1210252{col 67}{space 3} .1891065
{txt}{space 9}p22 {c |}{col 14}{res}{space 2} .0721459{col 26}{space 2} .0702977{col 37}{space 1}    1.03{col 46}{space 3}0.306{col 54}{space 4}-.0662487{col 67}{space 3} .2105404
{txt}{space 9}p23 {c |}{col 14}{res}{space 2} .0305671{col 26}{space 2} .0802982{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}-.1275152{col 67}{space 3} .1886495
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .1342691{col 26}{space 2} .0780201{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0193284{col 67}{space 3} .2878666
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .0190594{col 26}{space 2} .1255066{col 37}{space 1}    0.15{col 46}{space 3}0.879{col 54}{space 4}-.2280244{col 67}{space 3} .2661432
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0142626{col 26}{space 2} .0545216{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-.1215987{col 67}{space 3} .0930736
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.807524{col 26}{space 2} .1702948{col 37}{space 1}   10.61{col 46}{space 3}0.000{col 54}{space 4} 1.472266{col 67}{space 3} 2.142782
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross3.tex"'"':estcross3.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross3.txt""':seeout}
2009
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       310
{txt}{hline 13}{c +}{hline 34}   F(29, 280)      = {res}    14.52
{txt}       Model {c |} {res}  4.6429628        29  .160102166   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.08792982       280  .011028321   {txt}R-squared       ={res}    0.6006
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5592
{txt}       Total {c |} {res} 7.73089262       309   .02501907   {txt}Root MSE        =   {res} .10502

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lgovsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .3265322{col 26}{space 2} .1569415{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0175971{col 67}{space 3} .6354673
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1820217{col 26}{space 2} .0136707{col 37}{space 1}  -13.31{col 46}{space 3}0.000{col 54}{space 4}-.2089321{col 67}{space 3}-.1551113
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2} -.070438{col 26}{space 2}  .010467{col 37}{space 1}   -6.73{col 46}{space 3}0.000{col 54}{space 4}-.0910421{col 67}{space 3} -.049834
{txt}{space 9}anr {c |}{col 14}{res}{space 2}  .079603{col 26}{space 2} .0978158{col 37}{space 1}    0.81{col 46}{space 3}0.416{col 54}{space 4}-.1129448{col 67}{space 3} .2721507
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0091315{col 26}{space 2} .0828206{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 54}{space 4}-.1538987{col 67}{space 3} .1721616
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.0062897{col 26}{space 2} .0822637{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.1682235{col 67}{space 3}  .155644
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0265165{col 26}{space 2}  .073733{col 37}{space 1}    0.36{col 46}{space 3}0.719{col 54}{space 4}-.1186248{col 67}{space 3} .1716578
{txt}{space 10}p4 {c |}{col 14}{res}{space 2}  .054927{col 26}{space 2} .0801747{col 37}{space 1}    0.69{col 46}{space 3}0.494{col 54}{space 4}-.1028946{col 67}{space 3} .2127486
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0259952{col 26}{space 2} .0828368{col 37}{space 1}    0.31{col 46}{space 3}0.754{col 54}{space 4}-.1370667{col 67}{space 3} .1890571
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.0112768{col 26}{space 2} .0802997{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.1693446{col 67}{space 3}  .146791
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0745369{col 26}{space 2} .0824575{col 37}{space 1}    0.90{col 46}{space 3}0.367{col 54}{space 4}-.0877784{col 67}{space 3} .2368522
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0490173{col 26}{space 2} .0822201{col 37}{space 1}    0.60{col 46}{space 3}0.552{col 54}{space 4}-.1128307{col 67}{space 3} .2108653
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.0074567{col 26}{space 2} .0800018{col 37}{space 1}   -0.09{col 46}{space 3}0.926{col 54}{space 4} -.164938{col 67}{space 3} .1500247
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.0046062{col 26}{space 2} .0832345{col 37}{space 1}   -0.06{col 46}{space 3}0.956{col 54}{space 4} -.168451{col 67}{space 3} .1592387
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.0105353{col 26}{space 2} .0817524{col 37}{space 1}   -0.13{col 46}{space 3}0.898{col 54}{space 4}-.1714627{col 67}{space 3} .1503921
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0340136{col 26}{space 2} .0805432{col 37}{space 1}    0.42{col 46}{space 3}0.673{col 54}{space 4}-.1245335{col 67}{space 3} .1925608
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.0127992{col 26}{space 2} .0804598{col 37}{space 1}   -0.16{col 46}{space 3}0.874{col 54}{space 4}-.1711821{col 67}{space 3} .1455837
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.0093346{col 26}{space 2} .0814857{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}-.1697369{col 67}{space 3} .1510677
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.0038801{col 26}{space 2} .0810888{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.1635013{col 67}{space 3}  .155741
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0348309{col 26}{space 2} .0794215{col 37}{space 1}   -0.44{col 46}{space 3}0.661{col 54}{space 4}-.1911699{col 67}{space 3}  .121508
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1161689{col 26}{space 2} .0725168{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-.2589163{col 67}{space 3} .0265784
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .1017015{col 26}{space 2}  .079367{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.0545303{col 67}{space 3} .2579334
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0013029{col 26}{space 2} .0860145{col 37}{space 1}    0.02{col 46}{space 3}0.988{col 54}{space 4}-.1680143{col 67}{space 3} .1706201
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}  .000049{col 26}{space 2} .0806388{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.1586863{col 67}{space 3} .1587844
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0158522{col 26}{space 2} .0824774{col 37}{space 1}    0.19{col 46}{space 3}0.848{col 54}{space 4}-.1465023{col 67}{space 3} .1782067
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .0929107{col 26}{space 2} .0802818{col 37}{space 1}    1.16{col 46}{space 3}0.248{col 54}{space 4}-.0651218{col 67}{space 3} .2509433
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .0103861{col 26}{space 2} .0966387{col 37}{space 1}    0.11{col 46}{space 3}0.914{col 54}{space 4}-.1798445{col 67}{space 3} .2006167
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}-.0373514{col 26}{space 2} .0786415{col 37}{space 1}   -0.47{col 46}{space 3}0.635{col 54}{space 4}-.1921551{col 67}{space 3} .1174523
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}-.0032305{col 26}{space 2} .0692225{col 37}{space 1}   -0.05{col 46}{space 3}0.963{col 54}{space 4}-.1394931{col 67}{space 3}  .133032
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.413235{col 26}{space 2} .1769473{col 37}{space 1}   13.64{col 46}{space 3}0.000{col 54}{space 4} 2.064919{col 67}{space 3} 2.761551
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross3.tex"'"':estcross3.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross3.txt""':seeout}
2010
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       309
{txt}{hline 13}{c +}{hline 34}   F(28, 280)      = {res}    13.28
{txt}       Model {c |} {res} 5.13024807        28  .183223145   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.86415679       280   .01380056   {txt}R-squared       ={res}    0.5704
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5274
{txt}       Total {c |} {res} 8.99440486       308  .029202613   {txt}Root MSE        =   {res} .11748

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lgovsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .4167552{col 26}{space 2} .1766457{col 37}{space 1}    2.36{col 46}{space 3}0.019{col 54}{space 4}  .069033{col 67}{space 3} .7644774
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1971992{col 26}{space 2} .0154897{col 37}{space 1}  -12.73{col 46}{space 3}0.000{col 54}{space 4}-.2276903{col 67}{space 3}-.1667082
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0774763{col 26}{space 2} .0117445{col 37}{space 1}   -6.60{col 46}{space 3}0.000{col 54}{space 4} -.100595{col 67}{space 3}-.0543576
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .1306251{col 26}{space 2} .0984575{col 37}{space 1}    1.33{col 46}{space 3}0.186{col 54}{space 4}-.0631857{col 67}{space 3} .3244359
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}  .060484{col 26}{space 2}  .092687{col 37}{space 1}    0.65{col 46}{space 3}0.515{col 54}{space 4}-.1219679{col 67}{space 3} .2429359
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0401791{col 26}{space 2} .0918676{col 37}{space 1}    0.44{col 46}{space 3}0.662{col 54}{space 4}-.1406597{col 67}{space 3}  .221018
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0204592{col 26}{space 2} .0650731{col 37}{space 1}    0.31{col 46}{space 3}0.753{col 54}{space 4}-.1076354{col 67}{space 3} .1485538
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0979729{col 26}{space 2} .0897476{col 37}{space 1}    1.09{col 46}{space 3}0.276{col 54}{space 4}-.0786928{col 67}{space 3} .2746387
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0769651{col 26}{space 2} .0925564{col 37}{space 1}    0.83{col 46}{space 3}0.406{col 54}{space 4}-.1052297{col 67}{space 3} .2591598
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0464058{col 26}{space 2} .0897447{col 37}{space 1}    0.52{col 46}{space 3}0.606{col 54}{space 4}-.1302542{col 67}{space 3} .2230657
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .1266072{col 26}{space 2} .0928243{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.0561148{col 67}{space 3} .3093292
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}  .109062{col 26}{space 2} .0927194{col 37}{space 1}    1.18{col 46}{space 3}0.240{col 54}{space 4}-.0734535{col 67}{space 3} .2915776
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0310097{col 26}{space 2} .0895275{col 37}{space 1}    0.35{col 46}{space 3}0.729{col 54}{space 4}-.1452226{col 67}{space 3} .2072421
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0452199{col 26}{space 2}  .093519{col 37}{space 1}    0.48{col 46}{space 3}0.629{col 54}{space 4}-.1388697{col 67}{space 3} .2293094
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0336348{col 26}{space 2} .0914147{col 37}{space 1}    0.37{col 46}{space 3}0.713{col 54}{space 4}-.1463125{col 67}{space 3} .2135822
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}  .079794{col 26}{space 2}   .09041{col 37}{space 1}    0.88{col 46}{space 3}0.378{col 54}{space 4}-.0981755{col 67}{space 3} .2577636
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0270784{col 26}{space 2}  .089885{col 37}{space 1}    0.30{col 46}{space 3}0.763{col 54}{space 4}-.1498579{col 67}{space 3} .2040146
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}  .044936{col 26}{space 2} .0909868{col 37}{space 1}    0.49{col 46}{space 3}0.622{col 54}{space 4}-.1341689{col 67}{space 3}  .224041
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0447776{col 26}{space 2} .0905472{col 37}{space 1}    0.49{col 46}{space 3}0.621{col 54}{space 4}-.1334621{col 67}{space 3} .2230172
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0005863{col 26}{space 2} .0894777{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-.1767207{col 67}{space 3} .1755481
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1211929{col 26}{space 2} .0624642{col 37}{space 1}   -1.94{col 46}{space 3}0.053{col 54}{space 4}-.2441519{col 67}{space 3}  .001766
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .1597691{col 26}{space 2} .0882345{col 37}{space 1}    1.81{col 46}{space 3}0.071{col 54}{space 4}-.0139182{col 67}{space 3} .3334563
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}  .077606{col 26}{space 2}   .09585{col 37}{space 1}    0.81{col 46}{space 3}0.419{col 54}{space 4}-.1110722{col 67}{space 3} .2662842
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}   .05674{col 26}{space 2} .0898726{col 37}{space 1}    0.63{col 46}{space 3}0.528{col 54}{space 4}-.1201718{col 67}{space 3} .2336518
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0823626{col 26}{space 2}  .092059{col 37}{space 1}    0.89{col 46}{space 3}0.372{col 54}{space 4} -.098853{col 67}{space 3} .2635781
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .1345192{col 26}{space 2} .0894475{col 37}{space 1}    1.50{col 46}{space 3}0.134{col 54}{space 4}-.0415557{col 67}{space 3} .3105941
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .1402153{col 26}{space 2} .1076224{col 37}{space 1}    1.30{col 46}{space 3}0.194{col 54}{space 4}-.0716364{col 67}{space 3}  .352067
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2} -.006821{col 26}{space 2} .0618887{col 37}{space 1}   -0.11{col 46}{space 3}0.912{col 54}{space 4}-.1286472{col 67}{space 3} .1150051
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2.60066{col 26}{space 2}   .20066{col 37}{space 1}   12.96{col 46}{space 3}0.000{col 54}{space 4} 2.205666{col 67}{space 3} 2.995654
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross3.tex"'"':estcross3.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross3.txt""':seeout}
2011
note: p3 omitted because of collinearity
note: p22 omitted because of collinearity
note: p25 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       308
{txt}{hline 13}{c +}{hline 34}   F(28, 279)      = {res}    17.82
{txt}       Model {c |} {res} 5.04026417        28  .180009435   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.81850994       279  .010102186   {txt}R-squared       ={res}    0.6414
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6054
{txt}       Total {c |} {res} 7.85877411       307  .025598613   {txt}Root MSE        =   {res} .10051

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lgovsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .4506825{col 26}{space 2} .1552203{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .1451308{col 67}{space 3} .7562343
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1955717{col 26}{space 2}  .013344{col 37}{space 1}  -14.66{col 46}{space 3}0.000{col 54}{space 4}-.2218395{col 67}{space 3} -.169304
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0686367{col 26}{space 2} .0100528{col 37}{space 1}   -6.83{col 46}{space 3}0.000{col 54}{space 4}-.0884257{col 67}{space 3}-.0488476
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.1163723{col 26}{space 2} .0674155{col 37}{space 1}   -1.73{col 46}{space 3}0.085{col 54}{space 4}-.2490799{col 67}{space 3} .0163352
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.2273531{col 26}{space 2} .0695146{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4}-.3641927{col 67}{space 3}-.0905135
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.2451572{col 26}{space 2} .0680768{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4}-.3791665{col 67}{space 3}-.1111478
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2}-.1833498{col 26}{space 2} .0667331{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.3147142{col 67}{space 3}-.0519855
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.2018652{col 26}{space 2} .0688262{col 37}{space 1}   -2.93{col 46}{space 3}0.004{col 54}{space 4}-.3373497{col 67}{space 3}-.0663806
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.2450189{col 26}{space 2} .0658176{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-.3745811{col 67}{space 3}-.1154568
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.1516038{col 26}{space 2} .0702908{col 37}{space 1}   -2.16{col 46}{space 3}0.032{col 54}{space 4}-.2899716{col 67}{space 3}-.0132361
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.1819149{col 26}{space 2} .0700052{col 37}{space 1}   -2.60{col 46}{space 3}0.010{col 54}{space 4}-.3197204{col 67}{space 3}-.0441094
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.2379058{col 26}{space 2} .0658163{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-.3674654{col 67}{space 3}-.1083462
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.2383817{col 26}{space 2} .0704923{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4} -.377146{col 67}{space 3}-.0996174
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.2435237{col 26}{space 2} .0677442{col 37}{space 1}   -3.59{col 46}{space 3}0.000{col 54}{space 4}-.3768783{col 67}{space 3}-.1101691
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.2073942{col 26}{space 2} .0675684{col 37}{space 1}   -3.07{col 46}{space 3}0.002{col 54}{space 4}-.3404028{col 67}{space 3}-.0743855
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.2641797{col 26}{space 2} .0662073{col 37}{space 1}   -3.99{col 46}{space 3}0.000{col 54}{space 4} -.394509{col 67}{space 3}-.1338505
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.2273163{col 26}{space 2} .0673401{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-.3598754{col 67}{space 3}-.0947572
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} -.237755{col 26}{space 2} .0670186{col 37}{space 1}   -3.55{col 46}{space 3}0.000{col 54}{space 4}-.3696815{col 67}{space 3}-.1058286
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.2876961{col 26}{space 2} .0664989{col 37}{space 1}   -4.33{col 46}{space 3}0.000{col 54}{space 4}-.4185993{col 67}{space 3}-.1567929
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1641844{col 26}{space 2} .0431998{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-.2492234{col 67}{space 3}-.0791455
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.2653483{col 26}{space 2} .0920192{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-.4464884{col 67}{space 3}-.0842081
{txt}{space 9}p19 {c |}{col 14}{res}{space 2} -.181433{col 26}{space 2} .0643766{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.3081585{col 67}{space 3}-.0547074
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.1654283{col 26}{space 2} .0716924{col 37}{space 1}   -2.31{col 46}{space 3}0.022{col 54}{space 4}-.3065551{col 67}{space 3}-.0243015
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}-.1825346{col 26}{space 2}  .065439{col 37}{space 1}   -2.79{col 46}{space 3}0.006{col 54}{space 4}-.3113515{col 67}{space 3}-.0537177
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}-.2001542{col 26}{space 2} .0683026{col 37}{space 1}   -2.93{col 46}{space 3}0.004{col 54}{space 4} -.334608{col 67}{space 3}-.0657004
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.1513839{col 26}{space 2} .0646704{col 37}{space 1}   -2.34{col 46}{space 3}0.020{col 54}{space 4}-.2786877{col 67}{space 3}-.0240801
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}-.0158335{col 26}{space 2} .0556972{col 37}{space 1}   -0.28{col 46}{space 3}0.776{col 54}{space 4}-.1254735{col 67}{space 3} .0938066
{txt}{space 9}p27 {c |}{col 14}{res}{space 2} .0076021{col 26}{space 2} .0432473{col 37}{space 1}    0.18{col 46}{space 3}0.861{col 54}{space 4}-.0775303{col 67}{space 3} .0927345
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.838839{col 26}{space 2} .1633998{col 37}{space 1}   17.37{col 46}{space 3}0.000{col 54}{space 4} 2.517186{col 67}{space 3} 3.160492
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross3.tex"'"':estcross3.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross3.txt""':seeout}
2012
note: p18 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       311
{txt}{hline 13}{c +}{hline 34}   F(29, 281)      = {res}    16.83
{txt}       Model {c |} {res} 8.68611618        29  .299521247   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 5.00200058       281  .017800714   {txt}R-squared       ={res}    0.6346
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5969
{txt}       Total {c |} {res} 13.6881168       310  .044155215   {txt}Root MSE        =   {res} .13342

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    lgovsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .6695882{col 26}{space 2} .1967086{col 37}{space 1}    3.40{col 46}{space 3}0.001{col 54}{space 4} .2823787{col 67}{space 3} 1.056798
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1982971{col 26}{space 2} .0181339{col 37}{space 1}  -10.94{col 46}{space 3}0.000{col 54}{space 4}-.2339926{col 67}{space 3}-.1626017
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0566286{col 26}{space 2} .0130915{col 37}{space 1}   -4.33{col 46}{space 3}0.000{col 54}{space 4}-.0823984{col 67}{space 3}-.0308588
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .1519174{col 26}{space 2} .1119008{col 37}{space 1}    1.36{col 46}{space 3}0.176{col 54}{space 4}-.0683528{col 67}{space 3} .3721876
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.0101014{col 26}{space 2} .1051451{col 37}{space 1}   -0.10{col 46}{space 3}0.924{col 54}{space 4}-.2170734{col 67}{space 3} .1968705
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.0226027{col 26}{space 2} .1043482{col 37}{space 1}   -0.22{col 46}{space 3}0.829{col 54}{space 4}-.2280062{col 67}{space 3} .1828007
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}  -.03589{col 26}{space 2} .0737865{col 37}{space 1}   -0.49{col 46}{space 3}0.627{col 54}{space 4}-.1811343{col 67}{space 3} .1093544
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0494548{col 26}{space 2} .1017726{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4}-.1508788{col 67}{space 3} .2497883
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0310426{col 26}{space 2} .1050351{col 37}{space 1}    0.30{col 46}{space 3}0.768{col 54}{space 4} -.175713{col 67}{space 3} .2377982
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.0164842{col 26}{space 2} .1020226{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-.2173097{col 67}{space 3} .1843413
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0645555{col 26}{space 2} .1050545{col 37}{space 1}    0.61{col 46}{space 3}0.539{col 54}{space 4}-.1422382{col 67}{space 3} .2713492
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0067381{col 26}{space 2} .1048867{col 37}{space 1}    0.06{col 46}{space 3}0.949{col 54}{space 4}-.1997253{col 67}{space 3} .2132015
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0053234{col 26}{space 2} .1016992{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-.1948656{col 67}{space 3} .2055124
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.0148396{col 26}{space 2} .1060854{col 37}{space 1}   -0.14{col 46}{space 3}0.889{col 54}{space 4}-.2236626{col 67}{space 3} .1939835
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} -.001458{col 26}{space 2} .1038188{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-.2058194{col 67}{space 3} .2029034
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0100168{col 26}{space 2} .1024321{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 54}{space 4}-.1916149{col 67}{space 3} .2116486
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} -.021799{col 26}{space 2} .1020454{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-.2226694{col 67}{space 3} .1790714
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0041153{col 26}{space 2} .1046609{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4}-.2019037{col 67}{space 3} .2101342
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.0079566{col 26}{space 2} .1028185{col 37}{space 1}   -0.08{col 46}{space 3}0.938{col 54}{space 4}-.2103489{col 67}{space 3} .1944357
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0734631{col 26}{space 2} .1014752{col 37}{space 1}   -0.72{col 46}{space 3}0.470{col 54}{space 4}-.2732112{col 67}{space 3}  .126285
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1886381{col 26}{space 2} .0709546{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4}-.3283081{col 67}{space 3}-.0489681
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .0525112{col 26}{space 2} .1002743{col 37}{space 1}    0.52{col 46}{space 3}0.601{col 54}{space 4}-.1448729{col 67}{space 3} .2498953
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0735457{col 26}{space 2}  .108773{col 37}{space 1}    0.68{col 46}{space 3}0.500{col 54}{space 4}-.1405676{col 67}{space 3}  .287659
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0559541{col 26}{space 2} .1021661{col 37}{space 1}    0.55{col 46}{space 3}0.584{col 54}{space 4}-.1451538{col 67}{space 3} .2570621
{txt}{space 9}p22 {c |}{col 14}{res}{space 2} .5482149{col 26}{space 2} .0864743{col 37}{space 1}    6.34{col 46}{space 3}0.000{col 54}{space 4} .3779952{col 67}{space 3} .7184346
{txt}{space 9}p23 {c |}{col 14}{res}{space 2} .0332002{col 26}{space 2} .1054886{col 37}{space 1}    0.31{col 46}{space 3}0.753{col 54}{space 4}-.1744481{col 67}{space 3} .2408484
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .0924312{col 26}{space 2} .1017707{col 37}{space 1}    0.91{col 46}{space 3}0.365{col 54}{space 4}-.1078985{col 67}{space 3} .2927609
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .2722673{col 26}{space 2} .1224152{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} .0313001{col 67}{space 3} .5132344
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0083064{col 26}{space 2} .0703187{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-.1467246{col 67}{space 3} .1301119
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.588547{col 26}{space 2} .2372841{col 37}{space 1}   10.91{col 46}{space 3}0.000{col 54}{space 4} 2.121467{col 67}{space 3} 3.055627
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross3.tex"'"':estcross3.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross3.txt""':seeout}
2013

{com}. 
. *** 截面估计4
. forvalues i= 2007/2013{c -(}
{txt}  2{com}.         reg govsize lopen lngdppc lnpop anr p1-p27 if year == `i'
{txt}  3{com}.         if `i' == 2007 {c -(}
{txt}  4{com}.                 outreg2 using estcross4, tex drop(p* o.p*) ctitle(`i') replace title("安")
{txt}  5{com}.         {c )-}
{txt}  6{com}.         else{c -(}
{txt}  7{com}.                 outreg2 using estcross4, tex drop(p* o.p*) ctitle(`i') append
{txt}  8{com}.         {c )-}
{txt}  9{com}.         di `i'
{txt} 10{com}. {c )-}
{txt}note: p20 omitted because of collinearity
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       303
{txt}{hline 13}{c +}{hline 34}   F(28, 274)      = {res}    18.77
{txt}       Model {c |} {res} 2.08789351        28  .074567625   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.08825581       274  .003971737   {txt}R-squared       ={res}    0.6574
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6224
{txt}       Total {c |} {res} 3.17614932       302  .010517051   {txt}Root MSE        =   {res} .06302

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lopen {c |}{col 14}{res}{space 2} .2777393{col 26}{space 2} .0830354{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} .1142709{col 67}{space 3} .4412076
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1124584{col 26}{space 2} .0077697{col 37}{space 1}  -14.47{col 46}{space 3}0.000{col 54}{space 4}-.1277544{col 67}{space 3}-.0971625
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0456284{col 26}{space 2} .0061783{col 37}{space 1}   -7.39{col 46}{space 3}0.000{col 54}{space 4}-.0577914{col 67}{space 3}-.0334654
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.0980915{col 26}{space 2}  .046349{col 37}{space 1}   -2.12{col 46}{space 3}0.035{col 54}{space 4}-.1893368{col 67}{space 3}-.0068462
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.1221517{col 26}{space 2} .0442361{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-.2092375{col 67}{space 3}-.0350659
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.1172199{col 26}{space 2} .0431523{col 37}{space 1}   -2.72{col 46}{space 3}0.007{col 54}{space 4} -.202172{col 67}{space 3}-.0322678
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0301912{col 26}{space 2} .0352357{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-.0391759{col 67}{space 3} .0995583
{txt}{space 10}p4 {c |}{col 14}{res}{space 2}-.1005228{col 26}{space 2} .0421535{col 37}{space 1}   -2.38{col 46}{space 3}0.018{col 54}{space 4}-.1835087{col 67}{space 3}-.0175368
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.1182225{col 26}{space 2}  .043549{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.2039557{col 67}{space 3}-.0324893
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.1301086{col 26}{space 2} .0415155{col 37}{space 1}   -3.13{col 46}{space 3}0.002{col 54}{space 4}-.2118385{col 67}{space 3}-.0483786
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} -.098616{col 26}{space 2}  .044608{col 37}{space 1}   -2.21{col 46}{space 3}0.028{col 54}{space 4} -.186434{col 67}{space 3} -.010798
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.0892277{col 26}{space 2} .0444867{col 37}{space 1}   -2.01{col 46}{space 3}0.046{col 54}{space 4}-.1768069{col 67}{space 3}-.0016486
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} -.148498{col 26}{space 2} .0414991{col 37}{space 1}   -3.58{col 46}{space 3}0.000{col 54}{space 4}-.2301957{col 67}{space 3}-.0668003
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.1456174{col 26}{space 2} .0444947{col 37}{space 1}   -3.27{col 46}{space 3}0.001{col 54}{space 4}-.2332123{col 67}{space 3}-.0580225
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.1457873{col 26}{space 2} .0427252{col 37}{space 1}   -3.41{col 46}{space 3}0.001{col 54}{space 4}-.2298987{col 67}{space 3}-.0616759
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.1065591{col 26}{space 2}  .043265{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.1917333{col 67}{space 3} -.021385
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.1367258{col 26}{space 2} .0424033{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-.2202034{col 67}{space 3}-.0532482
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.1554262{col 26}{space 2} .0429685{col 37}{space 1}   -3.62{col 46}{space 3}0.000{col 54}{space 4}-.2400166{col 67}{space 3}-.0708358
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.1328619{col 26}{space 2} .0423759{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.2162855{col 67}{space 3}-.0494382
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.1530134{col 26}{space 2} .0420699{col 37}{space 1}   -3.64{col 46}{space 3}0.000{col 54}{space 4}-.2358346{col 67}{space 3}-.0701921
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0673419{col 26}{space 2}  .033395{col 37}{space 1}   -2.02{col 46}{space 3}0.045{col 54}{space 4}-.1330853{col 67}{space 3}-.0015985
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.1424728{col 26}{space 2} .0581779{col 37}{space 1}   -2.45{col 46}{space 3}0.015{col 54}{space 4}-.2570052{col 67}{space 3}-.0279403
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.1104679{col 26}{space 2} .0406462{col 37}{space 1}   -2.72{col 46}{space 3}0.007{col 54}{space 4}-.1904864{col 67}{space 3}-.0304494
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}-.1013445{col 26}{space 2} .0410973{col 37}{space 1}   -2.47{col 46}{space 3}0.014{col 54}{space 4}-.1822511{col 67}{space 3}-.0204378
{txt}{space 9}p22 {c |}{col 14}{res}{space 2} .0777094{col 26}{space 2} .0433333{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4}-.0075991{col 67}{space 3} .1630179
{txt}{space 9}p23 {c |}{col 14}{res}{space 2}-.1400214{col 26}{space 2} .0430688{col 37}{space 1}   -3.25{col 46}{space 3}0.001{col 54}{space 4}-.2248091{col 67}{space 3}-.0552336
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.0898422{col 26}{space 2} .0405924{col 37}{space 1}   -2.21{col 46}{space 3}0.028{col 54}{space 4}-.1697547{col 67}{space 3}-.0099296
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2} .0094079{col 26}{space 2} .0332348{col 37}{space 1}    0.28{col 46}{space 3}0.777{col 54}{space 4}-.0560202{col 67}{space 3} .0748359
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.611404{col 26}{space 2} .0885785{col 37}{space 1}   18.19{col 46}{space 3}0.000{col 54}{space 4} 1.437023{col 67}{space 3} 1.785784
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross4.tex"'"':estcross4.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross4.txt""':seeout}
2007
note: p3 omitted because of collinearity
note: p5 omitted because of collinearity
note: p16 omitted because of collinearity
note: p17 omitted because of collinearity
note: p18 omitted because of collinearity
note: p19 omitted because of collinearity
note: p20 omitted because of collinearity
note: p21 omitted because of collinearity
note: p22 omitted because of collinearity
note: p23 omitted because of collinearity
note: p24 omitted because of collinearity
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity
note: p27 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       182
{txt}{hline 13}{c +}{hline 34}   F(17, 164)      = {res}    27.43
{txt}       Model {c |} {res} .335735617        17  .019749154   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .118071625       164  .000719949   {txt}R-squared       ={res}    0.7398
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7128
{txt}       Total {c |} {res} .453807241       181  .002507222   {txt}Root MSE        =   {res} .02683

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lopen {c |}{col 14}{res}{space 2} .2731964{col 26}{space 2} .0537888{col 37}{space 1}    5.08{col 46}{space 3}0.000{col 54}{space 4} .1669886{col 67}{space 3} .3794041
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0738408{col 26}{space 2} .0047876{col 37}{space 1}  -15.42{col 46}{space 3}0.000{col 54}{space 4} -.083294{col 67}{space 3}-.0643875
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2} -.018668{col 26}{space 2} .0036187{col 37}{space 1}   -5.16{col 46}{space 3}0.000{col 54}{space 4}-.0258132{col 67}{space 3}-.0115229
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0470307{col 26}{space 2} .0126392{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} .0220742{col 67}{space 3} .0719872
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.0363925{col 26}{space 2} .0124298{col 37}{space 1}   -2.93{col 46}{space 3}0.004{col 54}{space 4}-.0609356{col 67}{space 3}-.0118495
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.0066056{col 26}{space 2} .0123374{col 37}{space 1}   -0.54{col 46}{space 3}0.593{col 54}{space 4}-.0309663{col 67}{space 3} .0177551
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2}-.0062612{col 26}{space 2} .0115272{col 37}{space 1}   -0.54{col 46}{space 3}0.588{col 54}{space 4}-.0290221{col 67}{space 3} .0164997
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p6 {c |}{col 14}{res}{space 2}-.0105473{col 26}{space 2} .0118259{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-.0338979{col 67}{space 3} .0128033
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.0280069{col 26}{space 2} .0126778{col 37}{space 1}   -2.21{col 46}{space 3}0.029{col 54}{space 4}-.0530396{col 67}{space 3}-.0029743
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.0213487{col 26}{space 2} .0129086{col 37}{space 1}   -1.65{col 46}{space 3}0.100{col 54}{space 4}-.0468372{col 67}{space 3} .0041398
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.0214578{col 26}{space 2} .0113914{col 37}{space 1}   -1.88{col 46}{space 3}0.061{col 54}{space 4}-.0439505{col 67}{space 3} .0010348
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.0520903{col 26}{space 2} .0133851{col 37}{space 1}   -3.89{col 46}{space 3}0.000{col 54}{space 4}-.0785196{col 67}{space 3} -.025661
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} -.021657{col 26}{space 2} .0121674{col 37}{space 1}   -1.78{col 46}{space 3}0.077{col 54}{space 4} -.045682{col 67}{space 3}  .002368
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.0403954{col 26}{space 2} .0116992{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.0634959{col 67}{space 3} -.017295
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.0461269{col 26}{space 2} .0113141{col 37}{space 1}   -4.08{col 46}{space 3}0.000{col 54}{space 4} -.068467{col 67}{space 3}-.0237869
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.0408434{col 26}{space 2} .0119539{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 54}{space 4}-.0644468{col 67}{space 3}  -.01724
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.0216261{col 26}{space 2}  .011679{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-.0446867{col 67}{space 3} .0014344
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p17 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p24 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} .9921569{col 26}{space 2} .0571599{col 37}{space 1}   17.36{col 46}{space 3}0.000{col 54}{space 4} .8792927{col 67}{space 3} 1.105021
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross4.tex"'"':estcross4.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross4.txt""':seeout}
2008
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       304
{txt}{hline 13}{c +}{hline 34}   F(29, 274)      = {res}    13.48
{txt}       Model {c |} {res} 4.20541967        29  .145014471   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.94810547       274  .010759509   {txt}R-squared       ={res}    0.5879
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5443
{txt}       Total {c |} {res} 7.15352514       303  .023608994   {txt}Root MSE        =   {res} .10373

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lopen {c |}{col 14}{res}{space 2} .2664888{col 26}{space 2} .1329223{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4}   .00481{col 67}{space 3} .5281676
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1619274{col 26}{space 2} .0133684{col 37}{space 1}  -12.11{col 46}{space 3}0.000{col 54}{space 4}-.1882453{col 67}{space 3}-.1356095
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0634079{col 26}{space 2} .0104635{col 37}{space 1}   -6.06{col 46}{space 3}0.000{col 54}{space 4} -.084007{col 67}{space 3}-.0428088
{txt}{space 9}anr {c |}{col 14}{res}{space 2}  .038599{col 26}{space 2} .0869332{col 37}{space 1}    0.44{col 46}{space 3}0.657{col 54}{space 4}-.1325427{col 67}{space 3} .2097408
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.0060022{col 26}{space 2} .0829936{col 37}{space 1}   -0.07{col 46}{space 3}0.942{col 54}{space 4}-.1693884{col 67}{space 3}  .157384
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.0178858{col 26}{space 2} .0817301{col 37}{space 1}   -0.22{col 46}{space 3}0.827{col 54}{space 4}-.1787846{col 67}{space 3} .1430131
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0425074{col 26}{space 2} .0576381{col 37}{space 1}    0.74{col 46}{space 3}0.461{col 54}{space 4}-.0709623{col 67}{space 3} .1559772
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0281969{col 26}{space 2} .0801702{col 37}{space 1}    0.35{col 46}{space 3}0.725{col 54}{space 4}-.1296309{col 67}{space 3} .1860248
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0078491{col 26}{space 2} .0824324{col 37}{space 1}    0.10{col 46}{space 3}0.924{col 54}{space 4}-.1544323{col 67}{space 3} .1701304
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.0264979{col 26}{space 2} .0797441{col 37}{space 1}   -0.33{col 46}{space 3}0.740{col 54}{space 4}-.1834869{col 67}{space 3} .1304912
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0435004{col 26}{space 2} .0835765{col 37}{space 1}    0.52{col 46}{space 3}0.603{col 54}{space 4}-.1210333{col 67}{space 3} .2080342
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0309439{col 26}{space 2} .0830278{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.1325095{col 67}{space 3} .1943973
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.0292271{col 26}{space 2} .0795298{col 37}{space 1}   -0.37{col 46}{space 3}0.714{col 54}{space 4}-.1857942{col 67}{space 3} .1273401
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.0169587{col 26}{space 2} .0846194{col 37}{space 1}   -0.20{col 46}{space 3}0.841{col 54}{space 4}-.1835454{col 67}{space 3} .1496281
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.0274309{col 26}{space 2}  .081877{col 37}{space 1}   -0.34{col 46}{space 3}0.738{col 54}{space 4}-.1886188{col 67}{space 3}  .133757
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}  .012731{col 26}{space 2} .0816746{col 37}{space 1}    0.16{col 46}{space 3}0.876{col 54}{space 4}-.1480585{col 67}{space 3} .1735206
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.0283796{col 26}{space 2} .0802451{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}-.1863549{col 67}{space 3} .1295957
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.0263082{col 26}{space 2} .0810249{col 37}{space 1}   -0.32{col 46}{space 3}0.746{col 54}{space 4}-.1858187{col 67}{space 3} .1332023
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} -.017829{col 26}{space 2} .0806749{col 37}{space 1}   -0.22{col 46}{space 3}0.825{col 54}{space 4}-.1766503{col 67}{space 3} .1409923
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0449086{col 26}{space 2} .0803374{col 37}{space 1}   -0.56{col 46}{space 3}0.577{col 54}{space 4}-.2030656{col 67}{space 3} .1132483
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0956386{col 26}{space 2} .0556165{col 37}{space 1}   -1.72{col 46}{space 3}0.087{col 54}{space 4}-.2051285{col 67}{space 3} .0138513
{txt}{space 9}p18 {c |}{col 14}{res}{space 2} -.020115{col 26}{space 2} .1040896{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4} -.225032{col 67}{space 3} .1848019
{txt}{space 9}p19 {c |}{col 14}{res}{space 2} .0933069{col 26}{space 2} .0788304{col 37}{space 1}    1.18{col 46}{space 3}0.238{col 54}{space 4}-.0618834{col 67}{space 3} .2484971
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.0099362{col 26}{space 2} .0849173{col 37}{space 1}   -0.12{col 46}{space 3}0.907{col 54}{space 4}-.1771095{col 67}{space 3} .1572372
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0023541{col 26}{space 2} .0796824{col 37}{space 1}    0.03{col 46}{space 3}0.976{col 54}{space 4}-.1545133{col 67}{space 3} .1592216
{txt}{space 9}p22 {c |}{col 14}{res}{space 2} .0614736{col 26}{space 2}  .067544{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-.0714976{col 67}{space 3} .1944448
{txt}{space 9}p23 {c |}{col 14}{res}{space 2}-.0032908{col 26}{space 2} .0818604{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.1644461{col 67}{space 3} .1578644
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .0972619{col 26}{space 2} .0788767{col 37}{space 1}    1.23{col 46}{space 3}0.219{col 54}{space 4}-.0580194{col 67}{space 3} .2525432
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}-.0156764{col 26}{space 2} .0553926{col 37}{space 1}   -0.28{col 46}{space 3}0.777{col 54}{space 4}-.1247257{col 67}{space 3} .0933728
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.154015{col 26}{space 2} .1662957{col 37}{space 1}   12.95{col 46}{space 3}0.000{col 54}{space 4} 1.826635{col 67}{space 3} 2.481394
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross4.tex"'"':estcross4.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross4.txt""':seeout}
2009
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       311
{txt}{hline 13}{c +}{hline 34}   F(29, 281)      = {res}    13.01
{txt}       Model {c |} {res} 5.23154499        29  .180398103   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.89564834       281  .013863517   {txt}R-squared       ={res}    0.5732
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5291
{txt}       Total {c |} {res} 9.12719333       310  .029442559   {txt}Root MSE        =   {res} .11774

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lopen {c |}{col 14}{res}{space 2} .4543269{col 26}{space 2} .1944211{col 37}{space 1}    2.34{col 46}{space 3}0.020{col 54}{space 4} .0716202{col 67}{space 3} .8370335
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2} -.193147{col 26}{space 2} .0151882{col 37}{space 1}  -12.72{col 46}{space 3}0.000{col 54}{space 4}-.2230441{col 67}{space 3}-.1632499
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0795464{col 26}{space 2} .0117577{col 37}{space 1}   -6.77{col 46}{space 3}0.000{col 54}{space 4}-.1026908{col 67}{space 3} -.056402
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .0504577{col 26}{space 2} .1041023{col 37}{space 1}    0.48{col 46}{space 3}0.628{col 54}{space 4}-.1544616{col 67}{space 3}  .255377
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0352683{col 26}{space 2} .0928451{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4} -.147492{col 67}{space 3} .2180286
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0084227{col 26}{space 2} .0922175{col 37}{space 1}    0.09{col 46}{space 3}0.927{col 54}{space 4} -.173102{col 67}{space 3} .1899475
{txt}{space 10}p3 {c |}{col 14}{res}{space 2} .0661628{col 26}{space 2} .0743777{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4}-.0802455{col 67}{space 3} .2125711
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0640325{col 26}{space 2} .0898734{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4} -.112878{col 67}{space 3}  .240943
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0394325{col 26}{space 2} .0928438{col 37}{space 1}    0.42{col 46}{space 3}0.671{col 54}{space 4}-.1433251{col 67}{space 3} .2221901
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0173382{col 26}{space 2} .0900233{col 37}{space 1}    0.19{col 46}{space 3}0.847{col 54}{space 4}-.1598674{col 67}{space 3} .1945438
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0996023{col 26}{space 2} .0924757{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-.0824307{col 67}{space 3} .2816353
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0664665{col 26}{space 2} .0921886{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4}-.1150014{col 67}{space 3} .2479343
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0007302{col 26}{space 2} .0896797{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4}-.1757992{col 67}{space 3} .1772596
{txt}{space 9}p10 {c |}{col 14}{res}{space 2} .0112781{col 26}{space 2} .0933239{col 37}{space 1}    0.12{col 46}{space 3}0.904{col 54}{space 4}-.1724246{col 67}{space 3} .1949808
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0029735{col 26}{space 2} .0916467{col 37}{space 1}    0.03{col 46}{space 3}0.974{col 54}{space 4}-.1774278{col 67}{space 3} .1833748
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0620024{col 26}{space 2} .0903264{col 37}{space 1}    0.69{col 46}{space 3}0.493{col 54}{space 4}-.1157998{col 67}{space 3} .2398047
{txt}{space 9}p13 {c |}{col 14}{res}{space 2} .0028246{col 26}{space 2} .0901837{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-.1746968{col 67}{space 3}  .180346
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0056794{col 26}{space 2} .0913347{col 37}{space 1}    0.06{col 46}{space 3}0.950{col 54}{space 4}-.1741076{col 67}{space 3} .1854665
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0118958{col 26}{space 2} .0908879{col 37}{space 1}    0.13{col 46}{space 3}0.896{col 54}{space 4}-.1670117{col 67}{space 3} .1908033
{txt}{space 9}p16 {c |}{col 14}{res}{space 2} -.024891{col 26}{space 2} .0891679{col 37}{space 1}   -0.28{col 46}{space 3}0.780{col 54}{space 4}-.2004129{col 67}{space 3} .1506309
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.0756556{col 26}{space 2} .0728986{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-.2191523{col 67}{space 3} .0678412
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .1207265{col 26}{space 2} .0886948{col 37}{space 1}    1.36{col 46}{space 3}0.175{col 54}{space 4}-.0538641{col 67}{space 3}  .295317
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0422016{col 26}{space 2} .0963897{col 37}{space 1}    0.44{col 46}{space 3}0.662{col 54}{space 4}-.1475361{col 67}{space 3} .2319392
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0252047{col 26}{space 2} .0903851{col 37}{space 1}    0.28{col 46}{space 3}0.781{col 54}{space 4} -.152713{col 67}{space 3} .2031225
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0432834{col 26}{space 2} .0924476{col 37}{space 1}    0.47{col 46}{space 3}0.640{col 54}{space 4}-.1386943{col 67}{space 3} .2252611
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .1036638{col 26}{space 2}  .090008{col 37}{space 1}    1.15{col 46}{space 3}0.250{col 54}{space 4}-.0735117{col 67}{space 3} .2808393
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .0026754{col 26}{space 2} .1445371{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-.2818375{col 67}{space 3} .2871883
{txt}{space 9}p26 {c |}{col 14}{res}{space 2} .0390519{col 26}{space 2} .0808197{col 37}{space 1}    0.48{col 46}{space 3}0.629{col 54}{space 4} -.120037{col 67}{space 3} .1981408
{txt}{space 9}p27 {c |}{col 14}{res}{space 2} .0359065{col 26}{space 2} .0693578{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4}-.1006202{col 67}{space 3} .1724332
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.566914{col 26}{space 2} .1987107{col 37}{space 1}   12.92{col 46}{space 3}0.000{col 54}{space 4} 2.175764{col 67}{space 3} 2.958065
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross4.tex"'"':estcross4.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross4.txt""':seeout}
2010
note: p3 omitted because of collinearity
note: p22 omitted because of collinearity
note: p25 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       308
{txt}{hline 13}{c +}{hline 34}   F(28, 279)      = {res}    18.56
{txt}       Model {c |} {res} 5.11353799        28  .182626357   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.74531167       279  .009839827   {txt}R-squared       ={res}    0.6507
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6156
{txt}       Total {c |} {res} 7.85884966       307  .025598859   {txt}Root MSE        =   {res}  .0992

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lopen {c |}{col 14}{res}{space 2} .4221049{col 26}{space 2} .1487249{col 37}{space 1}    2.84{col 46}{space 3}0.005{col 54}{space 4} .1293394{col 67}{space 3} .7148704
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1977249{col 26}{space 2}  .013153{col 37}{space 1}  -15.03{col 46}{space 3}0.000{col 54}{space 4}-.2236166{col 67}{space 3}-.1718332
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0704033{col 26}{space 2} .0099527{col 37}{space 1}   -7.07{col 46}{space 3}0.000{col 54}{space 4}-.0899951{col 67}{space 3}-.0508115
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.1016952{col 26}{space 2}  .067267{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-.2341105{col 67}{space 3} .0307201
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.2051851{col 26}{space 2} .0687537{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4} -.340527{col 67}{space 3}-.0698433
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} -.228929{col 26}{space 2} .0672807{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.3613713{col 67}{space 3}-.0964867
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2}-.1676575{col 26}{space 2} .0655785{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4} -.296749{col 67}{space 3}-.0385659
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.1918326{col 26}{space 2} .0680217{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.3257335{col 67}{space 3}-.0579317
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.2239744{col 26}{space 2} .0649127{col 37}{space 1}   -3.45{col 46}{space 3}0.001{col 54}{space 4}-.3517554{col 67}{space 3}-.0961935
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.1352958{col 26}{space 2} .0695473{col 37}{space 1}   -1.95{col 46}{space 3}0.053{col 54}{space 4}   -.2722{col 67}{space 3} .0016083
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.1569373{col 26}{space 2} .0691871{col 37}{space 1}   -2.27{col 46}{space 3}0.024{col 54}{space 4}-.2931324{col 67}{space 3}-.0207422
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.2216559{col 26}{space 2} .0650242{col 37}{space 1}   -3.41{col 46}{space 3}0.001{col 54}{space 4}-.3496562{col 67}{space 3}-.0936556
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.2186948{col 26}{space 2} .0695707{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.3556451{col 67}{space 3}-.0817446
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.2274614{col 26}{space 2} .0669102{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.3591743{col 67}{space 3}-.0957485
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} -.183537{col 26}{space 2} .0668446{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.3151208{col 67}{space 3}-.0519532
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.2347488{col 26}{space 2} .0657574{col 37}{space 1}   -3.57{col 46}{space 3}0.000{col 54}{space 4}-.3641925{col 67}{space 3}-.1053052
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} -.216666{col 26}{space 2} .0665368{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-.3476438{col 67}{space 3}-.0856882
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.2252162{col 26}{space 2} .0662097{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.3555502{col 67}{space 3}-.0948821
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.2652035{col 26}{space 2} .0657491{col 37}{space 1}   -4.03{col 46}{space 3}0.000{col 54}{space 4}-.3946307{col 67}{space 3}-.1357762
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1560254{col 26}{space 2} .0437801{col 37}{space 1}   -3.56{col 46}{space 3}0.000{col 54}{space 4}-.2422067{col 67}{space 3}-.0698442
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.2583218{col 26}{space 2} .0910751{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.4376034{col 67}{space 3}-.0790402
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.1703784{col 26}{space 2} .0635709{col 37}{space 1}   -2.68{col 46}{space 3}0.008{col 54}{space 4} -.295518{col 67}{space 3}-.0452388
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.1725099{col 26}{space 2} .0707866{col 37}{space 1}   -2.44{col 46}{space 3}0.015{col 54}{space 4}-.3118535{col 67}{space 3}-.0331664
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}-.1761909{col 26}{space 2} .0646426{col 37}{space 1}   -2.73{col 46}{space 3}0.007{col 54}{space 4}-.3034401{col 67}{space 3}-.0489416
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}-.1926643{col 26}{space 2} .0674668{col 37}{space 1}   -2.86{col 46}{space 3}0.005{col 54}{space 4} -.325473{col 67}{space 3}-.0598556
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.1467746{col 26}{space 2} .0638825{col 37}{space 1}   -2.30{col 46}{space 3}0.022{col 54}{space 4}-.2725276{col 67}{space 3}-.0210217
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}-.0225064{col 26}{space 2} .0558906{col 37}{space 1}   -0.40{col 46}{space 3}0.687{col 54}{space 4}-.1325271{col 67}{space 3} .0875143
{txt}{space 9}p27 {c |}{col 14}{res}{space 2} .0018255{col 26}{space 2} .0437382{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-.0842734{col 67}{space 3} .0879243
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.834261{col 26}{space 2}  .159285{col 37}{space 1}   17.79{col 46}{space 3}0.000{col 54}{space 4} 2.520708{col 67}{space 3} 3.147814
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross4.tex"'"':estcross4.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross4.txt""':seeout}
2011
note: p3 omitted because of collinearity
note: p22 omitted because of collinearity
note: p25 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       307
{txt}{hline 13}{c +}{hline 34}   F(28, 278)      = {res}    18.23
{txt}       Model {c |} {res} 5.27714846        28  .188469588   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.87471222       278  .010340691   {txt}R-squared       ={res}    0.6474
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6118
{txt}       Total {c |} {res} 8.15186069       306  .026640068   {txt}Root MSE        =   {res} .10169

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lopen {c |}{col 14}{res}{space 2} .4361169{col 26}{space 2} .1529799{col 37}{space 1}    2.85{col 46}{space 3}0.005{col 54}{space 4} .1349708{col 67}{space 3}  .737263
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.2059853{col 26}{space 2} .0136085{col 37}{space 1}  -15.14{col 46}{space 3}0.000{col 54}{space 4} -.232774{col 67}{space 3}-.1791965
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0678172{col 26}{space 2} .0101773{col 37}{space 1}   -6.66{col 46}{space 3}0.000{col 54}{space 4}-.0878516{col 67}{space 3}-.0477828
{txt}{space 9}anr {c |}{col 14}{res}{space 2}-.0714181{col 26}{space 2} .0682118{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-.2056953{col 67}{space 3} .0628591
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.1855736{col 26}{space 2} .0703545{col 37}{space 1}   -2.64{col 46}{space 3}0.009{col 54}{space 4}-.3240687{col 67}{space 3}-.0470784
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.2030752{col 26}{space 2}  .068879{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.3386659{col 67}{space 3}-.0674845
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2}-.1335241{col 26}{space 2} .0675104{col 37}{space 1}   -1.98{col 46}{space 3}0.049{col 54}{space 4}-.2664207{col 67}{space 3}-.0006276
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.1633275{col 26}{space 2} .0696343{col 37}{space 1}   -2.35{col 46}{space 3}0.020{col 54}{space 4} -.300405{col 67}{space 3}-.0262501
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.1990151{col 26}{space 2}  .066528{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-.3299776{col 67}{space 3}-.0680525
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.1121164{col 26}{space 2} .0711758{col 37}{space 1}   -1.58{col 46}{space 3}0.116{col 54}{space 4}-.2522283{col 67}{space 3} .0279956
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.1433798{col 26}{space 2} .0708257{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4}-.2828026{col 67}{space 3}-.0039569
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.1828168{col 26}{space 2} .0665812{col 37}{space 1}   -2.75{col 46}{space 3}0.006{col 54}{space 4}-.3138842{col 67}{space 3}-.0517495
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.1935884{col 26}{space 2} .0712901{col 37}{space 1}   -2.72{col 46}{space 3}0.007{col 54}{space 4}-.3339253{col 67}{space 3}-.0532515
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.1926551{col 26}{space 2} .0685628{col 37}{space 1}   -2.81{col 46}{space 3}0.005{col 54}{space 4}-.3276233{col 67}{space 3}-.0576868
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.1635622{col 26}{space 2} .0683718{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.2981544{col 67}{space 3}-.0289701
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.2158901{col 26}{space 2} .0669825{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-.3477474{col 67}{space 3}-.0840328
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.1947078{col 26}{space 2} .0686103{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.3297695{col 67}{space 3}-.0596461
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.1976074{col 26}{space 2} .0678146{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-.3311028{col 67}{space 3} -.064112
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.2461041{col 26}{space 2} .0673221{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}  -.37863{col 67}{space 3}-.1135783
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1524324{col 26}{space 2}  .043595{col 37}{space 1}   -3.50{col 46}{space 3}0.001{col 54}{space 4}-.2382505{col 67}{space 3}-.0666142
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.2236967{col 26}{space 2}  .093096{col 37}{space 1}   -2.40{col 46}{space 3}0.017{col 54}{space 4}-.4069593{col 67}{space 3}-.0404342
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.1407724{col 26}{space 2} .0651362{col 37}{space 1}   -2.16{col 46}{space 3}0.032{col 54}{space 4}-.2689952{col 67}{space 3}-.0125496
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.1339535{col 26}{space 2}  .072545{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-.2767609{col 67}{space 3} .0088538
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}-.1448647{col 26}{space 2} .0661523{col 37}{space 1}   -2.19{col 46}{space 3}0.029{col 54}{space 4}-.2750878{col 67}{space 3}-.0146417
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}-.1581083{col 26}{space 2}  .069112{col 37}{space 1}   -2.29{col 46}{space 3}0.023{col 54}{space 4}-.2941576{col 67}{space 3}-.0220589
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.1087706{col 26}{space 2} .0654906{col 37}{space 1}   -1.66{col 46}{space 3}0.098{col 54}{space 4}-.2376912{col 67}{space 3}   .02015
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2} .0143164{col 26}{space 2} .0563805{col 37}{space 1}    0.25{col 46}{space 3}0.800{col 54}{space 4}-.0966705{col 67}{space 3} .1253032
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}  .004653{col 26}{space 2} .0437369{col 37}{space 1}    0.11{col 46}{space 3}0.915{col 54}{space 4}-.0814446{col 67}{space 3} .0907505
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.909949{col 26}{space 2} .1661643{col 37}{space 1}   17.51{col 46}{space 3}0.000{col 54}{space 4} 2.582849{col 67}{space 3} 3.237049
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross4.tex"'"':estcross4.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross4.txt""':seeout}
2012
note: p18 omitted because of collinearity
note: p22 omitted because of collinearity

      Source {c |}       SS           df       MS      Number of obs   ={res}       312
{txt}{hline 13}{c +}{hline 34}   F(29, 282)      = {res}    17.86
{txt}       Model {c |} {res} 8.49791098        29  .293031413   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4.62733845       282  .016409002   {txt}R-squared       ={res}    0.6474
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6112
{txt}       Total {c |} {res} 13.1252494       311  .042203374   {txt}Root MSE        =   {res}  .1281

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}lopen {c |}{col 14}{res}{space 2}  .717583{col 26}{space 2} .1956352{col 37}{space 1}    3.67{col 46}{space 3}0.000{col 54}{space 4} .3324923{col 67}{space 3} 1.102674
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.2016099{col 26}{space 2} .0175409{col 37}{space 1}  -11.49{col 46}{space 3}0.000{col 54}{space 4}-.2361376{col 67}{space 3}-.1670823
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0628371{col 26}{space 2} .0126186{col 37}{space 1}   -4.98{col 46}{space 3}0.000{col 54}{space 4}-.0876758{col 67}{space 3}-.0379984
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .6360376{col 26}{space 2} .1065236{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} .4263553{col 67}{space 3} .8457199
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0164289{col 26}{space 2} .1009604{col 37}{space 1}    0.16{col 46}{space 3}0.871{col 54}{space 4}-.1823026{col 67}{space 3} .2151605
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0101153{col 26}{space 2} .1001876{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-.1870952{col 67}{space 3} .2073258
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}-.5059631{col 26}{space 2} .0719401{col 37}{space 1}   -7.03{col 46}{space 3}0.000{col 54}{space 4} -.647571{col 67}{space 3}-.3643553
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0649674{col 26}{space 2}  .097723{col 37}{space 1}    0.66{col 46}{space 3}0.507{col 54}{space 4}-.1273917{col 67}{space 3} .2573265
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0391378{col 26}{space 2} .1008546{col 37}{space 1}    0.39{col 46}{space 3}0.698{col 54}{space 4}-.1593855{col 67}{space 3} .2376612
{txt}{space 10}p6 {c |}{col 14}{res}{space 2}-.0006354{col 26}{space 2} .0979912{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-.1935223{col 67}{space 3} .1922516
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0763831{col 26}{space 2} .1009653{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-.1223582{col 67}{space 3} .2751244
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0229334{col 26}{space 2} .1007735{col 37}{space 1}    0.23{col 46}{space 3}0.820{col 54}{space 4}-.1754303{col 67}{space 3} .2212971
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}  .019159{col 26}{space 2} .0976325{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-.1730219{col 67}{space 3} .2113399
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}  .007016{col 26}{space 2} .1018973{col 37}{space 1}    0.07{col 46}{space 3}0.945{col 54}{space 4}-.1935597{col 67}{space 3} .2075918
{txt}{space 9}p11 {c |}{col 14}{res}{space 2} .0125746{col 26}{space 2} .0996895{col 37}{space 1}    0.13{col 46}{space 3}0.900{col 54}{space 4}-.1836554{col 67}{space 3} .2088045
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0285464{col 26}{space 2} .0983475{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-.1650421{col 67}{space 3} .2221349
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.0074825{col 26}{space 2} .0979822{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-.2003519{col 67}{space 3} .1853869
{txt}{space 9}p14 {c |}{col 14}{res}{space 2} .0175932{col 26}{space 2} .0998574{col 37}{space 1}    0.18{col 46}{space 3}0.860{col 54}{space 4}-.1789672{col 67}{space 3} .2141536
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0156554{col 26}{space 2} .0987211{col 37}{space 1}    0.16{col 46}{space 3}0.874{col 54}{space 4}-.1786684{col 67}{space 3} .2099791
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0614035{col 26}{space 2} .0974864{col 37}{space 1}   -0.63{col 46}{space 3}0.529{col 54}{space 4}-.2532969{col 67}{space 3} .1304899
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.6651123{col 26}{space 2} .0693598{col 37}{space 1}   -9.59{col 46}{space 3}0.000{col 54}{space 4}-.8016409{col 67}{space 3}-.5285836
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .0914041{col 26}{space 2}  .096271{col 37}{space 1}    0.95{col 46}{space 3}0.343{col 54}{space 4}-.0980968{col 67}{space 3} .2809051
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0758601{col 26}{space 2} .1044259{col 37}{space 1}    0.73{col 46}{space 3}0.468{col 54}{space 4} -.129693{col 67}{space 3} .2814132
{txt}{space 9}p21 {c |}{col 14}{res}{space 2} .0603939{col 26}{space 2} .0980605{col 37}{space 1}    0.62{col 46}{space 3}0.538{col 54}{space 4}-.1326296{col 67}{space 3} .2534174
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0361868{col 26}{space 2} .1012848{col 37}{space 1}    0.36{col 46}{space 3}0.721{col 54}{space 4}-.1631833{col 67}{space 3} .2355569
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .0970486{col 26}{space 2}  .097704{col 37}{space 1}    0.99{col 46}{space 3}0.321{col 54}{space 4}-.0952731{col 67}{space 3} .2893703
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .1438093{col 26}{space 2} .1283194{col 37}{space 1}    1.12{col 46}{space 3}0.263{col 54}{space 4} -.108776{col 67}{space 3} .3963947
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}-.5013591{col 26}{space 2} .0796948{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4}-.6582313{col 67}{space 3}-.3444868
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}-.5135263{col 26}{space 2} .0656218{col 37}{space 1}   -7.83{col 46}{space 3}0.000{col 54}{space 4} -.642697{col 67}{space 3}-.3843556
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.648825{col 26}{space 2} .2294232{col 37}{space 1}   11.55{col 46}{space 3}0.000{col 54}{space 4} 2.197226{col 67}{space 3} 3.100425
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{stata `"shellout using `"estcross4.tex"'"':estcross4.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "estcross4.txt""':seeout}
2013

{com}. 
. 
. 
. *** pooled 估计, 只放入一个回归结果即可
. /*
> * robust回归
> reg govsize open lngdppc lnpop anr p1-p27 y1-y8, robust
> est store est1
> outreg2 using est, tex replace ctitle(pool robust) drop(p* o.p* y* o.y)
> */
. 
. * cluster回归
. reg govsize open lngdppc lnpop anr p1-p27 y1-y8, vce(cluster prov)
{txt}note: p18 omitted because of collinearity
note: p22 omitted because of collinearity
note: y2 omitted because of collinearity

Linear regression                               Number of obs     = {res}     2,329
                                                {txt}{help j_robustsingular:{txt}F(9, 26) }         =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.5670
                                                {txt}Root MSE          =    {res} .10328

{txt}{ralign 78:(Std. Err. adjusted for {res:27} clusters in prov)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .3909477{col 26}{space 2}  .083254{col 37}{space 1}    4.70{col 46}{space 3}0.000{col 54}{space 4} .2198167{col 67}{space 3} .5620787
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1585394{col 26}{space 2} .0316368{col 37}{space 1}   -5.01{col 46}{space 3}0.000{col 54}{space 4}-.2235698{col 67}{space 3}-.0935089
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0583108{col 26}{space 2} .0197497{col 37}{space 1}   -2.95{col 46}{space 3}0.007{col 54}{space 4}-.0989068{col 67}{space 3}-.0177148
{txt}{space 9}anr {c |}{col 14}{res}{space 2} .2595728{col 26}{space 2} .0364712{col 37}{space 1}    7.12{col 46}{space 3}0.000{col 54}{space 4} .1846052{col 67}{space 3} .3345404
{txt}{space 10}p1 {c |}{col 14}{res}{space 2} .0229835{col 26}{space 2} .0320461{col 37}{space 1}    0.72{col 46}{space 3}0.480{col 54}{space 4}-.0428882{col 67}{space 3} .0888553
{txt}{space 10}p2 {c |}{col 14}{res}{space 2} .0149093{col 26}{space 2} .0180961{col 37}{space 1}    0.82{col 46}{space 3}0.417{col 54}{space 4}-.0222879{col 67}{space 3} .0521064
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}-.1568968{col 26}{space 2} .0540845{col 37}{space 1}   -2.90{col 46}{space 3}0.007{col 54}{space 4} -.268069{col 67}{space 3}-.0457246
{txt}{space 10}p4 {c |}{col 14}{res}{space 2} .0527948{col 26}{space 2} .0211169{col 37}{space 1}    2.50{col 46}{space 3}0.019{col 54}{space 4} .0093883{col 67}{space 3} .0962012
{txt}{space 10}p5 {c |}{col 14}{res}{space 2} .0315987{col 26}{space 2} .0169869{col 37}{space 1}    1.86{col 46}{space 3}0.074{col 54}{space 4}-.0033184{col 67}{space 3} .0665159
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} .0065373{col 26}{space 2} .0142697{col 37}{space 1}    0.46{col 46}{space 3}0.651{col 54}{space 4}-.0227944{col 67}{space 3}  .035869
{txt}{space 10}p7 {c |}{col 14}{res}{space 2} .0661384{col 26}{space 2} .0391508{col 37}{space 1}    1.69{col 46}{space 3}0.103{col 54}{space 4}-.0143372{col 67}{space 3}  .146614
{txt}{space 10}p8 {c |}{col 14}{res}{space 2} .0546735{col 26}{space 2} .0326898{col 37}{space 1}    1.67{col 46}{space 3}0.106{col 54}{space 4}-.0125213{col 67}{space 3} .1218683
{txt}{space 10}p9 {c |}{col 14}{res}{space 2} .0039421{col 26}{space 2} .0193099{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.0357499{col 67}{space 3}  .043634
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}  .002688{col 26}{space 2}  .026349{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-.0514731{col 67}{space 3} .0568492
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}  .001253{col 26}{space 2} .0201485{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-.0401627{col 67}{space 3} .0426688
{txt}{space 9}p12 {c |}{col 14}{res}{space 2} .0396357{col 26}{space 2} .0352079{col 37}{space 1}    1.13{col 46}{space 3}0.271{col 54}{space 4}-.0327351{col 67}{space 3} .1120065
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.0019092{col 26}{space 2} .0279744{col 37}{space 1}   -0.07{col 46}{space 3}0.946{col 54}{space 4}-.0594114{col 67}{space 3} .0555931
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.0023874{col 26}{space 2} .0219605{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-.0475279{col 67}{space 3} .0427531
{txt}{space 9}p15 {c |}{col 14}{res}{space 2} .0076932{col 26}{space 2} .0254702{col 37}{space 1}    0.30{col 46}{space 3}0.765{col 54}{space 4}-.0446615{col 67}{space 3} .0600479
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.0276467{col 26}{space 2} .0246814{col 37}{space 1}   -1.12{col 46}{space 3}0.273{col 54}{space 4}-.0783801{col 67}{space 3} .0230866
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.2840914{col 26}{space 2} .0470796{col 37}{space 1}   -6.03{col 46}{space 3}0.000{col 54}{space 4}-.3808648{col 67}{space 3} -.187318
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2} .0905058{col 26}{space 2} .0222895{col 37}{space 1}    4.06{col 46}{space 3}0.000{col 54}{space 4} .0446891{col 67}{space 3} .1363226
{txt}{space 9}p20 {c |}{col 14}{res}{space 2} .0584449{col 26}{space 2} .0272151{col 37}{space 1}    2.15{col 46}{space 3}0.041{col 54}{space 4} .0025035{col 67}{space 3} .1143862
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}  .051536{col 26}{space 2} .0238043{col 37}{space 1}    2.16{col 46}{space 3}0.040{col 54}{space 4} .0026055{col 67}{space 3} .1004664
{txt}{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2} .0259268{col 26}{space 2} .0200919{col 37}{space 1}    1.29{col 46}{space 3}0.208{col 54}{space 4}-.0153728{col 67}{space 3} .0672264
{txt}{space 9}p24 {c |}{col 14}{res}{space 2} .1053123{col 26}{space 2} .0222712{col 37}{space 1}    4.73{col 46}{space 3}0.000{col 54}{space 4} .0595331{col 67}{space 3} .1510915
{txt}{space 9}p25 {c |}{col 14}{res}{space 2} .1483746{col 26}{space 2} .0219126{col 37}{space 1}    6.77{col 46}{space 3}0.000{col 54}{space 4} .1033326{col 67}{space 3} .1934166
{txt}{space 9}p26 {c |}{col 14}{res}{space 2}-.1645634{col 26}{space 2} .0286601{col 37}{space 1}   -5.74{col 46}{space 3}0.000{col 54}{space 4}-.2234751{col 67}{space 3}-.1056517
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}-.1657073{col 26}{space 2} .0290112{col 37}{space 1}   -5.71{col 46}{space 3}0.000{col 54}{space 4}-.2253407{col 67}{space 3}-.1060739
{txt}{space 10}y1 {c |}{col 14}{res}{space 2}-.0598652{col 26}{space 2} .0141942{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.0890419{col 67}{space 3}-.0306885
{txt}{space 10}y2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}y3 {c |}{col 14}{res}{space 2}  .030385{col 26}{space 2} .0074122{col 37}{space 1}    4.10{col 46}{space 3}0.000{col 54}{space 4}  .015149{col 67}{space 3} .0456211
{txt}{space 10}y4 {c |}{col 14}{res}{space 2} .0706127{col 26}{space 2} .0116634{col 37}{space 1}    6.05{col 46}{space 3}0.000{col 54}{space 4} .0466383{col 67}{space 3} .0945872
{txt}{space 10}y5 {c |}{col 14}{res}{space 2} .1093729{col 26}{space 2} .0181894{col 37}{space 1}    6.01{col 46}{space 3}0.000{col 54}{space 4} .0719841{col 67}{space 3} .1467617
{txt}{space 10}y6 {c |}{col 14}{res}{space 2} .1435759{col 26}{space 2} .0230666{col 37}{space 1}    6.22{col 46}{space 3}0.000{col 54}{space 4} .0961619{col 67}{space 3} .1909899
{txt}{space 10}y7 {c |}{col 14}{res}{space 2} .1723518{col 26}{space 2} .0276075{col 37}{space 1}    6.24{col 46}{space 3}0.000{col 54}{space 4} .1156037{col 67}{space 3}    .2291
{txt}{space 10}y8 {c |}{col 14}{res}{space 2} .1980082{col 26}{space 2} .0308907{col 37}{space 1}    6.41{col 46}{space 3}0.000{col 54}{space 4} .1345114{col 67}{space 3}  .261505
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.989151{col 26}{space 2} .3747853{col 37}{space 1}    5.31{col 46}{space 3}0.000{col 54}{space 4} 1.218769{col 67}{space 3} 2.759533
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est store est2
{txt}
{com}. outreg2 using est, tex replace  ctitle(pool P_clus) drop(p* o.p* y* o.y*)
{txt}{stata `"shellout using `"est.tex"'"':est.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "est.txt""':seeout}

{com}. /*
> * cluster回归
> reg govsize open lngdppc lnpop anr p1-p27 y1-y8, vce(cluster year)
> est store est3
> outreg2 using est, tex append  ctitle(pool Y_clus) drop(p* o.p* y* o.y*)
> */
. 
. 
. *** 面板估计,固定效应模型
. * Hausman 检验, P值很小，固定效应
. xtreg govsize open lngdppc lnpop anr p1-p27 y1-y8, fe
{p 0 6 2}{txt}note: anr omitted because of collinearity{p_end}
{p 0 6 2}note: p1 omitted because of collinearity{p_end}
{p 0 6 2}note: p2 omitted because of collinearity{p_end}
{p 0 6 2}note: p3 omitted because of collinearity{p_end}
{p 0 6 2}note: p4 omitted because of collinearity{p_end}
{p 0 6 2}note: p5 omitted because of collinearity{p_end}
{p 0 6 2}note: p6 omitted because of collinearity{p_end}
{p 0 6 2}note: p7 omitted because of collinearity{p_end}
{p 0 6 2}note: p8 omitted because of collinearity{p_end}
{p 0 6 2}note: p9 omitted because of collinearity{p_end}
{p 0 6 2}note: p10 omitted because of collinearity{p_end}
{p 0 6 2}note: p11 omitted because of collinearity{p_end}
{p 0 6 2}note: p12 omitted because of collinearity{p_end}
{p 0 6 2}note: p13 omitted because of collinearity{p_end}
{p 0 6 2}note: p14 omitted because of collinearity{p_end}
{p 0 6 2}note: p15 omitted because of collinearity{p_end}
{p 0 6 2}note: p16 omitted because of collinearity{p_end}
{p 0 6 2}note: p17 omitted because of collinearity{p_end}
{p 0 6 2}note: p18 omitted because of collinearity{p_end}
{p 0 6 2}note: p19 omitted because of collinearity{p_end}
{p 0 6 2}note: p20 omitted because of collinearity{p_end}
{p 0 6 2}note: p21 omitted because of collinearity{p_end}
{p 0 6 2}note: p22 omitted because of collinearity{p_end}
{p 0 6 2}note: p23 omitted because of collinearity{p_end}
{p 0 6 2}note: p24 omitted because of collinearity{p_end}
{p 0 6 2}note: p25 omitted because of collinearity{p_end}
{p 0 6 2}note: p26 omitted because of collinearity{p_end}
{p 0 6 2}note: p27 omitted because of collinearity{p_end}
{p 0 6 2}note: y8 omitted because of collinearity{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     2,329
{txt}Group variable: {res}pref{txt}{col 49}Number of groups{col 67}={col 69}{res}       317

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.2147{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1848{col 63}{txt}avg{col 67}={col 69}{res}       7.3
{txt}     overall = {res}0.0557{col 63}{txt}max{col 67}={col 69}{res}         8

{txt}{col 49}F({res}10{txt},{res}2002{txt}){col 67}={col 70}{res}    54.75
{txt}corr(u_i, Xb){col 16}= {res}-0.6144{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .5471506{col 26}{space 2} .1134197{col 37}{space 1}    4.82{col 46}{space 3}0.000{col 54}{space 4} .3247175{col 67}{space 3} .7695837
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0115829{col 26}{space 2} .0143193{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4}-.0396651{col 67}{space 3} .0164993
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2} .0821641{col 26}{space 2} .0341058{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .0152776{col 67}{space 3} .1490507
{txt}{space 9}anr {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p6 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p7 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p8 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p9 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p10 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p11 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p12 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p13 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p14 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p15 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p16 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p17 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p24 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}y1 {c |}{col 14}{res}{space 2}-.0962944{col 26}{space 2} .0159916{col 37}{space 1}   -6.02{col 46}{space 3}0.000{col 54}{space 4}-.1276564{col 67}{space 3}-.0649324
{txt}{space 10}y2 {c |}{col 14}{res}{space 2}-.0663058{col 26}{space 2} .0137187{col 37}{space 1}   -4.83{col 46}{space 3}0.000{col 54}{space 4}-.0932102{col 67}{space 3}-.0394013
{txt}{space 10}y3 {c |}{col 14}{res}{space 2}-.0619247{col 26}{space 2}  .011097{col 37}{space 1}   -5.58{col 46}{space 3}0.000{col 54}{space 4}-.0836876{col 67}{space 3}-.0401618
{txt}{space 10}y4 {c |}{col 14}{res}{space 2}-.0364503{col 26}{space 2} .0096444{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}-.0553644{col 67}{space 3}-.0175361
{txt}{space 10}y5 {c |}{col 14}{res}{space 2}-.0285866{col 26}{space 2} .0073947{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-.0430886{col 67}{space 3}-.0140845
{txt}{space 10}y6 {c |}{col 14}{res}{space 2}-.0228999{col 26}{space 2} .0055563{col 37}{space 1}   -4.12{col 46}{space 3}0.000{col 54}{space 4}-.0337966{col 67}{space 3}-.0120032
{txt}{space 10}y7 {c |}{col 14}{res}{space 2}-.0108131{col 26}{space 2} .0048953{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}-.0204136{col 67}{space 3}-.0012127
{txt}{space 10}y8 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2}-.1419651{col 26}{space 2} .2709295{col 37}{space 1}   -0.52{col 46}{space 3}0.600{col 54}{space 4}-.6732985{col 67}{space 3} .3893682
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  .2003311
     {txt}sigma_e {c |} {res} .05830502
         {txt}rho {c |} {res} .92190862{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}316{txt}, {res}2002{txt}) = {res}20.12{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. est store est4
{txt}
{com}. xtreg govsize open lngdppc lnpop anr p1-p27 y1-y8, re
{txt}note: p25 omitted because of collinearity
note: p27 omitted because of collinearity
note: y8 omitted because of collinearity
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     2,329
{txt}Group variable: {res}pref                            {txt}Number of groups  = {res}       317

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1945                                         {txt}min = {res}         1
{txt}     between = {res}0.6467                                         {txt}avg = {res}       7.3
{txt}     overall = {res}0.5474                                         {txt}max = {res}         8

                                                {txt}Wald chi2({res}36{txt})     =  {res}  1007.87
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2}  .411492{col 26}{space 2} .0890667{col 37}{space 1}    4.62{col 46}{space 3}0.000{col 54}{space 4} .2369245{col 67}{space 3} .5860595
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.1105514{col 26}{space 2} .0092002{col 37}{space 1}  -12.02{col 46}{space 3}0.000{col 54}{space 4}-.1285834{col 67}{space 3}-.0925194
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2}-.0446702{col 26}{space 2} .0089587{col 37}{space 1}   -4.99{col 46}{space 3}0.000{col 54}{space 4} -.062229{col 67}{space 3}-.0271114
{txt}{space 9}anr {c |}{col 14}{res}{space 2} -.116387{col 26}{space 2} .0531364{col 37}{space 1}   -2.19{col 46}{space 3}0.028{col 54}{space 4}-.2205325{col 67}{space 3}-.0122416
{txt}{space 10}p1 {c |}{col 14}{res}{space 2}-.2240834{col 26}{space 2} .0586837{col 37}{space 1}   -3.82{col 46}{space 3}0.000{col 54}{space 4}-.3391014{col 67}{space 3}-.1090654
{txt}{space 10}p2 {c |}{col 14}{res}{space 2}-.2196577{col 26}{space 2} .0570487{col 37}{space 1}   -3.85{col 46}{space 3}0.000{col 54}{space 4} -.331471{col 67}{space 3}-.1078444
{txt}{space 10}p3 {c |}{col 14}{res}{space 2}-.0379779{col 26}{space 2} .0400206{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-.1164168{col 67}{space 3} .0404611
{txt}{space 10}p4 {c |}{col 14}{res}{space 2}-.1986014{col 26}{space 2} .0550832{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-.3065626{col 67}{space 3}-.0906402
{txt}{space 10}p5 {c |}{col 14}{res}{space 2}-.2086652{col 26}{space 2} .0577946{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-.3219404{col 67}{space 3}-.0953899
{txt}{space 10}p6 {c |}{col 14}{res}{space 2} -.219503{col 26}{space 2} .0543868{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-.3260992{col 67}{space 3}-.1129068
{txt}{space 10}p7 {c |}{col 14}{res}{space 2}-.2069703{col 26}{space 2} .0589711{col 37}{space 1}   -3.51{col 46}{space 3}0.000{col 54}{space 4}-.3225515{col 67}{space 3}-.0913892
{txt}{space 10}p8 {c |}{col 14}{res}{space 2}-.2159118{col 26}{space 2} .0584455{col 37}{space 1}   -3.69{col 46}{space 3}0.000{col 54}{space 4}-.3304629{col 67}{space 3}-.1013607
{txt}{space 10}p9 {c |}{col 14}{res}{space 2}-.2259739{col 26}{space 2} .0544424{col 37}{space 1}   -4.15{col 46}{space 3}0.000{col 54}{space 4}-.3326791{col 67}{space 3}-.1192687
{txt}{space 9}p10 {c |}{col 14}{res}{space 2}-.2528994{col 26}{space 2} .0592087{col 37}{space 1}   -4.27{col 46}{space 3}0.000{col 54}{space 4}-.3689463{col 67}{space 3}-.1368525
{txt}{space 9}p11 {c |}{col 14}{res}{space 2}-.2282721{col 26}{space 2} .0565585{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-.3391247{col 67}{space 3}-.1174195
{txt}{space 9}p12 {c |}{col 14}{res}{space 2}-.2279825{col 26}{space 2} .0564639{col 37}{space 1}   -4.04{col 46}{space 3}0.000{col 54}{space 4}-.3386498{col 67}{space 3}-.1173152
{txt}{space 9}p13 {c |}{col 14}{res}{space 2}-.2405245{col 26}{space 2} .0554103{col 37}{space 1}   -4.34{col 46}{space 3}0.000{col 54}{space 4}-.3491267{col 67}{space 3}-.1319222
{txt}{space 9}p14 {c |}{col 14}{res}{space 2}-.2338247{col 26}{space 2} .0562718{col 37}{space 1}   -4.16{col 46}{space 3}0.000{col 54}{space 4}-.3441153{col 67}{space 3} -.123534
{txt}{space 9}p15 {c |}{col 14}{res}{space 2}-.2230175{col 26}{space 2} .0559127{col 37}{space 1}   -3.99{col 46}{space 3}0.000{col 54}{space 4}-.3326043{col 67}{space 3}-.1134306
{txt}{space 9}p16 {c |}{col 14}{res}{space 2}-.2771965{col 26}{space 2} .0544101{col 37}{space 1}   -5.09{col 46}{space 3}0.000{col 54}{space 4}-.3838383{col 67}{space 3}-.1705546
{txt}{space 9}p17 {c |}{col 14}{res}{space 2}-.1300941{col 26}{space 2} .0381491{col 37}{space 1}   -3.41{col 46}{space 3}0.001{col 54}{space 4}-.2048649{col 67}{space 3}-.0553232
{txt}{space 9}p18 {c |}{col 14}{res}{space 2}-.2368144{col 26}{space 2} .0819348{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.3974037{col 67}{space 3}-.0762252
{txt}{space 9}p19 {c |}{col 14}{res}{space 2}-.1302931{col 26}{space 2} .0530291{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.2342283{col 67}{space 3}-.0263578
{txt}{space 9}p20 {c |}{col 14}{res}{space 2}-.1490374{col 26}{space 2} .0609079{col 37}{space 1}   -2.45{col 46}{space 3}0.014{col 54}{space 4}-.2684146{col 67}{space 3}-.0296601
{txt}{space 9}p21 {c |}{col 14}{res}{space 2}-.1531431{col 26}{space 2} .0539035{col 37}{space 1}   -2.84{col 46}{space 3}0.004{col 54}{space 4}-.2587919{col 67}{space 3}-.0474942
{txt}{space 9}p22 {c |}{col 14}{res}{space 2} .1646711{col 26}{space 2} .0506145{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0654685{col 67}{space 3} .2638737
{txt}{space 9}p23 {c |}{col 14}{res}{space 2}-.2019146{col 26}{space 2} .0573074{col 37}{space 1}   -3.52{col 46}{space 3}0.000{col 54}{space 4}-.3142351{col 67}{space 3}-.0895941
{txt}{space 9}p24 {c |}{col 14}{res}{space 2}-.0966699{col 26}{space 2} .0530007{col 37}{space 1}   -1.82{col 46}{space 3}0.068{col 54}{space 4}-.2005494{col 67}{space 3} .0072095
{txt}{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}-.0024557{col 26}{space 2} .0503413{col 37}{space 1}   -0.05{col 46}{space 3}0.961{col 54}{space 4}-.1011229{col 67}{space 3} .0962115
{txt}{space 9}p27 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}y1 {c |}{col 14}{res}{space 2}-.2060118{col 26}{space 2} .0107467{col 37}{space 1}  -19.17{col 46}{space 3}0.000{col 54}{space 4} -.227075{col 67}{space 3}-.1849485
{txt}{space 10}y2 {c |}{col 14}{res}{space 2} -.155876{col 26}{space 2}   .00973{col 37}{space 1}  -16.02{col 46}{space 3}0.000{col 54}{space 4}-.1749464{col 67}{space 3}-.1368055
{txt}{space 10}y3 {c |}{col 14}{res}{space 2}-.1334456{col 26}{space 2} .0079726{col 37}{space 1}  -16.74{col 46}{space 3}0.000{col 54}{space 4}-.1490716{col 67}{space 3}-.1178196
{txt}{space 10}y4 {c |}{col 14}{res}{space 2}-.0975218{col 26}{space 2}  .007106{col 37}{space 1}  -13.72{col 46}{space 3}0.000{col 54}{space 4}-.1114493{col 67}{space 3}-.0835942
{txt}{space 10}y5 {c |}{col 14}{res}{space 2}-.0696094{col 26}{space 2} .0059754{col 37}{space 1}  -11.65{col 46}{space 3}0.000{col 54}{space 4}-.0813209{col 67}{space 3}-.0578979
{txt}{space 10}y6 {c |}{col 14}{res}{space 2}-.0440943{col 26}{space 2} .0051381{col 37}{space 1}   -8.58{col 46}{space 3}0.000{col 54}{space 4}-.0541648{col 67}{space 3}-.0340237
{txt}{space 10}y7 {c |}{col 14}{res}{space 2}-.0210416{col 26}{space 2} .0048558{col 37}{space 1}   -4.33{col 46}{space 3}0.000{col 54}{space 4}-.0305588{col 67}{space 3}-.0115245
{txt}{space 10}y8 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} 1.836413{col 26}{space 2} .1162374{col 37}{space 1}   15.80{col 46}{space 3}0.000{col 54}{space 4} 1.608592{col 67}{space 3} 2.064234
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .09113718
     {txt}sigma_e {c |} {res} .05830502
         {txt}rho {c |} {res} .70958207{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. est store est5
{txt}
{com}. hausman est4 est5, constant sigmamore

{txt}{p 0 8}Note: the rank of the differenced variance matrix ({result:10}) does not equal the number of coefficients being tested ({result:11}); be sure this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}    est4    {col 30}    est5    {col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{space 8}open {c |}{res}{col 18} .5471506{col 31}  .411492{col 47} .1356586{col 63}  .073532
{txt}{space 5}lngdppc {c |}{res}{col 18}-.0115829{col 31}-.1105514{col 47} .0989685{col 63} .0113129
{txt}{space 7}lnpop {c |}{res}{col 18} .0821641{col 31}-.0446702{col 47} .1268343{col 63} .0335555
{txt}{space 10}y1 {c |}{res}{col 18}-.0962944{col 31}-.2060118{col 47} .1097174{col 63} .0122351
{txt}{space 10}y2 {c |}{res}{col 18}-.0663058{col 31} -.155876{col 47} .0895702{col 63} .0100245
{txt}{space 10}y3 {c |}{res}{col 18}-.0619247{col 31}-.1334456{col 47} .0715209{col 63} .0080085
{txt}{space 10}y4 {c |}{res}{col 18}-.0364503{col 31}-.0975218{col 47} .0610715{col 63} .0067793
{txt}{space 10}y5 {c |}{res}{col 18}-.0285866{col 31}-.0696094{col 47} .0410229{col 63} .0045824
{txt}{space 10}y6 {c |}{res}{col 18}-.0228999{col 31}-.0440943{col 47} .0211944{col 63} .0023694
{txt}{space 10}y7 {c |}{res}{col 18}-.0108131{col 31}-.0210416{col 47} .0102285{col 63} .0011278
{txt}{space 7}_cons {c |}{res}{col 18}-.1419651{col 31} 1.836413{col 47}-1.978378{col 63} .2502131
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from xtreg}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from xtreg}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:10})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}=  {res}     87.42
{txt}{col 17}Prob>chi2 =  {res}    0.0000
{txt}{col 17}(V_b-V_B is not positive definite)

{com}. 
. * 双向固定效应
. xtreg govsize open lngdppc lnpop anr p1-p27 y1-y8, fe vce(cluster prov)
{txt}note: anr omitted because of collinearity
note: p1 omitted because of collinearity
note: p2 omitted because of collinearity
note: p3 omitted because of collinearity
note: p4 omitted because of collinearity
note: p5 omitted because of collinearity
note: p6 omitted because of collinearity
note: p7 omitted because of collinearity
note: p8 omitted because of collinearity
note: p9 omitted because of collinearity
note: p10 omitted because of collinearity
note: p11 omitted because of collinearity
note: p12 omitted because of collinearity
note: p13 omitted because of collinearity
note: p14 omitted because of collinearity
note: p15 omitted because of collinearity
note: p16 omitted because of collinearity
note: p17 omitted because of collinearity
note: p18 omitted because of collinearity
note: p19 omitted because of collinearity
note: p20 omitted because of collinearity
note: p21 omitted because of collinearity
note: p22 omitted because of collinearity
note: p23 omitted because of collinearity
note: p24 omitted because of collinearity
note: p25 omitted because of collinearity
note: p26 omitted because of collinearity
note: p27 omitted because of collinearity
note: y1 omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}     2329
{txt}Group variable: {res}pref                            {txt}Number of groups   = {res}      317

{txt}R-sq:  within  = {res}0.2147                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.1848                                        {txt}avg = {res}      7.3
{txt}       overall = {res}0.0557                                        {txt}max = {res}        8

                                                {txt}F({res}10{txt},{res}26{txt})           = {res}    17.28
{txt}corr(u_i, Xb)  = {res}-0.6144                        {txt}Prob > F           =    {res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:27} clusters in prov)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .5471506{col 26}{space 2} .3804304{col 37}{space 1}    1.44{col 46}{space 3}0.162{col 54}{space 4}-.2348353{col 67}{space 3} 1.329137
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0115829{col 26}{space 2} .0396825{col 37}{space 1}   -0.29{col 46}{space 3}0.773{col 54}{space 4}-.0931515{col 67}{space 3} .0699856
{txt}{space 7}lnpop {c |}{col 14}{res}{space 2} .0821641{col 26}{space 2}  .101931{col 37}{space 1}    0.81{col 46}{space 3}0.428{col 54}{space 4} -.127358{col 67}{space 3} .2916862
{txt}{space 9}anr {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p4 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p5 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p6 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p7 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p8 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}p9 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p10 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p11 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p12 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p13 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p14 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p15 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p16 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p17 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p18 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p19 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p20 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p21 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p22 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p23 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p24 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p25 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p26 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}p27 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}y1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 10}y2 {c |}{col 14}{res}{space 2} .0299886{col 26}{space 2} .0113415{col 37}{space 1}    2.64{col 46}{space 3}0.014{col 54}{space 4} .0066758{col 67}{space 3} .0533014
{txt}{space 10}y3 {c |}{col 14}{res}{space 2} .0343697{col 26}{space 2} .0203901{col 37}{space 1}    1.69{col 46}{space 3}0.104{col 54}{space 4}-.0075428{col 67}{space 3} .0762821
{txt}{space 10}y4 {c |}{col 14}{res}{space 2} .0598441{col 26}{space 2} .0240443{col 37}{space 1}    2.49{col 46}{space 3}0.020{col 54}{space 4} .0104204{col 67}{space 3} .1092679
{txt}{space 10}y5 {c |}{col 14}{res}{space 2} .0677079{col 26}{space 2} .0319204{col 37}{space 1}    2.12{col 46}{space 3}0.044{col 54}{space 4} .0020944{col 67}{space 3} .1333213
{txt}{space 10}y6 {c |}{col 14}{res}{space 2} .0733945{col 26}{space 2} .0353337{col 37}{space 1}    2.08{col 46}{space 3}0.048{col 54}{space 4} .0007651{col 67}{space 3} .1460239
{txt}{space 10}y7 {c |}{col 14}{res}{space 2} .0854813{col 26}{space 2} .0397682{col 37}{space 1}    2.15{col 46}{space 3}0.041{col 54}{space 4} .0037366{col 67}{space 3}  .167226
{txt}{space 10}y8 {c |}{col 14}{res}{space 2} .0962944{col 26}{space 2} .0424196{col 37}{space 1}    2.27{col 46}{space 3}0.032{col 54}{space 4} .0090997{col 67}{space 3} .1834891
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2382595{col 26}{space 2} .7809843{col 37}{space 1}   -0.31{col 46}{space 3}0.763{col 54}{space 4}-1.843596{col 67}{space 3} 1.367077
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  .2003311
     {txt}sigma_e {c |} {res} .05830502
         {txt}rho {c |} {res} .92190862{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. est store est6
{txt}
{com}. outreg2 using est, tex append   ctitle(FE P_clus) drop(p* o.p* y* o.y*)
{txt}{stata `"shellout using `"est.tex"'"':est.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "est.txt""':seeout}

{com}. 
. 
. /*
> *       同时加入了省份固定效应,
> xtreg govsize open lngdppc lnpop anr p1-p27 y1-y8, fe robust
> est store est4
> outreg2 using est, tex append   ctitle(FE robust) drop(p* o.p* y* op*)
> */
. *       横向和纵向的固定效应,
. /*
> *       随机效应模型,考虑到现实意义和豪斯曼检验,舍去
> xtreg govsize open lngdppc lnpop anr p1-p27 y1-y8  //, re vce(cluster prov)
> xttest0
> est store est6
> outreg2 using est, tex append   ctitle(RE P_clus) drop(p* o.p* y* o.y*)
> xtreg govsize open lngdppc lnpop anr p1-p27, re vce(cluster prov)
> est store est6
> outreg2 using est, tex append   ctitle(RE P_clus) drop(p* o.p* y* o.y*)
> */
. 
. * 时间虚拟变量显著性检验 
. * 组间异方差问题 xttest3
. xttest3 

{txt}Modified Wald test for groupwise heteroskedasticity
in fixed effect regression model

{res}H0: sigma(i)^2 = sigma^2 for all i

{txt}chi2 (317)  =  {res} 9.6e+05
{txt}Prob>chi2 =    {res}  0.0000

{txt}
{com}. * 序列自相关检验 xtserial
. xtserial govsize open lngdppc lnpop

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     308) = {res}    28.516
{txt}{col 12}Prob > F = {res}     0.0000
{txt}
{com}. xtserial govsize

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     317) = {res}   262.450
{txt}{col 12}Prob > F = {res}     0.0000
{txt}
{com}. xtserial open

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     312) = {res}    32.452
{txt}{col 12}Prob > F = {res}     0.0000
{txt}
{com}. xtserial lngdppc

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     317) = {res} 12732.596
{txt}{col 12}Prob > F = {res}     0.0000
{txt}
{com}. xtserial lnpop          //不显著

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     317) = {res}     0.585
{txt}{col 12}Prob > F = {res}     0.4448
{txt}
{com}. 
. 
. ***随机效应的FGLS估计
. /*
> xtgls govsize open lngdppc lnpop anr p1-p27, i(code) t(year) panels(hetero) corr(i) force
> est store est7
> outreg2 using est, tex append ctitle(FGLS AR(1)) drop(p* o.p* y* o.y*)
> 
> xtgls govsize open lngdppc lnpop anr p1-p27, i(code) t(year) panels(hetero) corr(ar1) force
> est store est8
> outreg2 using est, tex append ctitle(FGLS PSAR(1)) drop(p* o.p* y* o.y*)
> */
. *** 至此得到了 
. 
. ******* 面板协整
. 
. *** 平稳性检验
. *** 协整关系建立
. * MG 结果I(0) 但是检验方法不对
. xtmg govsize open lngdppc , trend res(r_mg)   
{txt}{col 2}Note: {res}12{txt} obs. dropped (panels too small)


Pesaran & Smith (1995) Mean Group estimator

All coefficients present represent averages across groups ({res}pref{txt})
Coefficient averages computed as {res}unweighted{txt} means

Mean Group type estimation{col 49}Number of obs{col 67}={col 69}{res}     2,343
{txt}Group variable: {res}pref{col 49}{txt}Number of groups{col 67}={col 69}{res}       311

{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         5
{txt}{col 63}avg{col 67}={col 69}{res}       7.5
{txt}{col 63}max{col 67}={col 69}{res}         8

{txt}{col 49}Wald chi2({res}2{txt}){col 67}={col 70}{res}     7.20
{txt}{col 49}Prob > chi2{col 67}={res}{col 73}0.0273

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2}-4.127888{col 26}{space 2} 2.380907{col 37}{space 1}   -1.73{col 46}{space 3}0.083{col 54}{space 4} -8.79438{col 67}{space 3} .5386045
{txt}{space 5}lngdppc {c |}{col 14}{res}{space 2}-.0951315{col 26}{space 2} .0379798{col 37}{space 1}   -2.50{col 46}{space 3}0.012{col 54}{space 4}-.1695704{col 67}{space 3}-.0206925
{txt}{space 2}__000007_t {c |}{col 14}{res}{space 2} .0244442{col 26}{space 2} .0054052{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} .0138502{col 67}{space 3} .0350383
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.052689{col 26}{space 2} .3474721{col 37}{space 1}    3.03{col 46}{space 3}0.002{col 54}{space 4} .3716564{col 67}{space 3} 1.733722
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Root Mean Squared Error (sigma): {res}0.0239
{txt}Residual series based on country regressions stored in variable: {res}r_mg
{txt}Variable {res}__000007_t{txt} refers to a group-specific linear trend.
Share of group-specific trends significant at 5% level: {res}0.248 (= 77 trends)
{txt}
{com}. est store est21
{txt}
{com}. outreg2 using est, tex append ctitle(MG) drop(_*)
{txt}{stata `"shellout using `"est.tex"'"':est.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "est.txt""':seeout}

{com}. 
. * CCE 结果I(0) 但是检验方法不对
. xtmg govsize open lngdppc, cce res(r_cmg) 
{txt}{col 2}Note: {res}4{txt} obs. dropped (panels too small)


Pesaran (2006) Common Correlated Effects Mean Group estimator

All coefficients present represent averages across groups ({res}pref{txt})
Coefficient averages computed as {res}unweighted{txt} means

Mean Group type estimation{col 49}Number of obs{col 67}={col 69}{res}     2,351
{txt}Group variable: {res}pref{col 49}{txt}Number of groups{col 67}={col 69}{res}       313

{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         4
{txt}{col 63}avg{col 67}={col 69}{res}       7.5
{txt}{col 63}max{col 67}={col 69}{res}         8

{txt}{col 49}Wald chi2({res}2{txt}){col 67}={col 70}{res}    14.07
{txt}{col 49}Prob > chi2{col 67}={res}{col 73}0.0009

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      govsize{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}open {c |}{col 15}{res}{space 2}-5.252187{col 27}{space 2} 8.088683{col 38}{space 1}   -0.65{col 47}{space 3}0.516{col 55}{space 4}-21.10571{col 68}{space 3} 10.60134
{txt}{space 6}lngdppc {c |}{col 15}{res}{space 2}-.2716118{col 27}{space 2} .0740673{col 38}{space 1}   -3.67{col 47}{space 3}0.000{col 55}{space 4}-.4167811{col 68}{space 3}-.1264426
{txt}__00000M_go~e {c |}{col 15}{res}{space 2} .4229874{col 27}{space 2} .3173581{col 38}{space 1}    1.33{col 47}{space 3}0.183{col 55}{space 4}-.1990231{col 68}{space 3} 1.044998
{txt}__00000L_open {c |}{col 15}{res}{space 2}-2.709682{col 27}{space 2} .9925394{col 38}{space 1}   -2.73{col 47}{space 3}0.006{col 55}{space 4}-4.655023{col 68}{space 3}-.7643402
{txt}__00000L_ln~c {c |}{col 15}{res}{space 2} .3450764{col 27}{space 2} .0941923{col 38}{space 1}    3.66{col 47}{space 3}0.000{col 55}{space 4} .1604628{col 68}{space 3} .5296899
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-.7308386{col 27}{space 2} .3246497{col 38}{space 1}   -2.25{col 47}{space 3}0.024{col 55}{space 4} -1.36714{col 68}{space 3}-.0945369
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Root Mean Squared Error (sigma): {res}0.0104
{txt}Cross-section averaged {res}regressors{txt} are marked by the suffix: 
{res}   _govsize, _open, _lngdppc{txt} respectively.
Residual series based on country regressions stored in variable: {res}r_cmg
{txt}
{com}. est store est22
{txt}
{com}. outreg2 using est, tex append ctitle(CMG) drop(_*)
{txt}{stata `"shellout using `"est.tex"'"':est.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "est.txt""':seeout}

{com}. 
. * CCE2 结果I(0) 但是检验方法不对
. xtmg govsize open lngdppc, cce trend res(r_cmg2)
{txt}{col 2}Note: {res}12{txt} obs. dropped (panels too small)


Pesaran (2006) Common Correlated Effects Mean Group estimator

All coefficients present represent averages across groups ({res}pref{txt})
Coefficient averages computed as {res}unweighted{txt} means

Mean Group type estimation{col 49}Number of obs{col 67}={col 69}{res}     2,343
{txt}Group variable: {res}pref{col 49}{txt}Number of groups{col 67}={col 69}{res}       311

{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         5
{txt}{col 63}avg{col 67}={col 69}{res}       7.5
{txt}{col 63}max{col 67}={col 69}{res}         8

{txt}{col 49}Wald chi2({res}2{txt}){col 67}={col 70}{res}     2.52
{txt}{col 49}Prob > chi2{col 67}={res}{col 73}0.2831

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      govsize{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      z{col 47}   P>|z|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}open {c |}{col 15}{res}{space 2}-12.30309{col 27}{space 2} 7.963367{col 38}{space 1}   -1.54{col 47}{space 3}0.122{col 55}{space 4}  -27.911{col 68}{space 3} 3.304823
{txt}{space 6}lngdppc {c |}{col 15}{res}{space 2} .1142203{col 27}{space 2}  .222813{col 38}{space 1}    0.51{col 47}{space 3}0.608{col 55}{space 4}-.3224852{col 68}{space 3} .5509259
{txt}{space 3}__000007_t {c |}{col 15}{res}{space 2}  -.03734{col 27}{space 2} .0302799{col 38}{space 1}   -1.23{col 47}{space 3}0.218{col 55}{space 4}-.0966876{col 68}{space 3} .0220076
{txt}__00000M_go~e {c |}{col 15}{res}{space 2}-.0606195{col 27}{space 2} .7081459{col 38}{space 1}   -0.09{col 47}{space 3}0.932{col 55}{space 4} -1.44856{col 68}{space 3} 1.327321
{txt}__00000L_open {c |}{col 15}{res}{space 2}-2.689989{col 27}{space 2} 2.970268{col 38}{space 1}   -0.91{col 47}{space 3}0.365{col 55}{space 4}-8.511607{col 68}{space 3} 3.131628
{txt}__00000L_ln~c {c |}{col 15}{res}{space 2} .2131909{col 27}{space 2} .1790636{col 38}{space 1}    1.19{col 47}{space 3}0.234{col 55}{space 4}-.1377673{col 68}{space 3}  .564149
{txt}{space 8}_cons {c |}{col 15}{res}{space 2}-2.911971{col 27}{space 2} 1.876622{col 38}{space 1}   -1.55{col 47}{space 3}0.121{col 55}{space 4}-6.590082{col 68}{space 3} .7661401
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
Root Mean Squared Error (sigma): {res}0.0022
{txt}Cross-section averaged {res}regressors{txt} are marked by the suffix: 
{res}   _govsize, _open, _lngdppc{txt} respectively.
Residual series based on country regressions stored in variable: {res}r_cmg2
{txt}Variable {res}__000007_t{txt} refers to a group-specific linear trend.
Share of group-specific trends significant at 5% level: {res}0.042 (= 13 trends)
{txt}Note that augmentation of the CCEMG estimator should account for the impact of
group-specific linear trends. The latter are unidentified.

{com}. est store est23
{txt}
{com}. outreg2 using est, tex append ctitle(CMG) drop(_*)
{txt}{stata `"shellout using `"est.tex"'"':est.tex}
{browse `"F:\git\stata\output\15Jun2017"' :dir}{com} : {txt}{stata `"seeout using "est.txt""':seeout}

{com}. 
. 
. /*
> * -------------------------------------------------------
> // Close the log, end the file
> 
> log close
> exit

{txt}end of do-file

{com}. help xtcd

. xtcd r_cmg2


{txt}{col 2}Average correlation coefficients & Pesaran (2004) CD test

{col 2}Variables series tested: {res}{col 20}r_cmg2
{txt}{col 32}Group variable: {res}{col 47}pref
{txt}{col 30}Number of groups: {res}{col 47}311
{txt}{col 21}Average # of observations: {res}{col 47}7.26
{txt}{col 38}Panel is: {res}{col 47}unbalanced

{txt}{hline 13}{c TT}{hline 43}
{col 2}   Variable {c |}{col 19}CD-test{col 28}p-value{col 40}corr{col 46}abs(corr)
{hline 13}{c +}{hline 43}
      r_cmg2 {c |}{res}{col 19}      .{col 28}      .{col 39}    .{col 48}    .
{txt}{hline 13}{c BT}{hline 43}
{col 2}Notes: Under the null hypothesis of cross-section 
{col 9}independence CD ~ N(0,1)

{com}. xtdes r_cmg2
{err}varlist not allowed
{txt}{search r(101):r(101);}

{com}. br r_cmg2

. preserve

. xtdes

    {txt}pref:  {res}1301{txt}, {res}1302{txt}, ..., {res}6543                             {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(pref*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX

{com}. keep pref year r_cmg2

. xtbalance, range(2006 2013) miss(r_cmg2)

{txt}({res}201{txt} observations deleted due to missing) 

({res}895{txt} observations deleted due to discontinues) 

{com}. xtdes

    {txt}pref:  {res}1301{txt}, {res}1302{txt}, ..., {res}4331                             {txt}n ={res}        181
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(pref*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      181    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      181    100.00        {txt} {c |}  {res}XXXXXXXX

{com}. xtcd r_cmg2


{txt}{col 2}Average correlation coefficients & Pesaran (2004) CD test

{col 2}Variables series tested: {res}{col 20}r_cmg2
{txt}{col 32}Group variable: {res}{col 47}pref
{txt}{col 30}Number of groups: {res}{col 47}181
{txt}{col 21}Average # of observations: {res}{col 47}8.04
{txt}{col 38}Panel is: {res}{col 47}unbalanced

{txt}{hline 13}{c TT}{hline 43}
{col 2}   Variable {c |}{col 19}CD-test{col 28}p-value{col 40}corr{col 46}abs(corr)
{hline 13}{c +}{hline 43}
      r_cmg2 {c |}{res}{col 19}   9.86{col 28}  0.000{col 39}0.027{col 48}0.546
{txt}{hline 13}{c BT}{hline 43}
{col 2}Notes: Under the null hypothesis of cross-section 
{col 9}independence CD ~ N(0,1)

{com}. xtpcd r_cmg2
{err}command {bf}xtpcd{sf} is unrecognized
{txt}{search r(199):r(199);}

{com}. help xtpcd

. xtserial r_cmg2

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     180) = {res}     0.642
{txt}{col 12}Prob > F = {res}     0.4239

{com}. restore

. xtserial open

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     312) = {res}    32.452
{txt}{col 12}Prob > F = {res}     0.0000

{com}. xtserial govsize

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     317) = {res}   262.450
{txt}{col 12}Prob > F = {res}     0.0000

{com}. help xtserial

. xtcd govsize


{txt}{col 2}Average correlation coefficients & Pesaran (2004) CD test

{col 2}Variables series tested: {res}{col 20}govsize
{txt}{col 32}Group variable: {res}{col 47}pref
{txt}{col 30}Number of groups: {res}{col 47}318
{txt}{col 21}Average # of observations: {res}{col 47}7.99
{txt}{col 38}Panel is: {res}{col 47}unbalanced

{txt}{hline 13}{c TT}{hline 43}
{col 2}   Variable {c |}{col 19}CD-test{col 28}p-value{col 40}corr{col 46}abs(corr)
{hline 13}{c +}{hline 43}
     govsize {c |}{res}{col 19} 460.50{col 28}  0.000{col 39}0.727{col 48}0.758
{txt}{hline 13}{c BT}{hline 43}
{col 2}Notes: Under the null hypothesis of cross-section 
{col 9}independence CD ~ N(0,1)

{com}. xtcd open
{err}unknown function *sqrt()
{txt}{search r(133):r(133);}

{com}.  pescadf  govsize
{err}option lags() required
{txt}{search r(198):r(198);}

{com}.  pescadf  govsize, lags(1)

{txt}Number of gaps in sample:  {res}5
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}govsize
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{txt}panel is unbalanced, only standarized Ztbar statistic can be calculated

Z[t-bar] test, (N,T1-T318) = (318, 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8)
Obs = 1897{col 15}Augmented by 1 lags (average) 

    Z[t-bar]{col 15}P-value
{res}   57.006{col 10}    1.000

{com}.  pescadf  open, lags(1)

{txt}Number of gaps in sample:  {res}127
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}open
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{err}insufficient observations
{txt}{search r(2001):r(2001);}

{com}. preserve

. xtbalance, range(2006 2013) miss(r_cmg2)

{txt}({res}201{txt} observations deleted due to missing) 

({res}895{txt} observations deleted due to discontinues) 

{com}. pescadf r_cmg2, lags(1)

{txt}Pesaran's CADF test for {res}r_cmg2
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant

{txt}t-bar test, N,T = (181,8){col 35}Obs = 1086{col 48}
Augmented by 1 lags (average) 

    t-bar{col 15}cv10{col 25}cv5{col 35}cv1{col 41}Z[t-bar]{col 53}P-value
{res}    2.610{col 10}   -1.990{col 20}   -2.080{col 30}   -2.250{col 39}   43.172{col 49}    1.000

{com}. restore

. help xtmg

. help xtmg

. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtserial govsize open lngdppc lnpop

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     308) = {res}    28.516
{txt}{col 12}Prob > F = {res}     0.0000
{txt}
{com}. 
{txt}end of do-file

{com}. xtcd govsize


{txt}{col 2}Average correlation coefficients & Pesaran (2004) CD test

{col 2}Variables series tested: {res}{col 20}govsize
{txt}{col 32}Group variable: {res}{col 47}pref
{txt}{col 30}Number of groups: {res}{col 47}318
{txt}{col 21}Average # of observations: {res}{col 47}7.99
{txt}{col 38}Panel is: {res}{col 47}unbalanced

{txt}{hline 13}{c TT}{hline 43}
{col 2}   Variable {c |}{col 19}CD-test{col 28}p-value{col 40}corr{col 46}abs(corr)
{hline 13}{c +}{hline 43}
     govsize {c |}{res}{col 19} 460.50{col 28}  0.000{col 39}0.727{col 48}0.758
{txt}{hline 13}{c BT}{hline 43}
{col 2}Notes: Under the null hypothesis of cross-section 
{col 9}independence CD ~ N(0,1)

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtserial r_mg

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     310) = {res}     0.956
{txt}{col 12}Prob > F = {res}     0.3291
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtserial r_cmg

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     311) = {res}     0.160
{txt}{col 12}Prob > F = {res}     0.6891
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtserial r_cmg2

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     310) = {res}     0.644
{txt}{col 12}Prob > F = {res}     0.4229
{txt}
{com}. 
{txt}end of do-file

{com}. exit, clear
