{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}F:\git\stata\output\1Jun2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Jun 2017, 02:21:27
{txt}
{com}. * -------------------------------------------------------
. 
. 
. 
. 
. /*
> * -------------------------------------------------------
> // Close the log, end the file
> log close
> exit

{txt}end of do-file

{com}. doedit pf01.do

. help svvarlbl

. help xtcd

. help xtcsd

. help xtcsd

. do "F:\git\stata\output\31May2017\pf01-1.do"
{txt}
{com}. *-------------------------------------------------------
. * project: 财政学研究方法，学期论文
. * dofile name: pf01.do
. * May31st, 2017, Version 0.
. * Ren Qingjie, Peking University, renqingjie@pku.edu.cn
. *-------------------------------------------------------
. 
. *-------------------------------------------------------
. * Program Setup
. *-------------------------------------------------------
. 
. version 14              // Set Version number for backward compatibility
{txt}
{com}. set more off            // Disable partitioned output
{txt}
{com}. clear all               // Start with a clean slate
{txt}
{com}. set linesize 80         // Line size limit to make output more readable
{txt}
{com}. *set matsize 5000               // Set Workspace 
.                                                 // Set Work Directory
. 
. global root "F:\git\stata"
{txt}
{com}. cap noi mkdir ${c -(}root{c )-}\output
{err}could not create directory F:\git\stata\output
{txt}
{com}. global output = "${c -(}root{c )-}\output\"
{txt}
{com}. 
. cd ${c -(}output{c )-}
{res}F:\git\stata\output
{txt}
{com}. local D = c(current_date)
{txt}
{com}. global D = subinstr("`D'"," ","",.)
{txt}
{com}. cap noi mkdir "$D"
{err}could not create directory 1Jun2017
{txt}
{com}. global today = "${c -(}output{c )-}\${c -(}D{c )-}"
{txt}
{com}. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. 
. /*
> macro drop _all         // clear all macros
> capture log close       // Close existing log files
> log using logfile.txt, replace       // Open log file
> * -------------------------------------------------------
> */
. 
. 
. 
. 
. ****** 清理数据
. 
. *** 处理地区编码
. ** 导入地区编码的数据
. clear
{txt}
{com}. cd "F:\data\pf\统一的编码文件"
{res}F:\data\pf\统一的编码文件
{txt}
{com}. unicode analyze citycode_0.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate citycode_0.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. ** 导入数据
. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. use "F:\data\pf\统一的编码文件\citycode_0.dta", clear
{txt}
{com}. * 删除重复项，包括“县”，“市辖区”等
. duplicates drop city1, force

{p 0 4}{txt}Duplicates in terms of {res} city1{p_end}

{txt}(331 observations deleted)

{com}. rename city city_shortname
{res}{txt}
{com}. rename city1 city
{res}{txt}
{com}. save newcitycode.dta, replace
{txt}file newcitycode.dta saved

{com}. 
. 
. ****** 导入数据
. 
. *** 数据编码方式修改
. clear
{txt}
{com}. cd "F:\data\pf\"
{res}F:\data\pf
{txt}
{com}. unicode analyze city_quyu.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate city_quyu.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. *** 导入数据
. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. use "F:\data\pf\city_quyu.dta", clear
{txt}
{com}. 
. *** 处理原数据
. * 将城市名称统一
. replace city=ustrregexs(1) if ustrregexm(city,"^.*?([\u4e00-\u9fa5]+).*$")
{txt}(897 real changes made)

{com}. * 重命名变量名 (非常长，大约100行)
. rename q1_1             land                    //土地面积
{res}{txt}
{com}. rename q1_3             pop                             //年底总人口
{res}{txt}
{com}. rename q1_3_1   pop_male                //男
{res}{txt}
{com}. rename q1_3_2   pop_female              //女
{res}{txt}
{com}. rename q1_3_3   pop_birth               //出生人口
{res}{txt}
{com}. rename q1_3_4   pop_death               //死亡人口
{res}{txt}
{com}. rename q1_4             family                  //年底总户数
{res}{txt}
{com}. rename q2_1             gdp                             //地区生产总值
{res}{txt}
{com}. rename q2_2             gdp_pri                 //第一产业地区生产总值
{res}{txt}
{com}. rename q2_3             gdp_sec                 //第二产业地区生产总值
{res}{txt}
{com}. rename q2_4             gdp_ind                 //工业生产总值
{res}{txt}
{com}. rename q2_5             gdp_thi                 //第三产业地区生产总值
{res}{txt}
{com}. rename q2_6             gdp_per                 //人均地区生产总值
{res}{txt}
{com}. rename q3_1     gdp_index               //地区生产总值指数
{res}{txt}
{com}. rename q3_2             gdp_index_pri   //第一产业地区生产总值指数
{res}{txt}
{com}. rename q3_3     gdp_index_sec
{res}{txt}
{com}. rename q3_4             gdp_index_ind
{res}{txt}
{com}. rename q3_5             gdp_index_thi
{res}{txt}
{com}. rename q3_6             gdp_index_per
{res}{txt}
{com}. rename q4_0             investment                              //全社会固定资产投资
{res}{txt}
{com}. rename q4_1             investment_urban                //不含农户
{res}{txt}
{com}. rename q4_2             investment_realestate   //房地产开发投资
{res}{txt}
{com}. rename q4_2_1   investment_rural                //农村投资
{res}{txt}
{com}. rename q6_1             fisrev                                  //公共预算收入
{res}{txt}
{com}. rename q6_2             fisrev_tax                              //税收收入
{res}{txt}
{com}. rename q6_3             fisrev_tax_vat                  //增值税
{res}{txt}
{com}. rename q6_4             fisrev_tax_op                   //营业税
{res}{txt}
{com}. rename q6_5             fisrev_tax_firm                 //企业所得税
{res}{txt}
{com}. rename q6_6             fisrev_tax_person               //个人所得税
{res}{txt}
{com}. rename q7_1             fisexp                                  //公共财政预算支出
{res}{txt}
{com}. rename q7_2             fisexp_edu                              //教育
{res}{txt}
{com}. rename q7_3     fisexp_security                 //社会保障和就业
{res}{txt}
{com}. rename q8_1             income_rural                    //农村居民人均可支配收入
{res}{txt}
{com}. rename q8_2             expend_rural                    //农村居民人均消费支出
{res}{txt}
{com}. rename q8_3             expend_rural_food               //食品支出
{res}{txt}
{com}. rename q8_4             income_urban                    //城镇居民人均可支配收入
{res}{txt}
{com}. rename q8_5             expend_urban                    //城镇居民人均消费支出
{res}{txt}
{com}. rename q8_6             expend_urban_food               //食品支出
{res}{txt}
{com}. rename q9_1             num_ind                                 //规模以上工业企业单位数
{res}{txt}
{com}. rename q9_1_1   num_ind_large                   //大型企业数量
{res}{txt}
{com}. rename q9_1_2   num_ind_medium                  //中型企业
{res}{txt}
{com}. rename q9_1_3   num_ind_small                   //小型企业
{res}{txt}
{com}. rename q9_0             output_ind                              //工业总产值
{res}{txt}
{com}. rename q9_0_4_2 output_ind_state                //国有及国有控股
{res}{txt}
{com}. rename q9_0_5   output_ind_domestic             //内资企业
{res}{txt}
{com}. rename q9_0_6   output_ind_hmt          //港澳台投资企业
{res}{txt}
{com}. rename q9_0_7   output_ind_frn          //外商投资企业
{res}{txt}
{com}. rename q9_2_1   inc_ind                         //工业企业增加值
{res}{txt}
{com}. rename q9_2_2   index_inc_ind           //工业企业增加值指数
{res}{txt}
{com}. rename q9_2             asset                           //资产合计
{res}{txt}
{com}. rename q9_3             debt                            //负债合计
{res}{txt}
{com}. rename q9_5             revenue                         //主营业务收入
{res}{txt}
{com}. rename q9_7             profit                          //利润总额
{res}{txt}
{com}. rename q10_1    miles                           //公路里程
{res}{txt}
{com}. rename q10_2    miles_grade                     //等级公路
{res}{txt}
{com}. rename q10_3    veh_civil                       //民用汽车
{res}{txt}
{com}. rename q10_4    veh_private                     //私人汽车
{res}{txt}
{com}. rename q11_0    post_telecom            //邮电业务总量
{res}{txt}
{com}. rename q11_2    telecom                         //电信业务总量
{res}{txt}
{com}. rename q11_3    landline                        //固定电话用户
{res}{txt}
{com}. rename q11_4    mobile                          //移动电话用户
{res}{txt}
{com}. rename q5_1             im_ex_port                      //货物进出口总额
{res}{txt}
{com}. rename q5_2             import                          //进口额
{res}{txt}
{com}. rename q5_3             export                          //出口额
{res}{txt}
{com}. rename q5_4             fdi                                     //外商直接投资实际使用额
{res}{txt}
{com}. rename q12_2    savings                         //金融机构人民币存款
{res}{txt}
{com}. rename q12_2_3  savings_firm            //企业存款
{res}{txt}
{com}. rename q12_2_4  savings_resident        //居民储蓄存款
{res}{txt}
{com}. rename q12_2_5  savings_fixed           //定期存款
{res}{txt}
{com}. rename q12_5    loan                            //金融机构人民币贷款
{res}{txt}
{com}. rename q12_5_2  loan_ind                        //工业贷款
{res}{txt}
{com}. rename q12_5_3  loan_busi                       //商业贷款
{res}{txt}
{com}. rename q12_5_4  loan_agri                       //农业贷款
{res}{txt}
{com}. rename q7_5             fisexp_agri                     //农林水利事务财政支出
{res}{txt}
{com}. rename q7_4             fisexp_health           //医疗卫生
{res}{txt}
{com}. rename q8_7             house_rural                     //农村人均住房面积
{res}{txt}
{com}. rename q9_1_5   num_ind_dom                     //内资企业个数
{res}{txt}
{com}. rename q9_1_6   num_ind_hmt                     //港澳台投资企业个数
{res}{txt}
{com}. rename q9_1_7   num_ind_frn                     //外商投资企业
{res}{txt}
{com}. rename q9_0_3   output_ind_large        //大型企业工业总产值
{res}{txt}
{com}. rename q9_0_4   output_ind_medium       //中型企业工业总产值
{res}{txt}
{com}. rename q9_0_4_1 output_ind_small        //小型企业工业总产值
{res}{txt}
{com}. rename q9_4             total_equity            //所有者权益
{res}{txt}
{com}. rename q9_8             total_vat                       //本年应交增值税
{res}{txt}
{com}. rename q9_9             num_employee            //从业人员年平均人数
{res}{txt}
{com}. rename q11_5    internet                        //互联网宽带接入用户数
{res}{txt}
{com}. rename q1_2             pop_per                         //常住人口
{res}{txt}
{com}. rename q9_0_1   output_ind_light        //轻工业
{res}{txt}
{com}. rename q9_0_2   output_ind_heavy        //重工业
{res}{txt}
{com}. rename q12_1    savings_rmbfrn          //金融机构本外币存款
{res}{txt}
{com}. rename q12_2_6  savings_cur                     //活期存款
{res}{txt}
{com}. rename q12_4    loan_rmbfrn                     //金融机构本外币贷款
{res}{txt}
{com}. rename q12_6    loan_short                      //短期贷款
{res}{txt}
{com}. rename q12_7    loan_long                       //中长期贷款
{res}{txt}
{com}. rename q12_7_1  loan_frn                        //境外贷款
{res}{txt}
{com}. rename q4_3             comhouse_sales          //商品房销售额
{res}{txt}
{com}. rename q4_4             house_sales                     //住宅销售额
{res}{txt}
{com}. rename q4_5             comhouse_sales_area     //商品房销售面积
{res}{txt}
{com}. rename q4_6             house_sales_area        //住宅销售面积
{res}{txt}
{com}. rename q8_8             house_area_urban        //城市人均住房面积
{res}{txt}
{com}. rename q11_1    post                            //邮电业务总量
{res}{txt}
{com}. rename q12_2_1  savings_danwei          //单位存款
{res}{txt}
{com}. rename q12_2_2  savings_geren           //个人存款
{res}{txt}
{com}. rename q12_3    savings_deposit         //储蓄存款
{res}{txt}
{com}. rename q7_6             house_security          //住房保障
{res}{txt}
{com}. rename q9_6             cost                            //主营业务成本  //终于结束了$-$
{res}{txt}
{com}. 
. * 转字符型变量为数值型
. foreach var of varlist pop-cost{c -(}
{txt}  2{com}.         destring `var', replace force
{txt}  3{com}. {c )-}
{txt}pop contains nonnumeric characters; pop {res}replaced {txt}as {res}double
{txt}(221 missing values generated)
{res}{txt}pop_male contains nonnumeric characters; pop_male {res}replaced {txt}as {res}double
{txt}(661 missing values generated)
{res}{txt}pop_female contains nonnumeric characters; pop_female {res}replaced {txt}as {res}double
{txt}(662 missing values generated)
{res}{txt}pop_birth contains nonnumeric characters; pop_birth {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}pop_death contains nonnumeric characters; pop_death {res}replaced {txt}as {res}double
{txt}(722 missing values generated)
{res}{txt}family contains nonnumeric characters; family {res}replaced {txt}as {res}double
{txt}(251 missing values generated)
{res}{txt}gdp contains nonnumeric characters; gdp {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_pri contains nonnumeric characters; gdp_pri {res}replaced {txt}as {res}double
{txt}(448 missing values generated)
{res}{txt}gdp_sec contains nonnumeric characters; gdp_sec {res}replaced {txt}as {res}double
{txt}(360 missing values generated)
{res}{txt}gdp_ind contains nonnumeric characters; gdp_ind {res}replaced {txt}as {res}double
{txt}(374 missing values generated)
{res}{txt}gdp_thi contains nonnumeric characters; gdp_thi {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_per contains nonnumeric characters; gdp_per {res}replaced {txt}as {res}double
{txt}(623 missing values generated)
{res}{txt}gdp_index contains nonnumeric characters; gdp_index {res}replaced {txt}as {res}double
{txt}(510 missing values generated)
{res}{txt}gdp_index_pri contains nonnumeric characters; gdp_index_pri {res}replaced {txt}as {res}double
{txt}(555 missing values generated)
{res}{txt}gdp_index_sec contains nonnumeric characters; gdp_index_sec {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_ind contains nonnumeric characters; gdp_index_ind {res}replaced {txt}as {res}double
{txt}(511 missing values generated)
{res}{txt}gdp_index_thi contains nonnumeric characters; gdp_index_thi {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_per contains nonnumeric characters; gdp_index_per {res}replaced {txt}as {res}double
{txt}(660 missing values generated)
{res}{txt}investment contains nonnumeric characters; investment {res}replaced {txt}as {res}double
{txt}(1174 missing values generated)
{res}{txt}investment_urban contains nonnumeric characters; investment_urban {res}replaced {txt}as {res}double
{txt}(188 missing values generated)
{res}{txt}investment_realestate contains nonnumeric characters; investment_realestate {res}replaced {txt}as {res}double
{txt}(246 missing values generated)
{res}{txt}investment_rural contains nonnumeric characters; investment_rural {res}replaced {txt}as {res}double
{txt}(1677 missing values generated)
{res}{txt}fisrev contains nonnumeric characters; fisrev {res}replaced {txt}as {res}double
{txt}(266 missing values generated)
{res}{txt}fisrev_tax contains nonnumeric characters; fisrev_tax {res}replaced {txt}as {res}double
{txt}(298 missing values generated)
{res}{txt}fisrev_tax_vat contains nonnumeric characters; fisrev_tax_vat {res}replaced {txt}as {res}double
{txt}(291 missing values generated)
{res}{txt}fisrev_tax_op contains nonnumeric characters; fisrev_tax_op {res}replaced {txt}as {res}double
{txt}(290 missing values generated)
{res}{txt}fisrev_tax_firm contains nonnumeric characters; fisrev_tax_firm {res}replaced {txt}as {res}double
{txt}(330 missing values generated)
{res}{txt}fisrev_tax_person contains nonnumeric characters; fisrev_tax_person {res}replaced {txt}as {res}double
{txt}(486 missing values generated)
{res}{txt}fisexp contains nonnumeric characters; fisexp {res}replaced {txt}as {res}double
{txt}(265 missing values generated)
{res}{txt}fisexp_edu contains nonnumeric characters; fisexp_edu {res}replaced {txt}as {res}double
{txt}(286 missing values generated)
{res}{txt}fisexp_security contains nonnumeric characters; fisexp_security {res}replaced {txt}as {res}double
{txt}(300 missing values generated)
{res}{txt}income_rural contains nonnumeric characters; income_rural {res}replaced {txt}as {res}double
{txt}(485 missing values generated)
{res}{txt}expend_rural contains nonnumeric characters; expend_rural {res}replaced {txt}as {res}double
{txt}(666 missing values generated)
{res}{txt}expend_rural_food contains nonnumeric characters; expend_rural_food {res}replaced {txt}as {res}double
{txt}(735 missing values generated)
{res}{txt}income_urban contains nonnumeric characters; income_urban {res}replaced {txt}as {res}double
{txt}(529 missing values generated)
{res}{txt}expend_urban contains nonnumeric characters; expend_urban {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}expend_urban_food contains nonnumeric characters; expend_urban_food {res}replaced {txt}as {res}double
{txt}(748 missing values generated)
{res}{txt}num_ind contains nonnumeric characters; num_ind {res}replaced {txt}as {res}long
{txt}(157 missing values generated)
{res}{txt}num_ind_large contains nonnumeric characters; num_ind_large {res}replaced {txt}as {res}int
{txt}(2205 missing values generated)
{res}{txt}num_ind_medium contains nonnumeric characters; num_ind_medium {res}replaced {txt}as {res}int
{txt}(1932 missing values generated)
{res}{txt}num_ind_small contains nonnumeric characters; num_ind_small {res}replaced {txt}as {res}long
{txt}(1884 missing values generated)
{res}{txt}output_ind contains nonnumeric characters; output_ind {res}replaced {txt}as {res}double
{txt}(993 missing values generated)
{res}{txt}output_ind_state contains nonnumeric characters; output_ind_state {res}replaced {txt}as {res}double
{txt}(1928 missing values generated)
{res}{txt}output_ind_domestic contains nonnumeric characters; output_ind_domestic {res}replaced {txt}as {res}double
{txt}(1057 missing values generated)
{res}{txt}output_ind_hmt contains nonnumeric characters; output_ind_hmt {res}replaced {txt}as {res}double
{txt}(1351 missing values generated)
{res}{txt}output_ind_frn contains nonnumeric characters; output_ind_frn {res}replaced {txt}as {res}double
{txt}(1328 missing values generated)
{res}{txt}inc_ind contains nonnumeric characters; inc_ind {res}replaced {txt}as {res}double
{txt}(2393 missing values generated)
{res}{txt}index_inc_ind contains nonnumeric characters; index_inc_ind {res}replaced {txt}as {res}double
{txt}(2584 missing values generated)
{res}{txt}asset contains nonnumeric characters; asset {res}replaced {txt}as {res}double
{txt}(584 missing values generated)
{res}{txt}debt contains nonnumeric characters; debt {res}replaced {txt}as {res}double
{txt}(579 missing values generated)
{res}{txt}revenue contains nonnumeric characters; revenue {res}replaced {txt}as {res}double
{txt}(585 missing values generated)
{res}{txt}profit contains nonnumeric characters; profit {res}replaced {txt}as {res}double
{txt}(602 missing values generated)
{res}{txt}miles contains nonnumeric characters; miles {res}replaced {txt}as {res}double
{txt}(674 missing values generated)
{res}{txt}miles_grade contains nonnumeric characters; miles_grade {res}replaced {txt}as {res}double
{txt}(708 missing values generated)
{res}{txt}veh_civil contains nonnumeric characters; veh_civil {res}replaced {txt}as {res}long
{txt}(846 missing values generated)
{res}{txt}veh_private contains nonnumeric characters; veh_private {res}replaced {txt}as {res}long
{txt}(899 missing values generated)
{res}{txt}post_telecom contains nonnumeric characters; post_telecom {res}replaced {txt}as {res}double
{txt}(1555 missing values generated)
{res}{txt}telecom contains nonnumeric characters; telecom {res}replaced {txt}as {res}double
{txt}(1559 missing values generated)
{res}{txt}landline contains nonnumeric characters; landline {res}replaced {txt}as {res}double
{txt}(916 missing values generated)
{res}{txt}mobile contains nonnumeric characters; mobile {res}replaced {txt}as {res}double
{txt}(933 missing values generated)
{res}{txt}im_ex_port contains nonnumeric characters; im_ex_port {res}replaced {txt}as {res}double
{txt}(557 missing values generated)
{res}{txt}import contains nonnumeric characters; import {res}replaced {txt}as {res}double
{txt}(646 missing values generated)
{res}{txt}export contains nonnumeric characters; export {res}replaced {txt}as {res}double
{txt}(565 missing values generated)
{res}{txt}fdi contains nonnumeric characters; fdi {res}replaced {txt}as {res}double
{txt}(740 missing values generated)
{res}{txt}savings contains nonnumeric characters; savings {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}savings_firm contains nonnumeric characters; savings_firm {res}replaced {txt}as {res}double
{txt}(1572 missing values generated)
{res}{txt}savings_resident contains nonnumeric characters; savings_resident {res}replaced {txt}as {res}double
{txt}(1556 missing values generated)
{res}{txt}savings_fixed contains nonnumeric characters; savings_fixed {res}replaced {txt}as {res}double
{txt}(1577 missing values generated)
{res}{txt}loan contains nonnumeric characters; loan {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}loan_ind contains nonnumeric characters; loan_ind {res}replaced {txt}as {res}double
{txt}(2030 missing values generated)
{res}{txt}loan_busi contains nonnumeric characters; loan_busi {res}replaced {txt}as {res}double
{txt}(2019 missing values generated)
{res}{txt}loan_agri contains nonnumeric characters; loan_agri {res}replaced {txt}as {res}double
{txt}(2021 missing values generated)
{res}{txt}fisexp_agri contains nonnumeric characters; fisexp_agri {res}replaced {txt}as {res}double
{txt}(802 missing values generated)
{res}{txt}fisexp_health contains nonnumeric characters; fisexp_health {res}replaced {txt}as {res}double
{txt}(720 missing values generated)
{res}{txt}house_rural contains nonnumeric characters; house_rural {res}replaced {txt}as {res}double
{txt}(1135 missing values generated)
{res}{txt}q9_1_4 contains nonnumeric characters; q9_1_4 {res}replaced {txt}as {res}int
{txt}(3227 missing values generated)
{res}{txt}num_ind_dom contains nonnumeric characters; num_ind_dom {res}replaced {txt}as {res}long
{txt}(3228 missing values generated)
{res}{txt}num_ind_hmt contains nonnumeric characters; num_ind_hmt {res}replaced {txt}as {res}int
{txt}(3273 missing values generated)
{res}{txt}num_ind_frn contains nonnumeric characters; num_ind_frn {res}replaced {txt}as {res}int
{txt}(3280 missing values generated)
{res}{txt}output_ind_large contains nonnumeric characters; output_ind_large {res}replaced {txt}as {res}double
{txt}(2513 missing values generated)
{res}{txt}output_ind_medium contains nonnumeric characters; output_ind_medium {res}replaced {txt}as {res}double
{txt}(2392 missing values generated)
{res}{txt}output_ind_small contains nonnumeric characters; output_ind_small {res}replaced {txt}as {res}double
{txt}(2785 missing values generated)
{res}{txt}total_equity contains nonnumeric characters; total_equity {res}replaced {txt}as {res}double
{txt}(1920 missing values generated)
{res}{txt}total_vat contains nonnumeric characters; total_vat {res}replaced {txt}as {res}double
{txt}(1931 missing values generated)
{res}{txt}num_employee contains nonnumeric characters; num_employee {res}replaced {txt}as {res}double
{txt}(2756 missing values generated)
{res}{txt}internet contains nonnumeric characters; internet {res}replaced {txt}as {res}double
{txt}(2083 missing values generated)
{res}{txt}pop_per contains nonnumeric characters; pop_per {res}replaced {txt}as {res}double
{txt}(2047 missing values generated)
{res}{txt}output_ind_light contains nonnumeric characters; output_ind_light {res}replaced {txt}as {res}double
{txt}(2804 missing values generated)
{res}{txt}output_ind_heavy contains nonnumeric characters; output_ind_heavy {res}replaced {txt}as {res}double
{txt}(2793 missing values generated)
{res}{txt}savings_rmbfrn contains nonnumeric characters; savings_rmbfrn {res}replaced {txt}as {res}double
{txt}(2246 missing values generated)
{res}{txt}savings_cur contains nonnumeric characters; savings_cur {res}replaced {txt}as {res}double
{txt}(3257 missing values generated)
{res}{txt}loan_rmbfrn contains nonnumeric characters; loan_rmbfrn {res}replaced {txt}as {res}double
{txt}(2249 missing values generated)
{res}{txt}q12_5_1 contains nonnumeric characters; q12_5_1 {res}replaced {txt}as {res}double
{txt}(2483 missing values generated)
{res}{txt}loan_short contains nonnumeric characters; loan_short {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_long contains nonnumeric characters; loan_long {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_frn contains nonnumeric characters; loan_frn {res}replaced {txt}as {res}double
{txt}(3127 missing values generated)
{res}{txt}comhouse_sales contains nonnumeric characters; comhouse_sales {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales contains nonnumeric characters; house_sales {res}replaced {txt}as {res}double
{txt}(2432 missing values generated)
{res}{txt}comhouse_sales_area contains nonnumeric characters; comhouse_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales_area contains nonnumeric characters; house_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_area_urban contains nonnumeric characters; house_area_urban {res}replaced {txt}as {res}double
{txt}(2745 missing values generated)
{res}{txt}post contains nonnumeric characters; post {res}replaced {txt}as {res}double
{txt}(2637 missing values generated)
{res}{txt}savings_danwei contains nonnumeric characters; savings_danwei {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_geren contains nonnumeric characters; savings_geren {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_deposit contains nonnumeric characters; savings_deposit {res}replaced {txt}as {res}double
{txt}(2898 missing values generated)
{res}{txt}house_security contains nonnumeric characters; house_security {res}replaced {txt}as {res}double
{txt}(3283 missing values generated)
{res}{txt}cost contains nonnumeric characters; cost {res}replaced {txt}as {res}double
{txt}(3264 missing values generated)
{res}{txt}
{com}. 
. * 和地区编码合并，便于进一步处理数据（比如施加省份的固定效应）
. merge m:1 city using newcitycode.dta
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           2,943
{txt}{col 9}from master{col 30}{res}             206{txt}  (_merge==1)
{col 9}from using{col 30}{res}           2,737{txt}  (_merge==2)

{col 5}matched{col 30}{res}           3,472{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. *** 处理成为平衡面板
. drop if city=="其他"
{txt}(61 observations deleted)

{com}. encode city, gen(cit)
{txt}
{com}. tsset cit year
{res}{txt}{col 8}panel variable:  {res}cit (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtbalance, range(2006 2013)

{txt}({res}2737{txt} observations deleted due to out of range) 

({res}281{txt} observations deleted due to discontinues) 

{com}. drop _merge
{txt}
{com}. 
. * svvarlbl test.txt, replace  //生成变量名和标签
. 
. 
. ****** 回归1
. 
. 
. /*
> * -------------------------------------------------------
> // Close the log, end the file
> 
> log close
> exit

{txt}end of do-file

{com}. br city code prov pref level

. tab level

     {txt}地区的 {c |}
     行政级 {c |}
    别，1表 {c |}
     示省级 {c |}
    ，2表示 {c |}
     地级市 {c |}
    ，3表示 {c |}
     县级市 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        248        7.43        7.43
{txt}          2 {c |}{res}      2,544       76.26       83.69
{txt}          3 {c |}{res}        544       16.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,336      100.00

{com}. br city if level ==1

. di 248/8
{res}31

{com}. tab city if level ==1

                         {txt}原始文件城市名 {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                                 上海市 {c |}{res}          8        3.23        3.23
{txt}                                 云南省 {c |}{res}          8        3.23        6.45
{txt}                           内蒙古自治区 {c |}{res}          8        3.23        9.68
{txt}                                 北京市 {c |}{res}          8        3.23       12.90
{txt}                                 吉林省 {c |}{res}          8        3.23       16.13
{txt}                                 四川省 {c |}{res}          8        3.23       19.35
{txt}                                 天津市 {c |}{res}          8        3.23       22.58
{txt}                         宁夏回族自治区 {c |}{res}          8        3.23       25.81
{txt}                                 安徽省 {c |}{res}          8        3.23       29.03
{txt}                                 山东省 {c |}{res}          8        3.23       32.26
{txt}                                 山西省 {c |}{res}          8        3.23       35.48
{txt}                                 广东省 {c |}{res}          8        3.23       38.71
{txt}                         广西壮族自治区 {c |}{res}          8        3.23       41.94
{txt}                       新疆维吾尔自治区 {c |}{res}          8        3.23       45.16
{txt}                                 江苏省 {c |}{res}          8        3.23       48.39
{txt}                                 江西省 {c |}{res}          8        3.23       51.61
{txt}                                 河北省 {c |}{res}          8        3.23       54.84
{txt}                                 河南省 {c |}{res}          8        3.23       58.06
{txt}                                 浙江省 {c |}{res}          8        3.23       61.29
{txt}                                 海南省 {c |}{res}          8        3.23       64.52
{txt}                                 湖北省 {c |}{res}          8        3.23       67.74
{txt}                                 湖南省 {c |}{res}          8        3.23       70.97
{txt}                                 甘肃省 {c |}{res}          8        3.23       74.19
{txt}                                 福建省 {c |}{res}          8        3.23       77.42
{txt}                             西藏自治区 {c |}{res}          8        3.23       80.65
{txt}                                 贵州省 {c |}{res}          8        3.23       83.87
{txt}                                 辽宁省 {c |}{res}          8        3.23       87.10
{txt}                                 重庆市 {c |}{res}          8        3.23       90.32
{txt}                                 陕西省 {c |}{res}          8        3.23       93.55
{txt}                                 青海省 {c |}{res}          8        3.23       96.77
{txt}                               黑龙江省 {c |}{res}          8        3.23      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}        248      100.00

{com}. di if city == "四川"
{res}{err}if not found
{txt}{search r(111):r(111);}

{com}. di if city == "海南"
{res}{err}if not found
{txt}{search r(111):r(111);}

{com}. di if city == "海南省"
{res}{err}if not found
{txt}{search r(111):r(111);}

{com}. di if city == "四川省"
{res}{err}if not found
{txt}{search r(111):r(111);}

{com}. di _all if city == "四川省"
{res}{err}_all not found
{txt}{search r(111):r(111);}

{com}. di all if city == "四川省"
{res}{err}all not found
{txt}{search r(111):r(111);}

{com}. di city if city == "四川省"
{res}七台河市{err}if not found
{txt}{search r(111):r(111);}

{com}. di city if city == "海南省"
{res}七台河市{err}if not found
{txt}{search r(111):r(111);}

{com}. tab city if level ==1

                         {txt}原始文件城市名 {c |}      Freq.     Percent        Cum.
{hline 40}{c +}{hline 35}
                                 上海市 {c |}{res}          8        3.23        3.23
{txt}                                 云南省 {c |}{res}          8        3.23        6.45
{txt}                           内蒙古自治区 {c |}{res}          8        3.23        9.68
{txt}                                 北京市 {c |}{res}          8        3.23       12.90
{txt}                                 吉林省 {c |}{res}          8        3.23       16.13
{txt}                                 四川省 {c |}{res}          8        3.23       19.35
{txt}                                 天津市 {c |}{res}          8        3.23       22.58
{txt}                         宁夏回族自治区 {c |}{res}          8        3.23       25.81
{txt}                                 安徽省 {c |}{res}          8        3.23       29.03
{txt}                                 山东省 {c |}{res}          8        3.23       32.26
{txt}                                 山西省 {c |}{res}          8        3.23       35.48
{txt}                                 广东省 {c |}{res}          8        3.23       38.71
{txt}                         广西壮族自治区 {c |}{res}          8        3.23       41.94
{txt}                       新疆维吾尔自治区 {c |}{res}          8        3.23       45.16
{txt}                                 江苏省 {c |}{res}          8        3.23       48.39
{txt}                                 江西省 {c |}{res}          8        3.23       51.61
{txt}                                 河北省 {c |}{res}          8        3.23       54.84
{txt}                                 河南省 {c |}{res}          8        3.23       58.06
{txt}                                 浙江省 {c |}{res}          8        3.23       61.29
{txt}                                 海南省 {c |}{res}          8        3.23       64.52
{txt}                                 湖北省 {c |}{res}          8        3.23       67.74
{txt}                                 湖南省 {c |}{res}          8        3.23       70.97
{txt}                                 甘肃省 {c |}{res}          8        3.23       74.19
{txt}                                 福建省 {c |}{res}          8        3.23       77.42
{txt}                             西藏自治区 {c |}{res}          8        3.23       80.65
{txt}                                 贵州省 {c |}{res}          8        3.23       83.87
{txt}                                 辽宁省 {c |}{res}          8        3.23       87.10
{txt}                                 重庆市 {c |}{res}          8        3.23       90.32
{txt}                                 陕西省 {c |}{res}          8        3.23       93.55
{txt}                                 青海省 {c |}{res}          8        3.23       96.77
{txt}                               黑龙江省 {c |}{res}          8        3.23      100.00
{txt}{hline 40}{c +}{hline 35}
                                  Total {c |}{res}        248      100.00

{com}. dir
{txt}  <dir>   6/01/17  2:24  {res}.                 
{txt}  <dir>   6/01/17  2:24  {res}..                
{txt}   9.0k   5/31/17 11:40  {res}citycode_2012.do  
{txt}   5.3k   5/31/17 11:13  {res}data_2012(1).do   
{txt}   5.3k   5/31/17 11:13  {res}data_2012.do      
{txt}   0.4k   6/01/17  2:21  {res}logfile.txt       
{txt} 213.0k   6/01/17  2:24  {res}newcitycode.dta   
{txt}   7.6k   5/31/17 20:48  {res}pf01.do           
{txt}   7.1k   5/31/17 19:58  {res}test.csv          
{txt}   7.1k   5/31/17 19:58  {res}test.txt          
{txt}  15.7k   5/31/17 20:48  {res}test.xlsx         

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. preserve 
{txt}
{com}. keep if level == 1
{txt}(3,088 observations deleted)

{com}. save province.dta, replace
{txt}(note: file province.dta not found)
file province.dta saved

{com}. 
. restore
{txt}
{com}. keep if level == 2
{txt}(792 observations deleted)

{com}. save city.dta, replace
{txt}(note: file city.dta not found)
file city.dta saved

{com}. 
. 
{txt}end of do-file

{com}. tab level

     {txt}地区的 {c |}
     行政级 {c |}
    别，1表 {c |}
     示省级 {c |}
    ，2表示 {c |}
     地级市 {c |}
    ，3表示 {c |}
     县级市 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          2 {c |}{res}      2,544      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00

{com}. di 2544/8
{res}318

{com}. tab prov

     {txt}省份代 {c |}
         码 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         13 {c |}{res}         88        3.46        3.46
{txt}         14 {c |}{res}         80        3.14        6.60
{txt}         15 {c |}{res}         88        3.46       10.06
{txt}         21 {c |}{res}        112        4.40       14.47
{txt}         22 {c |}{res}         72        2.83       17.30
{txt}         23 {c |}{res}        104        4.09       21.38
{txt}         32 {c |}{res}         96        3.77       25.16
{txt}         33 {c |}{res}         88        3.46       28.62
{txt}         34 {c |}{res}        120        4.72       33.33
{txt}         35 {c |}{res}         72        2.83       36.16
{txt}         36 {c |}{res}         88        3.46       39.62
{txt}         37 {c |}{res}        128        5.03       44.65
{txt}         41 {c |}{res}        136        5.35       50.00
{txt}         42 {c |}{res}         96        3.77       53.77
{txt}         43 {c |}{res}        112        4.40       58.18
{txt}         44 {c |}{res}        168        6.60       64.78
{txt}         45 {c |}{res}        112        4.40       69.18
{txt}         46 {c |}{res}         16        0.63       69.81
{txt}         51 {c |}{res}        168        6.60       76.42
{txt}         52 {c |}{res}         56        2.20       78.62
{txt}         53 {c |}{res}        112        4.40       83.02
{txt}         54 {c |}{res}         48        1.89       84.91
{txt}         61 {c |}{res}         80        3.14       88.05
{txt}         62 {c |}{res}        112        4.40       92.45
{txt}         63 {c |}{res}         48        1.89       94.34
{txt}         64 {c |}{res}         40        1.57       95.91
{txt}         65 {c |}{res}        104        4.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00

{com}. br cit

. duplicates report pref

{p 0 4}{txt}Duplicates in terms of {res} pref{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        8 {c |}         {res}2544          2226
{txt}{hline 10}{c BT}{hline 27}

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. tsset pref year
{res}{txt}{col 8}panel variable:  {res}pref (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtdes

    {txt}pref:  {res}1301{txt}, {res}1302{txt}, ..., {res}6543                             {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(pref*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX
{txt}
{com}. 
{txt}end of do-file

{com}. help pescadf

. help pescadf

. pescadf gdp, lags(1)

{txt}Number of gaps in sample:  {res}1
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}gdp
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{txt}panel is unbalanced, only standarized Ztbar statistic can be calculated

Z[t-bar] test, (N,T1-T318) = (318, 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8)
Obs = 1906{col 15}Augmented by 1 lags (average) 

    Z[t-bar]{col 15}P-value
{res}   57.224{col 10}    1.000

{com}. pescadf gdp, lags(2)

{txt}Number of gaps in sample:  {res}1
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}gdp
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{txt}panel is unbalanced, only standarized Ztbar statistic can be calculated

Z[t-bar] test, (N,T1-T318) = (318, 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8)
Obs = 1588{col 15}Augmented by 2 lags (average) 

    Z[t-bar]{col 15}P-value
{res}   57.224{col 10}    1.000

{com}. pescadf gdp, lags(3)

{txt}Number of gaps in sample:  {res}1
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}gdp
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{txt}panel is unbalanced, only standarized Ztbar statistic can be calculated

Z[t-bar] test, (N,T1-T318) = (318, 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8)
Obs = 1270{col 15}Augmented by 3 lags (average) 

    Z[t-bar]{col 15}P-value
{res}   57.224{col 10}    1.000

{com}. pescadf fdi, lags(2)

{txt}Number of gaps in sample:  {res}128
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}fdi
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{err}insufficient observations
{txt}{search r(2001):r(2001);}

{com}. xtsum fdi

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
fdi{col 10}overall {c |} {res} 49980.63     109318          1    1359985{txt} {c |}{col 69}N =    2219
{col 10}between {c |}{col 31}{res} 99219.29   1.666667   813034.9{txt} {c |}{col 69}n =     308
{col 10}within  {c |}{col 31}{res} 39225.65    -508707     626803{txt} {c |} T-bar = 7.20455

{com}. sum fdi

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}      2,219    49980.63      109318          1    1359985

{com}. by year, sort:sum fdi

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        287    28344.64     65987.2         11     610461

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        185    42862.78    87594.82         35     716471

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        291    39604.51    86332.03          2     813262

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        289    42643.35     91339.2          2     822653

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        287    49893.62    108498.1          1    1003025

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        292    58187.09      123219         10    1101208

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        294    64657.57    134471.4         11    1235033

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        294    70320.48    140772.3         44    1359985


{com}. pescadf output_ind_frn, lags(1)

{txt}Number of gaps in sample:  {res}42
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}output_ind_frn
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{err}insufficient observations
{txt}{search r(2001):r(2001);}

{com}. pescadf output_ind_hmt, lags(1)

{txt}Number of gaps in sample:  {res}34
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}output_ind_hmt
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{err}insufficient observations
{txt}{search r(2001):r(2001);}

{com}. pescadf gdp, lags(1)

{txt}Number of gaps in sample:  {res}1
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}gdp
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{txt}panel is unbalanced, only standarized Ztbar statistic can be calculated

Z[t-bar] test, (N,T1-T318) = (318, 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8)
Obs = 1906{col 15}Augmented by 1 lags (average) 

    Z[t-bar]{col 15}P-value
{res}   57.224{col 10}    1.000

{com}. pescadf output_ind_hmt, lags(1) trend

{txt}Number of gaps in sample:  {res}34
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}output_ind_hmt
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant & trend
{err}insufficient observations
{txt}{search r(2001):r(2001);}

{com}. pescadf output_ind_hmt, lags(1) trend trunoff

{txt}Number of gaps in sample:  {res}34
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}output_ind_hmt
{txt}Cross-sectional average in first period extracted and no truncation of extreme t-values
Deterministics chosen: {res}constant & trend
{err}insufficient observations
{txt}{search r(2001):r(2001);}

{com}. help xtfisher

. use http://fmwww.bc.edu/ec-p/data/hayashi/sheston91.dta,clear
{txt}(Penn World Table Mark 5, R. Summers / A. Heston, 1991)

{com}. help xtfisher

. xtfisher gdp
{err}variable {bf}gdp{sf} not found
{txt}{search r(111):r(111);}

{com}. do "F:\git\stata\output\31May2017\pf01-1.do"
{txt}
{com}. *-------------------------------------------------------
. * project: 财政学研究方法，学期论文
. * dofile name: pf01.do
. * May31st, 2017, Version 0.
. * Ren Qingjie, Peking University, renqingjie@pku.edu.cn
. *-------------------------------------------------------
. 
. *-------------------------------------------------------
. * Program Setup
. *-------------------------------------------------------
. 
. version 14              // Set Version number for backward compatibility
{txt}
{com}. set more off            // Disable partitioned output
{txt}
{com}. clear all               // Start with a clean slate
{txt}
{com}. set linesize 80         // Line size limit to make output more readable
{txt}
{com}. *set matsize 5000               // Set Workspace 
.                                                 // Set Work Directory
. 
. global root "F:\git\stata"
{txt}
{com}. cap noi mkdir ${c -(}root{c )-}\output
{err}could not create directory F:\git\stata\output
{txt}
{com}. global output = "${c -(}root{c )-}\output\"
{txt}
{com}. 
. cd ${c -(}output{c )-}
{res}F:\git\stata\output
{txt}
{com}. local D = c(current_date)
{txt}
{com}. global D = subinstr("`D'"," ","",.)
{txt}
{com}. cap noi mkdir "$D"
{err}could not create directory 1Jun2017
{txt}
{com}. global today = "${c -(}output{c )-}\${c -(}D{c )-}"
{txt}
{com}. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. 
. /*
> macro drop _all         // clear all macros
> capture log close       // Close existing log files
> log using logfile.txt, replace       // Open log file
> * -------------------------------------------------------
> */
. 
. 
. 
. 
. ****** 清理数据
. 
. *** 处理地区编码
. ** 导入地区编码的数据
. clear
{txt}
{com}. cd "F:\data\pf\统一的编码文件"
{res}F:\data\pf\统一的编码文件
{txt}
{com}. unicode analyze citycode_0.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate citycode_0.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. ** 导入数据
. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. use "F:\data\pf\统一的编码文件\citycode_0.dta", clear
{txt}
{com}. * 删除重复项，包括“县”，“市辖区”等
. duplicates drop city1, force

{p 0 4}{txt}Duplicates in terms of {res} city1{p_end}

{txt}(331 observations deleted)

{com}. rename city city_shortname
{res}{txt}
{com}. rename city1 city
{res}{txt}
{com}. save newcitycode.dta, replace
{txt}file newcitycode.dta saved

{com}. 
. 
. ****** 导入数据
. 
. *** 数据编码方式修改
. clear
{txt}
{com}. cd "F:\data\pf\"
{res}F:\data\pf
{txt}
{com}. unicode analyze city_quyu.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate city_quyu.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. *** 导入数据
. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. use "F:\data\pf\city_quyu.dta", clear
{txt}
{com}. 
. *** 处理原数据
. * 将城市名称统一
. replace city=ustrregexs(1) if ustrregexm(city,"^.*?([\u4e00-\u9fa5]+).*$")
{txt}(897 real changes made)

{com}. * 重命名变量名 (非常长，大约100行)
. rename q1_1             land                    //土地面积
{res}{txt}
{com}. rename q1_3             pop                             //年底总人口
{res}{txt}
{com}. rename q1_3_1   pop_male                //男
{res}{txt}
{com}. rename q1_3_2   pop_female              //女
{res}{txt}
{com}. rename q1_3_3   pop_birth               //出生人口
{res}{txt}
{com}. rename q1_3_4   pop_death               //死亡人口
{res}{txt}
{com}. rename q1_4             family                  //年底总户数
{res}{txt}
{com}. rename q2_1             gdp                             //地区生产总值
{res}{txt}
{com}. rename q2_2             gdp_pri                 //第一产业地区生产总值
{res}{txt}
{com}. rename q2_3             gdp_sec                 //第二产业地区生产总值
{res}{txt}
{com}. rename q2_4             gdp_ind                 //工业生产总值
{res}{txt}
{com}. rename q2_5             gdp_thi                 //第三产业地区生产总值
{res}{txt}
{com}. rename q2_6             gdp_per                 //人均地区生产总值
{res}{txt}
{com}. rename q3_1     gdp_index               //地区生产总值指数
{res}{txt}
{com}. rename q3_2             gdp_index_pri   //第一产业地区生产总值指数
{res}{txt}
{com}. rename q3_3     gdp_index_sec
{res}{txt}
{com}. rename q3_4             gdp_index_ind
{res}{txt}
{com}. rename q3_5             gdp_index_thi
{res}{txt}
{com}. rename q3_6             gdp_index_per
{res}{txt}
{com}. rename q4_0             investment                              //全社会固定资产投资
{res}{txt}
{com}. rename q4_1             investment_urban                //不含农户
{res}{txt}
{com}. rename q4_2             investment_realestate   //房地产开发投资
{res}{txt}
{com}. rename q4_2_1   investment_rural                //农村投资
{res}{txt}
{com}. rename q6_1             fisrev                                  //公共预算收入
{res}{txt}
{com}. rename q6_2             fisrev_tax                              //税收收入
{res}{txt}
{com}. rename q6_3             fisrev_tax_vat                  //增值税
{res}{txt}
{com}. rename q6_4             fisrev_tax_op                   //营业税
{res}{txt}
{com}. rename q6_5             fisrev_tax_firm                 //企业所得税
{res}{txt}
{com}. rename q6_6             fisrev_tax_person               //个人所得税
{res}{txt}
{com}. rename q7_1             fisexp                                  //公共财政预算支出
{res}{txt}
{com}. rename q7_2             fisexp_edu                              //教育
{res}{txt}
{com}. rename q7_3     fisexp_security                 //社会保障和就业
{res}{txt}
{com}. rename q8_1             income_rural                    //农村居民人均可支配收入
{res}{txt}
{com}. rename q8_2             expend_rural                    //农村居民人均消费支出
{res}{txt}
{com}. rename q8_3             expend_rural_food               //食品支出
{res}{txt}
{com}. rename q8_4             income_urban                    //城镇居民人均可支配收入
{res}{txt}
{com}. rename q8_5             expend_urban                    //城镇居民人均消费支出
{res}{txt}
{com}. rename q8_6             expend_urban_food               //食品支出
{res}{txt}
{com}. rename q9_1             num_ind                                 //规模以上工业企业单位数
{res}{txt}
{com}. rename q9_1_1   num_ind_large                   //大型企业数量
{res}{txt}
{com}. rename q9_1_2   num_ind_medium                  //中型企业
{res}{txt}
{com}. rename q9_1_3   num_ind_small                   //小型企业
{res}{txt}
{com}. rename q9_0             output_ind                              //工业总产值
{res}{txt}
{com}. rename q9_0_4_2 output_ind_state                //国有及国有控股
{res}{txt}
{com}. rename q9_0_5   output_ind_domestic             //内资企业
{res}{txt}
{com}. rename q9_0_6   output_ind_hmt          //港澳台投资企业
{res}{txt}
{com}. rename q9_0_7   output_ind_frn          //外商投资企业
{res}{txt}
{com}. rename q9_2_1   inc_ind                         //工业企业增加值
{res}{txt}
{com}. rename q9_2_2   index_inc_ind           //工业企业增加值指数
{res}{txt}
{com}. rename q9_2             asset                           //资产合计
{res}{txt}
{com}. rename q9_3             debt                            //负债合计
{res}{txt}
{com}. rename q9_5             revenue                         //主营业务收入
{res}{txt}
{com}. rename q9_7             profit                          //利润总额
{res}{txt}
{com}. rename q10_1    miles                           //公路里程
{res}{txt}
{com}. rename q10_2    miles_grade                     //等级公路
{res}{txt}
{com}. rename q10_3    veh_civil                       //民用汽车
{res}{txt}
{com}. rename q10_4    veh_private                     //私人汽车
{res}{txt}
{com}. rename q11_0    post_telecom            //邮电业务总量
{res}{txt}
{com}. rename q11_2    telecom                         //电信业务总量
{res}{txt}
{com}. rename q11_3    landline                        //固定电话用户
{res}{txt}
{com}. rename q11_4    mobile                          //移动电话用户
{res}{txt}
{com}. rename q5_1             im_ex_port                      //货物进出口总额
{res}{txt}
{com}. rename q5_2             import                          //进口额
{res}{txt}
{com}. rename q5_3             export                          //出口额
{res}{txt}
{com}. rename q5_4             fdi                                     //外商直接投资实际使用额
{res}{txt}
{com}. rename q12_2    savings                         //金融机构人民币存款
{res}{txt}
{com}. rename q12_2_3  savings_firm            //企业存款
{res}{txt}
{com}. rename q12_2_4  savings_resident        //居民储蓄存款
{res}{txt}
{com}. rename q12_2_5  savings_fixed           //定期存款
{res}{txt}
{com}. rename q12_5    loan                            //金融机构人民币贷款
{res}{txt}
{com}. rename q12_5_2  loan_ind                        //工业贷款
{res}{txt}
{com}. rename q12_5_3  loan_busi                       //商业贷款
{res}{txt}
{com}. rename q12_5_4  loan_agri                       //农业贷款
{res}{txt}
{com}. rename q7_5             fisexp_agri                     //农林水利事务财政支出
{res}{txt}
{com}. rename q7_4             fisexp_health           //医疗卫生
{res}{txt}
{com}. rename q8_7             house_rural                     //农村人均住房面积
{res}{txt}
{com}. rename q9_1_5   num_ind_dom                     //内资企业个数
{res}{txt}
{com}. rename q9_1_6   num_ind_hmt                     //港澳台投资企业个数
{res}{txt}
{com}. rename q9_1_7   num_ind_frn                     //外商投资企业
{res}{txt}
{com}. rename q9_0_3   output_ind_large        //大型企业工业总产值
{res}{txt}
{com}. rename q9_0_4   output_ind_medium       //中型企业工业总产值
{res}{txt}
{com}. rename q9_0_4_1 output_ind_small        //小型企业工业总产值
{res}{txt}
{com}. rename q9_4             total_equity            //所有者权益
{res}{txt}
{com}. rename q9_8             total_vat                       //本年应交增值税
{res}{txt}
{com}. rename q9_9             num_employee            //从业人员年平均人数
{res}{txt}
{com}. rename q11_5    internet                        //互联网宽带接入用户数
{res}{txt}
{com}. rename q1_2             pop_per                         //常住人口
{res}{txt}
{com}. rename q9_0_1   output_ind_light        //轻工业
{res}{txt}
{com}. rename q9_0_2   output_ind_heavy        //重工业
{res}{txt}
{com}. rename q12_1    savings_rmbfrn          //金融机构本外币存款
{res}{txt}
{com}. rename q12_2_6  savings_cur                     //活期存款
{res}{txt}
{com}. rename q12_4    loan_rmbfrn                     //金融机构本外币贷款
{res}{txt}
{com}. rename q12_6    loan_short                      //短期贷款
{res}{txt}
{com}. rename q12_7    loan_long                       //中长期贷款
{res}{txt}
{com}. rename q12_7_1  loan_frn                        //境外贷款
{res}{txt}
{com}. rename q4_3             comhouse_sales          //商品房销售额
{res}{txt}
{com}. rename q4_4             house_sales                     //住宅销售额
{res}{txt}
{com}. rename q4_5             comhouse_sales_area     //商品房销售面积
{res}{txt}
{com}. rename q4_6             house_sales_area        //住宅销售面积
{res}{txt}
{com}. rename q8_8             house_area_urban        //城市人均住房面积
{res}{txt}
{com}. rename q11_1    post                            //邮电业务总量
{res}{txt}
{com}. rename q12_2_1  savings_danwei          //单位存款
{res}{txt}
{com}. rename q12_2_2  savings_geren           //个人存款
{res}{txt}
{com}. rename q12_3    savings_deposit         //储蓄存款
{res}{txt}
{com}. rename q7_6             house_security          //住房保障
{res}{txt}
{com}. rename q9_6             cost                            //主营业务成本  //终于结束了$-$
{res}{txt}
{com}. 
. * 转字符型变量为数值型
. foreach var of varlist pop-cost{c -(}
{txt}  2{com}.         destring `var', replace force
{txt}  3{com}. {c )-}
{txt}pop contains nonnumeric characters; pop {res}replaced {txt}as {res}double
{txt}(221 missing values generated)
{res}{txt}pop_male contains nonnumeric characters; pop_male {res}replaced {txt}as {res}double
{txt}(661 missing values generated)
{res}{txt}pop_female contains nonnumeric characters; pop_female {res}replaced {txt}as {res}double
{txt}(662 missing values generated)
{res}{txt}pop_birth contains nonnumeric characters; pop_birth {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}pop_death contains nonnumeric characters; pop_death {res}replaced {txt}as {res}double
{txt}(722 missing values generated)
{res}{txt}family contains nonnumeric characters; family {res}replaced {txt}as {res}double
{txt}(251 missing values generated)
{res}{txt}gdp contains nonnumeric characters; gdp {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_pri contains nonnumeric characters; gdp_pri {res}replaced {txt}as {res}double
{txt}(448 missing values generated)
{res}{txt}gdp_sec contains nonnumeric characters; gdp_sec {res}replaced {txt}as {res}double
{txt}(360 missing values generated)
{res}{txt}gdp_ind contains nonnumeric characters; gdp_ind {res}replaced {txt}as {res}double
{txt}(374 missing values generated)
{res}{txt}gdp_thi contains nonnumeric characters; gdp_thi {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_per contains nonnumeric characters; gdp_per {res}replaced {txt}as {res}double
{txt}(623 missing values generated)
{res}{txt}gdp_index contains nonnumeric characters; gdp_index {res}replaced {txt}as {res}double
{txt}(510 missing values generated)
{res}{txt}gdp_index_pri contains nonnumeric characters; gdp_index_pri {res}replaced {txt}as {res}double
{txt}(555 missing values generated)
{res}{txt}gdp_index_sec contains nonnumeric characters; gdp_index_sec {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_ind contains nonnumeric characters; gdp_index_ind {res}replaced {txt}as {res}double
{txt}(511 missing values generated)
{res}{txt}gdp_index_thi contains nonnumeric characters; gdp_index_thi {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_per contains nonnumeric characters; gdp_index_per {res}replaced {txt}as {res}double
{txt}(660 missing values generated)
{res}{txt}investment contains nonnumeric characters; investment {res}replaced {txt}as {res}double
{txt}(1174 missing values generated)
{res}{txt}investment_urban contains nonnumeric characters; investment_urban {res}replaced {txt}as {res}double
{txt}(188 missing values generated)
{res}{txt}investment_realestate contains nonnumeric characters; investment_realestate {res}replaced {txt}as {res}double
{txt}(246 missing values generated)
{res}{txt}investment_rural contains nonnumeric characters; investment_rural {res}replaced {txt}as {res}double
{txt}(1677 missing values generated)
{res}{txt}fisrev contains nonnumeric characters; fisrev {res}replaced {txt}as {res}double
{txt}(266 missing values generated)
{res}{txt}fisrev_tax contains nonnumeric characters; fisrev_tax {res}replaced {txt}as {res}double
{txt}(298 missing values generated)
{res}{txt}fisrev_tax_vat contains nonnumeric characters; fisrev_tax_vat {res}replaced {txt}as {res}double
{txt}(291 missing values generated)
{res}{txt}fisrev_tax_op contains nonnumeric characters; fisrev_tax_op {res}replaced {txt}as {res}double
{txt}(290 missing values generated)
{res}{txt}fisrev_tax_firm contains nonnumeric characters; fisrev_tax_firm {res}replaced {txt}as {res}double
{txt}(330 missing values generated)
{res}{txt}fisrev_tax_person contains nonnumeric characters; fisrev_tax_person {res}replaced {txt}as {res}double
{txt}(486 missing values generated)
{res}{txt}fisexp contains nonnumeric characters; fisexp {res}replaced {txt}as {res}double
{txt}(265 missing values generated)
{res}{txt}fisexp_edu contains nonnumeric characters; fisexp_edu {res}replaced {txt}as {res}double
{txt}(286 missing values generated)
{res}{txt}fisexp_security contains nonnumeric characters; fisexp_security {res}replaced {txt}as {res}double
{txt}(300 missing values generated)
{res}{txt}income_rural contains nonnumeric characters; income_rural {res}replaced {txt}as {res}double
{txt}(485 missing values generated)
{res}{txt}expend_rural contains nonnumeric characters; expend_rural {res}replaced {txt}as {res}double
{txt}(666 missing values generated)
{res}{txt}expend_rural_food contains nonnumeric characters; expend_rural_food {res}replaced {txt}as {res}double
{txt}(735 missing values generated)
{res}{txt}income_urban contains nonnumeric characters; income_urban {res}replaced {txt}as {res}double
{txt}(529 missing values generated)
{res}{txt}expend_urban contains nonnumeric characters; expend_urban {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}expend_urban_food contains nonnumeric characters; expend_urban_food {res}replaced {txt}as {res}double
{txt}(748 missing values generated)
{res}{txt}num_ind contains nonnumeric characters; num_ind {res}replaced {txt}as {res}long
{txt}(157 missing values generated)
{res}{txt}num_ind_large contains nonnumeric characters; num_ind_large {res}replaced {txt}as {res}int
{txt}(2205 missing values generated)
{res}{txt}num_ind_medium contains nonnumeric characters; num_ind_medium {res}replaced {txt}as {res}int
{txt}(1932 missing values generated)
{res}{txt}num_ind_small contains nonnumeric characters; num_ind_small {res}replaced {txt}as {res}long
{txt}(1884 missing values generated)
{res}{txt}output_ind contains nonnumeric characters; output_ind {res}replaced {txt}as {res}double
{txt}(993 missing values generated)
{res}{txt}output_ind_state contains nonnumeric characters; output_ind_state {res}replaced {txt}as {res}double
{txt}(1928 missing values generated)
{res}{txt}output_ind_domestic contains nonnumeric characters; output_ind_domestic {res}replaced {txt}as {res}double
{txt}(1057 missing values generated)
{res}{txt}output_ind_hmt contains nonnumeric characters; output_ind_hmt {res}replaced {txt}as {res}double
{txt}(1351 missing values generated)
{res}{txt}output_ind_frn contains nonnumeric characters; output_ind_frn {res}replaced {txt}as {res}double
{txt}(1328 missing values generated)
{res}{txt}inc_ind contains nonnumeric characters; inc_ind {res}replaced {txt}as {res}double
{txt}(2393 missing values generated)
{res}{txt}index_inc_ind contains nonnumeric characters; index_inc_ind {res}replaced {txt}as {res}double
{txt}(2584 missing values generated)
{res}{txt}asset contains nonnumeric characters; asset {res}replaced {txt}as {res}double
{txt}(584 missing values generated)
{res}{txt}debt contains nonnumeric characters; debt {res}replaced {txt}as {res}double
{txt}(579 missing values generated)
{res}{txt}revenue contains nonnumeric characters; revenue {res}replaced {txt}as {res}double
{txt}(585 missing values generated)
{res}{txt}profit contains nonnumeric characters; profit {res}replaced {txt}as {res}double
{txt}(602 missing values generated)
{res}{txt}miles contains nonnumeric characters; miles {res}replaced {txt}as {res}double
{txt}(674 missing values generated)
{res}{txt}miles_grade contains nonnumeric characters; miles_grade {res}replaced {txt}as {res}double
{txt}(708 missing values generated)
{res}{txt}veh_civil contains nonnumeric characters; veh_civil {res}replaced {txt}as {res}long
{txt}(846 missing values generated)
{res}{txt}veh_private contains nonnumeric characters; veh_private {res}replaced {txt}as {res}long
{txt}(899 missing values generated)
{res}{txt}post_telecom contains nonnumeric characters; post_telecom {res}replaced {txt}as {res}double
{txt}(1555 missing values generated)
{res}{txt}telecom contains nonnumeric characters; telecom {res}replaced {txt}as {res}double
{txt}(1559 missing values generated)
{res}{txt}landline contains nonnumeric characters; landline {res}replaced {txt}as {res}double
{txt}(916 missing values generated)
{res}{txt}mobile contains nonnumeric characters; mobile {res}replaced {txt}as {res}double
{txt}(933 missing values generated)
{res}{txt}im_ex_port contains nonnumeric characters; im_ex_port {res}replaced {txt}as {res}double
{txt}(557 missing values generated)
{res}{txt}import contains nonnumeric characters; import {res}replaced {txt}as {res}double
{txt}(646 missing values generated)
{res}{txt}export contains nonnumeric characters; export {res}replaced {txt}as {res}double
{txt}(565 missing values generated)
{res}{txt}fdi contains nonnumeric characters; fdi {res}replaced {txt}as {res}double
{txt}(740 missing values generated)
{res}{txt}savings contains nonnumeric characters; savings {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}savings_firm contains nonnumeric characters; savings_firm {res}replaced {txt}as {res}double
{txt}(1572 missing values generated)
{res}{txt}savings_resident contains nonnumeric characters; savings_resident {res}replaced {txt}as {res}double
{txt}(1556 missing values generated)
{res}{txt}savings_fixed contains nonnumeric characters; savings_fixed {res}replaced {txt}as {res}double
{txt}(1577 missing values generated)
{res}{txt}loan contains nonnumeric characters; loan {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}loan_ind contains nonnumeric characters; loan_ind {res}replaced {txt}as {res}double
{txt}(2030 missing values generated)
{res}{txt}loan_busi contains nonnumeric characters; loan_busi {res}replaced {txt}as {res}double
{txt}(2019 missing values generated)
{res}{txt}loan_agri contains nonnumeric characters; loan_agri {res}replaced {txt}as {res}double
{txt}(2021 missing values generated)
{res}{txt}fisexp_agri contains nonnumeric characters; fisexp_agri {res}replaced {txt}as {res}double
{txt}(802 missing values generated)
{res}{txt}fisexp_health contains nonnumeric characters; fisexp_health {res}replaced {txt}as {res}double
{txt}(720 missing values generated)
{res}{txt}house_rural contains nonnumeric characters; house_rural {res}replaced {txt}as {res}double
{txt}(1135 missing values generated)
{res}{txt}q9_1_4 contains nonnumeric characters; q9_1_4 {res}replaced {txt}as {res}int
{txt}(3227 missing values generated)
{res}{txt}num_ind_dom contains nonnumeric characters; num_ind_dom {res}replaced {txt}as {res}long
{txt}(3228 missing values generated)
{res}{txt}num_ind_hmt contains nonnumeric characters; num_ind_hmt {res}replaced {txt}as {res}int
{txt}(3273 missing values generated)
{res}{txt}num_ind_frn contains nonnumeric characters; num_ind_frn {res}replaced {txt}as {res}int
{txt}(3280 missing values generated)
{res}{txt}output_ind_large contains nonnumeric characters; output_ind_large {res}replaced {txt}as {res}double
{txt}(2513 missing values generated)
{res}{txt}output_ind_medium contains nonnumeric characters; output_ind_medium {res}replaced {txt}as {res}double
{txt}(2392 missing values generated)
{res}{txt}output_ind_small contains nonnumeric characters; output_ind_small {res}replaced {txt}as {res}double
{txt}(2785 missing values generated)
{res}{txt}total_equity contains nonnumeric characters; total_equity {res}replaced {txt}as {res}double
{txt}(1920 missing values generated)
{res}{txt}total_vat contains nonnumeric characters; total_vat {res}replaced {txt}as {res}double
{txt}(1931 missing values generated)
{res}{txt}num_employee contains nonnumeric characters; num_employee {res}replaced {txt}as {res}double
{txt}(2756 missing values generated)
{res}{txt}internet contains nonnumeric characters; internet {res}replaced {txt}as {res}double
{txt}(2083 missing values generated)
{res}{txt}pop_per contains nonnumeric characters; pop_per {res}replaced {txt}as {res}double
{txt}(2047 missing values generated)
{res}{txt}output_ind_light contains nonnumeric characters; output_ind_light {res}replaced {txt}as {res}double
{txt}(2804 missing values generated)
{res}{txt}output_ind_heavy contains nonnumeric characters; output_ind_heavy {res}replaced {txt}as {res}double
{txt}(2793 missing values generated)
{res}{txt}savings_rmbfrn contains nonnumeric characters; savings_rmbfrn {res}replaced {txt}as {res}double
{txt}(2246 missing values generated)
{res}{txt}savings_cur contains nonnumeric characters; savings_cur {res}replaced {txt}as {res}double
{txt}(3257 missing values generated)
{res}{txt}loan_rmbfrn contains nonnumeric characters; loan_rmbfrn {res}replaced {txt}as {res}double
{txt}(2249 missing values generated)
{res}{txt}q12_5_1 contains nonnumeric characters; q12_5_1 {res}replaced {txt}as {res}double
{txt}(2483 missing values generated)
{res}{txt}loan_short contains nonnumeric characters; loan_short {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_long contains nonnumeric characters; loan_long {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_frn contains nonnumeric characters; loan_frn {res}replaced {txt}as {res}double
{txt}(3127 missing values generated)
{res}{txt}comhouse_sales contains nonnumeric characters; comhouse_sales {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales contains nonnumeric characters; house_sales {res}replaced {txt}as {res}double
{txt}(2432 missing values generated)
{res}{txt}comhouse_sales_area contains nonnumeric characters; comhouse_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales_area contains nonnumeric characters; house_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_area_urban contains nonnumeric characters; house_area_urban {res}replaced {txt}as {res}double
{txt}(2745 missing values generated)
{res}{txt}post contains nonnumeric characters; post {res}replaced {txt}as {res}double
{txt}(2637 missing values generated)
{res}{txt}savings_danwei contains nonnumeric characters; savings_danwei {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_geren contains nonnumeric characters; savings_geren {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_deposit contains nonnumeric characters; savings_deposit {res}replaced {txt}as {res}double
{txt}(2898 missing values generated)
{res}{txt}house_security contains nonnumeric characters; house_security {res}replaced {txt}as {res}double
{txt}(3283 missing values generated)
{res}{txt}cost contains nonnumeric characters; cost {res}replaced {txt}as {res}double
{txt}(3264 missing values generated)
{res}{txt}
{com}. 
. * 和地区编码合并，便于进一步处理数据（比如施加省份的固定效应）
. merge m:1 city using newcitycode.dta
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           2,943
{txt}{col 9}from master{col 30}{res}             206{txt}  (_merge==1)
{col 9}from using{col 30}{res}           2,737{txt}  (_merge==2)

{col 5}matched{col 30}{res}           3,472{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. *** 处理成为平衡面板
. drop if city=="其他"
{txt}(61 observations deleted)

{com}. encode city, gen(cit)
{txt}
{com}. tsset cit year
{res}{txt}{col 8}panel variable:  {res}cit (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtbalance, range(2006 2013)

{txt}({res}2737{txt} observations deleted due to out of range) 

({res}281{txt} observations deleted due to discontinues) 

{com}. drop _merge
{txt}
{com}. 
. 
. *** 区分为省级数据和市级的数据，删去县（区）级的数据
. * 保存省级数据
. preserve 
{txt}
{com}. keep if level == 1
{txt}(3,088 observations deleted)

{com}. save province.dta, replace
{txt}file province.dta saved

{com}. restore
{txt}
{com}. * 保存市级数据
. keep if level == 2
{txt}(792 observations deleted)

{com}. save city.dta, replace
{txt}file city.dta saved

{com}. 
. 
. 
. 
. * svvarlbl test.txt, replace  //生成变量名和标签
. 
. 
. ****** 模型建立和模型识别
. tsset pref year
{res}{txt}{col 8}panel variable:  {res}pref (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtdes

    {txt}pref:  {res}1301{txt}, {res}1302{txt}, ..., {res}6543                             {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(pref*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX
{txt}
{com}. 
. 
. 
. 
. 
. *** 平稳性检验
. *** 协整关系建立
. *** 格兰杰因果检验
. 
. 
. /*
> * -------------------------------------------------------
> // Close the log, end the file
> 
> log close
> exit

{txt}end of do-file

{com}. xtfisher gdp


{txt}Fisher Test for panel unit root using an augmented Dickey-Fuller test (0 lags)

Ho: unit root

{col 10}chi2({res}636{txt}){col 23}={res}{col 25}  42.3260
{col 10}{txt}Prob > chi2  ={res}{col 30}1.0000


{com}. xtfisher fdi


{txt}Fisher Test for panel unit root using an augmented Dickey-Fuller test (0 lags)

Ho: unit root

{col 10}chi2({res}586{txt}){col 23}={res}{col 25} 644.3141
{col 10}{txt}Prob > chi2  ={res}{col 30}0.0475


{com}. xtsum fdi

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
fdi{col 10}overall {c |} {res} 49980.63     109318          1    1359985{txt} {c |}{col 69}N =    2219
{col 10}between {c |}{col 31}{res} 99219.29   1.666667   813034.9{txt} {c |}{col 69}n =     308
{col 10}within  {c |}{col 31}{res} 39225.65    -508707     626803{txt} {c |} T-bar = 7.20455

{com}. by year, sort: sum fid

{txt}{hline}
-> year = 2006
{err}variable {bf}fid{sf} not found
{txt}{search r(111):r(111);}

{com}. by year, sort: sum fdi

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        287    28344.64     65987.2         11     610461

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        185    42862.78    87594.82         35     716471

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        291    39604.51    86332.03          2     813262

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        289    42643.35     91339.2          2     822653

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        287    49893.62    108498.1          1    1003025

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        292    58187.09      123219         10    1101208

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        294    64657.57    134471.4         11    1235033

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        294    70320.48    140772.3         44    1359985


{com}. xtfisher fisrev_tax


{txt}Fisher Test for panel unit root using an augmented Dickey-Fuller test (0 lags)

Ho: unit root

{col 10}chi2({res}636{txt}){col 23}={res}{col 25}  45.3602
{col 10}{txt}Prob > chi2  ={res}{col 30}1.0000


{com}. xtcd fisexp gdp fdi
{err}unknown function *sqrt()
{txt}{search r(133):r(133);}

{com}. xtcd fisexp gdp export
{err}Error: The panel is highly unbalanced.
Not enough common observations across panel to perform Pesaran's test.
insufficient observations
{txt}{search r(2001):r(2001);}

{com}. by year, sort: sum export import

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}export {c |}{res}        305    252999.2     1063954         21   1.36e+07
{txt}{space 6}import {c |}{res}        296      175684    829713.9          0   1.01e+07

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}export {c |}{res}        184    309581.2     1031463         30   1.19e+07
{txt}{space 6}import {c |}{res}        185    185457.4    753003.1         46    9290985

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}export {c |}{res}        312    363613.6     1435116          2   1.80e+07
{txt}{space 6}import {c |}{res}        302    239084.8     1004135          1   1.20e+07

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}export {c |}{res}        311    310983.6     1264496         20   1.62e+07
{txt}{space 6}import {c |}{res}        304    217001.9    902637.3          3   1.08e+07

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}export {c |}{res}        311    412758.5     1630246          1   2.04e+07
{txt}{space 6}import {c |}{res}        303    297279.2     1216105          1   1.43e+07

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}export {c |}{res}        311    498971.4     1900428         28   2.45e+07
{txt}{space 6}import {c |}{res}        300    364013.4     1408560        7.3   1.69e+07

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}export {c |}{res}        314    535586.8     2039729          6   2.71e+07
{txt}{space 6}import {c |}{res}        303    375327.4     1506305          6   1.95e+07

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}export {c |}{res}        315    580654.4     2218692          2   3.06e+07
{txt}{space 6}import {c |}{res}        305    395904.2     1678012          4   2.32e+07


{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. by year, sort: sum fisrev fisrev_tax fisexp fisexp_edu, gdp

{txt}{hline}
-> year = 2006
{err}option {bf:gdp} not allowed
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. by year, sort: sum fisrev fisrev_tax fisexp fisexp_edu gdp

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        318    36.96868     59.3207        .19     500.88
{txt}{space 2}fisrev_tax {c |}{res}        311    28.63595    51.55688        .13     429.74
{txt}{space 6}fisexp {c |}{res}        318    62.14846    63.65857        4.7     571.42
{txt}{space 2}fisexp_edu {c |}{res}        318    10.21314    8.025072        .12      57.57
{txt}{space 9}gdp {c |}{res}        318    634.3195    796.5342        8.7     6073.8

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        316    47.76677    77.80313        .31     658.06
{txt}{space 2}fisrev_tax {c |}{res}        316    38.23934    68.88687        .21      622.6
{txt}{space 6}fisexp {c |}{res}        316    80.20475    80.88392       7.58     727.97
{txt}{space 2}fisexp_edu {c |}{res}        299    15.56836    12.40635        .96      85.84
{txt}{space 9}gdp {c |}{res}        317    764.6022    946.4278       10.1     7109.2

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        317    57.30871    93.24271        .41     800.36
{txt}{space 2}fisrev_tax {c |}{res}        315    46.20038    81.96223        .31     763.02
{txt}{space 6}fisexp {c |}{res}        318    103.4712    98.48283       9.24     889.86
{txt}{space 2}fisexp_edu {c |}{res}        317    18.99962    14.86345        .98     103.09
{txt}{space 9}gdp {c |}{res}        318    914.8879    1111.553      12.66    8215.82

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        316    67.41193    104.9034        .52     880.82
{txt}{space 2}fisrev_tax {c |}{res}        317    53.13211    88.84403         .4     823.22
{txt}{space 6}fisexp {c |}{res}        317    127.8001    111.7202      10.31    1000.84
{txt}{space 2}fisexp_edu {c |}{res}        317    22.87025    17.65195       1.33     136.63
{txt}{space 9}gdp {c |}{res}        318    1015.633    1227.738      15.05    9138.21

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        318    85.77767    131.1616        .84    1106.82
{txt}{space 2}fisrev_tax {c |}{res}        318    68.26783    112.9548        .65     991.98
{txt}{space 6}fisexp {c |}{res}        318    159.1972    137.9618      12.19    1266.07
{txt}{space 2}fisexp_edu {c |}{res}        318    26.80355    19.29199       1.52     123.11
{txt}{space 9}gdp {c |}{res}        318    1212.884      1447.4      18.48   10748.28

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        318    110.1129    162.1969       1.26    1339.57
{txt}{space 2}fisrev_tax {c |}{res}        318    85.87437    136.9262        .85    1195.14
{txt}{space 6}fisexp {c |}{res}        318    198.2219    169.9841      16.78    1590.56
{txt}{space 2}fisexp_edu {c |}{res}        318    35.39852    26.71444          2     196.79
{txt}{space 9}gdp {c |}{res}        318    1451.563    1704.191       21.3   12423.44

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        318    131.6083    182.6944        1.5    1482.08
{txt}{space 2}fisrev_tax {c |}{res}        318    100.2825    153.5584        .97    1329.98
{txt}{space 6}fisexp {c |}{res}        317    234.9134    188.9102      19.22    1569.01
{txt}{space 2}fisexp_edu {c |}{res}        317    46.13697    33.53238       2.06     246.13
{txt}{space 9}gdp {c |}{res}        318    1621.744    1895.112      25.63   13551.21

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        316    150.4488    207.3116       1.82    1731.26
{txt}{space 2}fisrev_tax {c |}{res}        316    115.2439    174.9464       1.29    1498.92
{txt}{space 6}fisexp {c |}{res}        318    265.8838     213.054      22.54    1690.83
{txt}{space 2}fisexp_edu {c |}{res}        318    48.35786    37.00829       2.78     287.73
{txt}{space 9}gdp {c |}{res}        318    1780.695    2087.869       28.9    15420.1

{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. by year, sort: sum output_ind im_ex_port loan num_ind_frn num_ind_hmt q12_5_1

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}output_ind {c |}{res}        317     850.212     1494.16         .2    12538.5
{txt}{space 2}im_ex_port {c |}{res}        307    420740.1     1870131          2   2.37e+07
{txt}{space 8}loan {c |}{res}        318    523.2113    974.5501        3.4     7931.8
{txt}{space 1}num_ind_frn {c |}{res}          0
{txt}{space 1}num_ind_hmt {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 5}q12_5_1 {c |}{res}          0

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}output_ind {c |}{res}        317     1091.85    1851.958         .2    15908.9
{txt}{space 2}im_ex_port {c |}{res}        185    493298.3     1773003        515   2.12e+07
{txt}{space 8}loan {c |}{res}        316    613.6101    1147.717        3.8     8737.1
{txt}{space 1}num_ind_frn {c |}{res}          0
{txt}{space 1}num_ind_hmt {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 5}q12_5_1 {c |}{res}          0

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}output_ind {c |}{res}        314    1369.832    2191.984        .38   18685.13
{txt}{space 2}im_ex_port {c |}{res}        313    593133.9     2410885          2   3.00e+07
{txt}{space 8}loan {c |}{res}        317    710.2906    1360.845        2.4   10304.73
{txt}{space 1}num_ind_frn {c |}{res}          0
{txt}{space 1}num_ind_hmt {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 5}q12_5_1 {c |}{res}          0

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}output_ind {c |}{res}        316    1505.673    2336.165        .42    20284.5
{txt}{space 2}im_ex_port {c |}{res}        311    523101.1     2148883         23   2.70e+07
{txt}{space 8}loan {c |}{res}        318    947.7485    1823.969       2.44   12687.86
{txt}{space 1}num_ind_frn {c |}{res}        275    119.2618    334.8821          1       3818
{txt}{space 1}num_ind_hmt {c |}{res}        285    110.3825    331.1713          1       2949
{txt}{hline 13}{c +}{hline 57}
{space 5}q12_5_1 {c |}{res}          0

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}output_ind {c |}{res}        317    1914.865    2835.285        .62   24651.67
{txt}{space 2}im_ex_port {c |}{res}        311    702390.6     2819147          6   3.47e+07
{txt}{space 8}loan {c |}{res}        318    1150.558    2153.727       2.78   14987.73
{txt}{space 1}num_ind_frn {c |}{res}          0
{txt}{space 1}num_ind_hmt {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 5}q12_5_1 {c |}{res}        302     1112.35    2168.201       2.78   14983.28

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}output_ind {c |}{res}        316    2328.697    3220.061        .35   27778.75
{txt}{space 2}im_ex_port {c |}{res}        313    844677.8     3260972         28   4.14e+07
{txt}{space 8}loan {c |}{res}        317     1331.32    2421.469       3.04   16359.73
{txt}{space 1}num_ind_frn {c |}{res}          0
{txt}{space 1}num_ind_hmt {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 5}q12_5_1 {c |}{res}        317    1328.868     2412.68       3.04   16110.27

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}output_ind {c |}{res}          0
{txt}{space 2}im_ex_port {c |}{res}        315    894915.7     3501169          6   4.67e+07
{txt}{space 8}loan {c |}{res}        317    1529.638    2721.986          4   18023.02
{txt}{space 1}num_ind_frn {c |}{res}          0
{txt}{space 1}num_ind_hmt {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 5}q12_5_1 {c |}{res}        316    1529.342    2726.413          4   17956.78

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}output_ind {c |}{res}          0
{txt}{space 2}im_ex_port {c |}{res}        315    969603.8     3854684          2   5.37e+07
{txt}{space 8}loan {c |}{res}        312    1778.452    3065.204       5.15   20632.92
{txt}{space 1}num_ind_frn {c |}{res}          0
{txt}{space 1}num_ind_hmt {c |}{res}          0
{txt}{hline 13}{c +}{hline 57}
{space 5}q12_5_1 {c |}{res}          0

{txt}
{com}. 
{txt}end of do-file

{com}. xtcd fisexp gdp im_ex_port
{err}unknown function *sqrt()
{txt}{search r(133):r(133);}

{com}. reg fisexp gdp im_ex_port

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,366
{txt}{hline 13}{c +}{hline 34}   F(2, 2363)      = {res}  6529.34
{txt}       Model {c |} {res}   51261282         2    25630641   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9275852.18     2,363  3925.45585   {txt}R-squared       ={res}    0.8468
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8466
{txt}       Total {c |} {res} 60537134.2     2,365  25597.0969   {txt}Root MSE        =   {res} 62.653

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      fisexp{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}gdp {c |}{col 14}{res}{space 2} .0929494{col 26}{space 2} .0011733{col 37}{space 1}   79.22{col 46}{space 3}0.000{col 54}{space 4} .0906485{col 67}{space 3} .0952503
{txt}{space 2}im_ex_port {c |}{col 14}{res}{space 2} 2.05e-06{col 26}{space 2} 6.33e-07{col 37}{space 1}    3.24{col 46}{space 3}0.001{col 54}{space 4} 8.08e-07{col 67}{space 3} 3.29e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 45.27773{col 26}{space 2} 1.746231{col 37}{space 1}   25.93{col 46}{space 3}0.000{col 54}{space 4} 41.85343{col 67}{space 3} 48.70204
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. *-------------------------------------------------------
. * project: 财政学研究方法，学期论文
. * dofile name: pf01.do
. * May31st, 2017, Version 0.
. * Ren Qingjie, Peking University, renqingjie@pku.edu.cn
. *-------------------------------------------------------
. 
. *-------------------------------------------------------
. * Program Setup
. *-------------------------------------------------------
. 
. version 14              // Set Version number for backward compatibility
{txt}
{com}. set more off            // Disable partitioned output
{txt}
{com}. clear all               // Start with a clean slate
{txt}
{com}. set linesize 80         // Line size limit to make output more readable
{txt}
{com}. *set matsize 5000               // Set Workspace 
.                                                 // Set Work Directory
. 
. global root "F:\git\stata"
{txt}
{com}. cap noi mkdir ${c -(}root{c )-}\output
{err}could not create directory F:\git\stata\output
{txt}
{com}. global output = "${c -(}root{c )-}\output\"
{txt}
{com}. 
. cd ${c -(}output{c )-}
{res}F:\git\stata\output
{txt}
{com}. local D = c(current_date)
{txt}
{com}. global D = subinstr("`D'"," ","",.)
{txt}
{com}. cap noi mkdir "$D"
{err}could not create directory 1Jun2017
{txt}
{com}. global today = "${c -(}output{c )-}\${c -(}D{c )-}"
{txt}
{com}. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. 
. /*
> macro drop _all         // clear all macros
> capture log close       // Close existing log files
> log using logfile.txt, replace       // Open log file
> * -------------------------------------------------------
> */
. 
. 
. 
. 
. ****** 清理数据
. 
. *** 处理地区编码
. ** 导入地区编码的数据
. clear
{txt}
{com}. cd "F:\data\pf\统一的编码文件"
{res}F:\data\pf\统一的编码文件
{txt}
{com}. unicode analyze citycode_0.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate citycode_0.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. ** 导入数据
. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. use "F:\data\pf\统一的编码文件\citycode_0.dta", clear
{txt}
{com}. * 删除重复项，包括“县”，“市辖区”等
. duplicates drop city1, force

{p 0 4}{txt}Duplicates in terms of {res} city1{p_end}

{txt}(331 observations deleted)

{com}. rename city city_shortname
{res}{txt}
{com}. rename city1 city
{res}{txt}
{com}. save newcitycode.dta, replace
{txt}file newcitycode.dta saved

{com}. 
. 
. ****** 导入数据
. 
. *** 数据编码方式修改
. clear
{txt}
{com}. cd "F:\data\pf\"
{res}F:\data\pf
{txt}
{com}. unicode analyze city_quyu.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate city_quyu.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. *** 导入数据
. cd $today
{res}F:\git\stata\output\1Jun2017
{txt}
{com}. use "F:\data\pf\city_quyu.dta", clear
{txt}
{com}. 
. *** 处理原数据
. * 将城市名称统一
. replace city=ustrregexs(1) if ustrregexm(city,"^.*?([\u4e00-\u9fa5]+).*$")
{txt}(897 real changes made)

{com}. * 重命名变量名 (非常长，大约100行)
. rename q1_1             land                    //土地面积
{res}{txt}
{com}. rename q1_3             pop                             //年底总人口
{res}{txt}
{com}. rename q1_3_1   pop_male                //男
{res}{txt}
{com}. rename q1_3_2   pop_female              //女
{res}{txt}
{com}. rename q1_3_3   pop_birth               //出生人口
{res}{txt}
{com}. rename q1_3_4   pop_death               //死亡人口
{res}{txt}
{com}. rename q1_4             family                  //年底总户数
{res}{txt}
{com}. rename q2_1             gdp                             //地区生产总值
{res}{txt}
{com}. rename q2_2             gdp_pri                 //第一产业地区生产总值
{res}{txt}
{com}. rename q2_3             gdp_sec                 //第二产业地区生产总值
{res}{txt}
{com}. rename q2_4             gdp_ind                 //工业生产总值
{res}{txt}
{com}. rename q2_5             gdp_thi                 //第三产业地区生产总值
{res}{txt}
{com}. rename q2_6             gdp_per                 //人均地区生产总值
{res}{txt}
{com}. rename q3_1     gdp_index               //地区生产总值指数
{res}{txt}
{com}. rename q3_2             gdp_index_pri   //第一产业地区生产总值指数
{res}{txt}
{com}. rename q3_3     gdp_index_sec
{res}{txt}
{com}. rename q3_4             gdp_index_ind
{res}{txt}
{com}. rename q3_5             gdp_index_thi
{res}{txt}
{com}. rename q3_6             gdp_index_per
{res}{txt}
{com}. rename q4_0             investment                              //全社会固定资产投资
{res}{txt}
{com}. rename q4_1             investment_urban                //不含农户
{res}{txt}
{com}. rename q4_2             investment_realestate   //房地产开发投资
{res}{txt}
{com}. rename q4_2_1   investment_rural                //农村投资
{res}{txt}
{com}. rename q6_1             fisrev                                  //公共预算收入
{res}{txt}
{com}. rename q6_2             fisrev_tax                              //税收收入
{res}{txt}
{com}. rename q6_3             fisrev_tax_vat                  //增值税
{res}{txt}
{com}. rename q6_4             fisrev_tax_op                   //营业税
{res}{txt}
{com}. rename q6_5             fisrev_tax_firm                 //企业所得税
{res}{txt}
{com}. rename q6_6             fisrev_tax_person               //个人所得税
{res}{txt}
{com}. rename q7_1             fisexp                                  //公共财政预算支出
{res}{txt}
{com}. rename q7_2             fisexp_edu                              //教育
{res}{txt}
{com}. rename q7_3     fisexp_security                 //社会保障和就业
{res}{txt}
{com}. rename q8_1             income_rural                    //农村居民人均可支配收入
{res}{txt}
{com}. rename q8_2             expend_rural                    //农村居民人均消费支出
{res}{txt}
{com}. rename q8_3             expend_rural_food               //食品支出
{res}{txt}
{com}. rename q8_4             income_urban                    //城镇居民人均可支配收入
{res}{txt}
{com}. rename q8_5             expend_urban                    //城镇居民人均消费支出
{res}{txt}
{com}. rename q8_6             expend_urban_food               //食品支出
{res}{txt}
{com}. rename q9_1             num_ind                                 //规模以上工业企业单位数
{res}{txt}
{com}. rename q9_1_1   num_ind_large                   //大型企业数量
{res}{txt}
{com}. rename q9_1_2   num_ind_medium                  //中型企业
{res}{txt}
{com}. rename q9_1_3   num_ind_small                   //小型企业
{res}{txt}
{com}. rename q9_0             output_ind                              //工业总产值
{res}{txt}
{com}. rename q9_0_4_2 output_ind_state                //国有及国有控股
{res}{txt}
{com}. rename q9_0_5   output_ind_domestic             //内资企业
{res}{txt}
{com}. rename q9_0_6   output_ind_hmt          //港澳台投资企业
{res}{txt}
{com}. rename q9_0_7   output_ind_frn          //外商投资企业
{res}{txt}
{com}. rename q9_2_1   inc_ind                         //工业企业增加值
{res}{txt}
{com}. rename q9_2_2   index_inc_ind           //工业企业增加值指数
{res}{txt}
{com}. rename q9_2             asset                           //资产合计
{res}{txt}
{com}. rename q9_3             debt                            //负债合计
{res}{txt}
{com}. rename q9_5             revenue                         //主营业务收入
{res}{txt}
{com}. rename q9_7             profit                          //利润总额
{res}{txt}
{com}. rename q10_1    miles                           //公路里程
{res}{txt}
{com}. rename q10_2    miles_grade                     //等级公路
{res}{txt}
{com}. rename q10_3    veh_civil                       //民用汽车
{res}{txt}
{com}. rename q10_4    veh_private                     //私人汽车
{res}{txt}
{com}. rename q11_0    post_telecom            //邮电业务总量
{res}{txt}
{com}. rename q11_2    telecom                         //电信业务总量
{res}{txt}
{com}. rename q11_3    landline                        //固定电话用户
{res}{txt}
{com}. rename q11_4    mobile                          //移动电话用户
{res}{txt}
{com}. rename q5_1             im_ex_port                      //货物进出口总额
{res}{txt}
{com}. rename q5_2             import                          //进口额
{res}{txt}
{com}. rename q5_3             export                          //出口额
{res}{txt}
{com}. rename q5_4             fdi                                     //外商直接投资实际使用额
{res}{txt}
{com}. rename q12_2    savings                         //金融机构人民币存款
{res}{txt}
{com}. rename q12_2_3  savings_firm            //企业存款
{res}{txt}
{com}. rename q12_2_4  savings_resident        //居民储蓄存款
{res}{txt}
{com}. rename q12_2_5  savings_fixed           //定期存款
{res}{txt}
{com}. rename q12_5    loan                            //金融机构人民币贷款
{res}{txt}
{com}. rename q12_5_2  loan_ind                        //工业贷款
{res}{txt}
{com}. rename q12_5_3  loan_busi                       //商业贷款
{res}{txt}
{com}. rename q12_5_4  loan_agri                       //农业贷款
{res}{txt}
{com}. rename q7_5             fisexp_agri                     //农林水利事务财政支出
{res}{txt}
{com}. rename q7_4             fisexp_health           //医疗卫生
{res}{txt}
{com}. rename q8_7             house_rural                     //农村人均住房面积
{res}{txt}
{com}. rename q9_1_5   num_ind_dom                     //内资企业个数
{res}{txt}
{com}. rename q9_1_6   num_ind_hmt                     //港澳台投资企业个数
{res}{txt}
{com}. rename q9_1_7   num_ind_frn                     //外商投资企业
{res}{txt}
{com}. rename q9_0_3   output_ind_large        //大型企业工业总产值
{res}{txt}
{com}. rename q9_0_4   output_ind_medium       //中型企业工业总产值
{res}{txt}
{com}. rename q9_0_4_1 output_ind_small        //小型企业工业总产值
{res}{txt}
{com}. rename q9_4             total_equity            //所有者权益
{res}{txt}
{com}. rename q9_8             total_vat                       //本年应交增值税
{res}{txt}
{com}. rename q9_9             num_employee            //从业人员年平均人数
{res}{txt}
{com}. rename q11_5    internet                        //互联网宽带接入用户数
{res}{txt}
{com}. rename q1_2             pop_per                         //常住人口
{res}{txt}
{com}. rename q9_0_1   output_ind_light        //轻工业
{res}{txt}
{com}. rename q9_0_2   output_ind_heavy        //重工业
{res}{txt}
{com}. rename q12_1    savings_rmbfrn          //金融机构本外币存款
{res}{txt}
{com}. rename q12_2_6  savings_cur                     //活期存款
{res}{txt}
{com}. rename q12_4    loan_rmbfrn                     //金融机构本外币贷款
{res}{txt}
{com}. rename q12_6    loan_short                      //短期贷款
{res}{txt}
{com}. rename q12_7    loan_long                       //中长期贷款
{res}{txt}
{com}. rename q12_7_1  loan_frn                        //境外贷款
{res}{txt}
{com}. rename q4_3             comhouse_sales          //商品房销售额
{res}{txt}
{com}. rename q4_4             house_sales                     //住宅销售额
{res}{txt}
{com}. rename q4_5             comhouse_sales_area     //商品房销售面积
{res}{txt}
{com}. rename q4_6             house_sales_area        //住宅销售面积
{res}{txt}
{com}. rename q8_8             house_area_urban        //城市人均住房面积
{res}{txt}
{com}. rename q11_1    post                            //邮电业务总量
{res}{txt}
{com}. rename q12_2_1  savings_danwei          //单位存款
{res}{txt}
{com}. rename q12_2_2  savings_geren           //个人存款
{res}{txt}
{com}. rename q12_3    savings_deposit         //储蓄存款
{res}{txt}
{com}. rename q7_6             house_security          //住房保障
{res}{txt}
{com}. rename q9_6             cost                            //主营业务成本  //终于结束了$-$
{res}{txt}
{com}. 
. * 转字符型变量为数值型
. foreach var of varlist pop-cost{c -(}
{txt}  2{com}.         destring `var', replace force
{txt}  3{com}. {c )-}
{txt}pop contains nonnumeric characters; pop {res}replaced {txt}as {res}double
{txt}(221 missing values generated)
{res}{txt}pop_male contains nonnumeric characters; pop_male {res}replaced {txt}as {res}double
{txt}(661 missing values generated)
{res}{txt}pop_female contains nonnumeric characters; pop_female {res}replaced {txt}as {res}double
{txt}(662 missing values generated)
{res}{txt}pop_birth contains nonnumeric characters; pop_birth {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}pop_death contains nonnumeric characters; pop_death {res}replaced {txt}as {res}double
{txt}(722 missing values generated)
{res}{txt}family contains nonnumeric characters; family {res}replaced {txt}as {res}double
{txt}(251 missing values generated)
{res}{txt}gdp contains nonnumeric characters; gdp {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_pri contains nonnumeric characters; gdp_pri {res}replaced {txt}as {res}double
{txt}(448 missing values generated)
{res}{txt}gdp_sec contains nonnumeric characters; gdp_sec {res}replaced {txt}as {res}double
{txt}(360 missing values generated)
{res}{txt}gdp_ind contains nonnumeric characters; gdp_ind {res}replaced {txt}as {res}double
{txt}(374 missing values generated)
{res}{txt}gdp_thi contains nonnumeric characters; gdp_thi {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_per contains nonnumeric characters; gdp_per {res}replaced {txt}as {res}double
{txt}(623 missing values generated)
{res}{txt}gdp_index contains nonnumeric characters; gdp_index {res}replaced {txt}as {res}double
{txt}(510 missing values generated)
{res}{txt}gdp_index_pri contains nonnumeric characters; gdp_index_pri {res}replaced {txt}as {res}double
{txt}(555 missing values generated)
{res}{txt}gdp_index_sec contains nonnumeric characters; gdp_index_sec {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_ind contains nonnumeric characters; gdp_index_ind {res}replaced {txt}as {res}double
{txt}(511 missing values generated)
{res}{txt}gdp_index_thi contains nonnumeric characters; gdp_index_thi {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_per contains nonnumeric characters; gdp_index_per {res}replaced {txt}as {res}double
{txt}(660 missing values generated)
{res}{txt}investment contains nonnumeric characters; investment {res}replaced {txt}as {res}double
{txt}(1174 missing values generated)
{res}{txt}investment_urban contains nonnumeric characters; investment_urban {res}replaced {txt}as {res}double
{txt}(188 missing values generated)
{res}{txt}investment_realestate contains nonnumeric characters; investment_realestate {res}replaced {txt}as {res}double
{txt}(246 missing values generated)
{res}{txt}investment_rural contains nonnumeric characters; investment_rural {res}replaced {txt}as {res}double
{txt}(1677 missing values generated)
{res}{txt}fisrev contains nonnumeric characters; fisrev {res}replaced {txt}as {res}double
{txt}(266 missing values generated)
{res}{txt}fisrev_tax contains nonnumeric characters; fisrev_tax {res}replaced {txt}as {res}double
{txt}(298 missing values generated)
{res}{txt}fisrev_tax_vat contains nonnumeric characters; fisrev_tax_vat {res}replaced {txt}as {res}double
{txt}(291 missing values generated)
{res}{txt}fisrev_tax_op contains nonnumeric characters; fisrev_tax_op {res}replaced {txt}as {res}double
{txt}(290 missing values generated)
{res}{txt}fisrev_tax_firm contains nonnumeric characters; fisrev_tax_firm {res}replaced {txt}as {res}double
{txt}(330 missing values generated)
{res}{txt}fisrev_tax_person contains nonnumeric characters; fisrev_tax_person {res}replaced {txt}as {res}double
{txt}(486 missing values generated)
{res}{txt}fisexp contains nonnumeric characters; fisexp {res}replaced {txt}as {res}double
{txt}(265 missing values generated)
{res}{txt}fisexp_edu contains nonnumeric characters; fisexp_edu {res}replaced {txt}as {res}double
{txt}(286 missing values generated)
{res}{txt}fisexp_security contains nonnumeric characters; fisexp_security {res}replaced {txt}as {res}double
{txt}(300 missing values generated)
{res}{txt}income_rural contains nonnumeric characters; income_rural {res}replaced {txt}as {res}double
{txt}(485 missing values generated)
{res}{txt}expend_rural contains nonnumeric characters; expend_rural {res}replaced {txt}as {res}double
{txt}(666 missing values generated)
{res}{txt}expend_rural_food contains nonnumeric characters; expend_rural_food {res}replaced {txt}as {res}double
{txt}(735 missing values generated)
{res}{txt}income_urban contains nonnumeric characters; income_urban {res}replaced {txt}as {res}double
{txt}(529 missing values generated)
{res}{txt}expend_urban contains nonnumeric characters; expend_urban {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}expend_urban_food contains nonnumeric characters; expend_urban_food {res}replaced {txt}as {res}double
{txt}(748 missing values generated)
{res}{txt}num_ind contains nonnumeric characters; num_ind {res}replaced {txt}as {res}long
{txt}(157 missing values generated)
{res}{txt}num_ind_large contains nonnumeric characters; num_ind_large {res}replaced {txt}as {res}int
{txt}(2205 missing values generated)
{res}{txt}num_ind_medium contains nonnumeric characters; num_ind_medium {res}replaced {txt}as {res}int
{txt}(1932 missing values generated)
{res}{txt}num_ind_small contains nonnumeric characters; num_ind_small {res}replaced {txt}as {res}long
{txt}(1884 missing values generated)
{res}{txt}output_ind contains nonnumeric characters; output_ind {res}replaced {txt}as {res}double
{txt}(993 missing values generated)
{res}{txt}output_ind_state contains nonnumeric characters; output_ind_state {res}replaced {txt}as {res}double
{txt}(1928 missing values generated)
{res}{txt}output_ind_domestic contains nonnumeric characters; output_ind_domestic {res}replaced {txt}as {res}double
{txt}(1057 missing values generated)
{res}{txt}output_ind_hmt contains nonnumeric characters; output_ind_hmt {res}replaced {txt}as {res}double
{txt}(1351 missing values generated)
{res}{txt}output_ind_frn contains nonnumeric characters; output_ind_frn {res}replaced {txt}as {res}double
{txt}(1328 missing values generated)
{res}{txt}inc_ind contains nonnumeric characters; inc_ind {res}replaced {txt}as {res}double
{txt}(2393 missing values generated)
{res}{txt}index_inc_ind contains nonnumeric characters; index_inc_ind {res}replaced {txt}as {res}double
{txt}(2584 missing values generated)
{res}{txt}asset contains nonnumeric characters; asset {res}replaced {txt}as {res}double
{txt}(584 missing values generated)
{res}{txt}debt contains nonnumeric characters; debt {res}replaced {txt}as {res}double
{txt}(579 missing values generated)
{res}{txt}revenue contains nonnumeric characters; revenue {res}replaced {txt}as {res}double
{txt}(585 missing values generated)
{res}{txt}profit contains nonnumeric characters; profit {res}replaced {txt}as {res}double
{txt}(602 missing values generated)
{res}{txt}miles contains nonnumeric characters; miles {res}replaced {txt}as {res}double
{txt}(674 missing values generated)
{res}{txt}miles_grade contains nonnumeric characters; miles_grade {res}replaced {txt}as {res}double
{txt}(708 missing values generated)
{res}{txt}veh_civil contains nonnumeric characters; veh_civil {res}replaced {txt}as {res}long
{txt}(846 missing values generated)
{res}{txt}veh_private contains nonnumeric characters; veh_private {res}replaced {txt}as {res}long
{txt}(899 missing values generated)
{res}{txt}post_telecom contains nonnumeric characters; post_telecom {res}replaced {txt}as {res}double
{txt}(1555 missing values generated)
{res}{txt}telecom contains nonnumeric characters; telecom {res}replaced {txt}as {res}double
{txt}(1559 missing values generated)
{res}{txt}landline contains nonnumeric characters; landline {res}replaced {txt}as {res}double
{txt}(916 missing values generated)
{res}{txt}mobile contains nonnumeric characters; mobile {res}replaced {txt}as {res}double
{txt}(933 missing values generated)
{res}{txt}im_ex_port contains nonnumeric characters; im_ex_port {res}replaced {txt}as {res}double
{txt}(557 missing values generated)
{res}{txt}import contains nonnumeric characters; import {res}replaced {txt}as {res}double
{txt}(646 missing values generated)
{res}{txt}export contains nonnumeric characters; export {res}replaced {txt}as {res}double
{txt}(565 missing values generated)
{res}{txt}fdi contains nonnumeric characters; fdi {res}replaced {txt}as {res}double
{txt}(740 missing values generated)
{res}{txt}savings contains nonnumeric characters; savings {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}savings_firm contains nonnumeric characters; savings_firm {res}replaced {txt}as {res}double
{txt}(1572 missing values generated)
{res}{txt}savings_resident contains nonnumeric characters; savings_resident {res}replaced {txt}as {res}double
{txt}(1556 missing values generated)
{res}{txt}savings_fixed contains nonnumeric characters; savings_fixed {res}replaced {txt}as {res}double
{txt}(1577 missing values generated)
{res}{txt}loan contains nonnumeric characters; loan {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}loan_ind contains nonnumeric characters; loan_ind {res}replaced {txt}as {res}double
{txt}(2030 missing values generated)
{res}{txt}loan_busi contains nonnumeric characters; loan_busi {res}replaced {txt}as {res}double
{txt}(2019 missing values generated)
{res}{txt}loan_agri contains nonnumeric characters; loan_agri {res}replaced {txt}as {res}double
{txt}(2021 missing values generated)
{res}{txt}fisexp_agri contains nonnumeric characters; fisexp_agri {res}replaced {txt}as {res}double
{txt}(802 missing values generated)
{res}{txt}fisexp_health contains nonnumeric characters; fisexp_health {res}replaced {txt}as {res}double
{txt}(720 missing values generated)
{res}{txt}house_rural contains nonnumeric characters; house_rural {res}replaced {txt}as {res}double
{txt}(1135 missing values generated)
{res}{txt}q9_1_4 contains nonnumeric characters; q9_1_4 {res}replaced {txt}as {res}int
{txt}(3227 missing values generated)
{res}{txt}num_ind_dom contains nonnumeric characters; num_ind_dom {res}replaced {txt}as {res}long
{txt}(3228 missing values generated)
{res}{txt}num_ind_hmt contains nonnumeric characters; num_ind_hmt {res}replaced {txt}as {res}int
{txt}(3273 missing values generated)
{res}{txt}num_ind_frn contains nonnumeric characters; num_ind_frn {res}replaced {txt}as {res}int
{txt}(3280 missing values generated)
{res}{txt}output_ind_large contains nonnumeric characters; output_ind_large {res}replaced {txt}as {res}double
{txt}(2513 missing values generated)
{res}{txt}output_ind_medium contains nonnumeric characters; output_ind_medium {res}replaced {txt}as {res}double
{txt}(2392 missing values generated)
{res}{txt}output_ind_small contains nonnumeric characters; output_ind_small {res}replaced {txt}as {res}double
{txt}(2785 missing values generated)
{res}{txt}total_equity contains nonnumeric characters; total_equity {res}replaced {txt}as {res}double
{txt}(1920 missing values generated)
{res}{txt}total_vat contains nonnumeric characters; total_vat {res}replaced {txt}as {res}double
{txt}(1931 missing values generated)
{res}{txt}num_employee contains nonnumeric characters; num_employee {res}replaced {txt}as {res}double
{txt}(2756 missing values generated)
{res}{txt}internet contains nonnumeric characters; internet {res}replaced {txt}as {res}double
{txt}(2083 missing values generated)
{res}{txt}pop_per contains nonnumeric characters; pop_per {res}replaced {txt}as {res}double
{txt}(2047 missing values generated)
{res}{txt}output_ind_light contains nonnumeric characters; output_ind_light {res}replaced {txt}as {res}double
{txt}(2804 missing values generated)
{res}{txt}output_ind_heavy contains nonnumeric characters; output_ind_heavy {res}replaced {txt}as {res}double
{txt}(2793 missing values generated)
{res}{txt}savings_rmbfrn contains nonnumeric characters; savings_rmbfrn {res}replaced {txt}as {res}double
{txt}(2246 missing values generated)
{res}{txt}savings_cur contains nonnumeric characters; savings_cur {res}replaced {txt}as {res}double
{txt}(3257 missing values generated)
{res}{txt}loan_rmbfrn contains nonnumeric characters; loan_rmbfrn {res}replaced {txt}as {res}double
{txt}(2249 missing values generated)
{res}{txt}q12_5_1 contains nonnumeric characters; q12_5_1 {res}replaced {txt}as {res}double
{txt}(2483 missing values generated)
{res}{txt}loan_short contains nonnumeric characters; loan_short {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_long contains nonnumeric characters; loan_long {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_frn contains nonnumeric characters; loan_frn {res}replaced {txt}as {res}double
{txt}(3127 missing values generated)
{res}{txt}comhouse_sales contains nonnumeric characters; comhouse_sales {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales contains nonnumeric characters; house_sales {res}replaced {txt}as {res}double
{txt}(2432 missing values generated)
{res}{txt}comhouse_sales_area contains nonnumeric characters; comhouse_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales_area contains nonnumeric characters; house_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_area_urban contains nonnumeric characters; house_area_urban {res}replaced {txt}as {res}double
{txt}(2745 missing values generated)
{res}{txt}post contains nonnumeric characters; post {res}replaced {txt}as {res}double
{txt}(2637 missing values generated)
{res}{txt}savings_danwei contains nonnumeric characters; savings_danwei {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_geren contains nonnumeric characters; savings_geren {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_deposit contains nonnumeric characters; savings_deposit {res}replaced {txt}as {res}double
{txt}(2898 missing values generated)
{res}{txt}house_security contains nonnumeric characters; house_security {res}replaced {txt}as {res}double
{txt}(3283 missing values generated)
{res}{txt}cost contains nonnumeric characters; cost {res}replaced {txt}as {res}double
{txt}(3264 missing values generated)
{res}{txt}
{com}. 
. * 和地区编码合并，便于进一步处理数据（比如施加省份的固定效应）
. merge m:1 city using newcitycode.dta
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           2,943
{txt}{col 9}from master{col 30}{res}             206{txt}  (_merge==1)
{col 9}from using{col 30}{res}           2,737{txt}  (_merge==2)

{col 5}matched{col 30}{res}           3,472{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. *** 处理成为平衡面板
. drop if city=="其他"
{txt}(61 observations deleted)

{com}. encode city, gen(cit)
{txt}
{com}. tsset cit year
{res}{txt}{col 8}panel variable:  {res}cit (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtbalance, range(2006 2013)

{txt}({res}2737{txt} observations deleted due to out of range) 

({res}281{txt} observations deleted due to discontinues) 

{com}. drop _merge
{txt}
{com}. 
. 
. *** 区分为省级数据和市级的数据，删去县（区）级的数据
. * 保存省级数据
. preserve 
{txt}
{com}. keep if level == 1
{txt}(3,088 observations deleted)

{com}. save province.dta, replace
{txt}file province.dta saved

{com}. restore
{txt}
{com}. * 保存市级数据
. keep if level == 2
{txt}(792 observations deleted)

{com}. save city.dta, replace
{txt}file city.dta saved

{com}. 
. 
. 
. 
. * svvarlbl test.txt, replace  //生成变量名和标签
. 
. 
. ****** 模型建立和模型识别
. tsset pref year
{res}{txt}{col 8}panel variable:  {res}pref (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtdes

    {txt}pref:  {res}1301{txt}, {res}1302{txt}, ..., {res}6543                             {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(pref*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX
{txt}
{com}. 
. /*
> by year, sort: sum fisrev fisrev_tax fisexp fisexp_edu gdp
> 第一组基本是平衡的
> by year, sort: sum output_ind im_ex_port loan num_ind_frn num_ind_hmt q12_5_1
> 第二组只有im_ex_port相对平衡，其它的都有缺失，集中在2007年。
> */
. 
. *** 平稳性检验
. *** 协整关系建立
. *** 格兰杰因果检验
. 
. 
. /*
> * -------------------------------------------------------
> // Close the log, end the file
> 
> log close
> exit

{txt}end of do-file

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. gen govsize     = fisrev / gdp
{txt}(8 missing values generated)

{com}. gen     open = im_ex_port /gdp
{txt}(175 missing values generated)

{com}. by year, sort: sum govsize, open

{txt}{hline}
-> year = 2006
{err}option {bf:open} not allowed
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. by year, sort: sum govsize open

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}        318    .0525976    .0198611   .0193548   .1573648
{txt}{space 8}open {c |}{res}        307    287.6861    568.1133   .0384615    4389.06

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}        315    .0555477    .0191833   .0159449   .1343973
{txt}{space 8}open {c |}{res}        184    286.4636    460.0909   3.596369    3714.96

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}        317    .0561875    .0199619    .019704   .1411713
{txt}{space 8}open {c |}{res}        313    314.8553    570.9142   .0501379   4720.682

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}        316    .0601385    .0206978   .0204082   .1462827
{txt}{space 8}open {c |}{res}        311    245.4658    447.7237   .2615717   3604.664

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}        318    .0650742     .023059   .0237265   .1743115
{txt}{space 8}open {c |}{res}        311    281.8919    497.2425   .0567108   3619.087

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}        318    .0710226    .0256197   .0296134    .190872
{txt}{space 8}open {c |}{res}        313    291.9874    496.3812   .2093458   3674.896

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}        318     .078892     .033611   .0294269    .336925
{txt}{space 8}open {c |}{res}        315    287.2782    479.6925   .0828844   3604.639

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}govsize {c |}{res}        316    .0814219    .0294301   .0302256   .2315385
{txt}{space 8}open {c |}{res}        315    289.0369    485.9812   .0216685   3706.671

{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. reg govsize year

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,536
{txt}{hline 13}{c +}{hline 34}   F(1, 2534)      = {res}   425.41
{txt}       Model {c |} {res} .255336535         1  .255336535   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.52092902     2,534  .000600209   {txt}R-squared       ={res}    0.1437
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1434
{txt}       Total {c |} {res} 1.77626555     2,535  .000700696   {txt}Root MSE        =   {res}  .0245

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}year {c |}{col 14}{res}{space 2} .0043799{col 26}{space 2} .0002124{col 37}{space 1}   20.63{col 46}{space 3}0.000{col 54}{space 4} .0039635{col 67}{space 3} .0047963
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-8.736365{col 26}{space 2} .4267276{col 37}{space 1}  -20.47{col 46}{space 3}0.000{col 54}{space 4}-9.573136{col 67}{space 3}-7.899595
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. pescadf govsize
{err}option lags() required
{txt}{search r(198):r(198);}

{com}. pescadf govsize, lags(1)

{txt}Number of gaps in sample:  {res}6
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}govsize
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{txt}panel is unbalanced, only standarized Ztbar statistic can be calculated

Z[t-bar] test, (N,T1-T318) = (318, 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 7 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8)
Obs = 1891{col 15}Augmented by 1 lags (average) 

    Z[t-bar]{col 15}P-value
{res}   57.224{col 10}    1.000

{com}. pescadf open, lags(1)

{txt}Number of gaps in sample:  {res}127
{err}sample may not contain gaps

{txt}Pesaran's CADF test for {res}open
{txt}Cross-sectional average in first period extracted and extreme t-values truncated
Deterministics chosen: {res}constant
{err}insufficient observations
{txt}{search r(2001):r(2001);}

{com}. xtdes open
{err}varlist not allowed
{txt}{search r(101):r(101);}

{com}. xtfisher govsize


{txt}Fisher Test for panel unit root using an augmented Dickey-Fuller test (0 lags)

Ho: unit root

{col 10}chi2({res}636{txt}){col 23}={res}{col 25} 738.4764
{col 10}{txt}Prob > chi2  ={res}{col 30}0.0030


{com}. xtfisher open


{txt}Fisher Test for panel unit root using an augmented Dickey-Fuller test (0 lags)

Ho: unit root

{col 10}chi2({res}626{txt}){col 23}={res}{col 25}2111.1567
{col 10}{txt}Prob > chi2  ={res}{col 30}0.0000


{com}. xtfisher open if year < 2012


{txt}Fisher Test for panel unit root using an augmented Dickey-Fuller test (0 lags)

Ho: unit root

{col 10}chi2({res}620{txt}){col 23}={res}{col 25}2439.4296
{col 10}{txt}Prob > chi2  ={res}{col 30}0.0000


{com}. xtfisher open if year < 2011


{txt}Fisher Test for panel unit root using an augmented Dickey-Fuller test (0 lags)

Ho: unit root

{col 10}chi2({res}620{txt}){col 23}={res}{col 25} 783.2645
{col 10}{txt}Prob > chi2  ={res}{col 30}0.0000


{com}. adf(gdp)
{err}command {bf}adf{sf} is unrecognized
{txt}{search r(199):r(199);}

{com}. adf gdp
{err}command {bf}adf{sf} is unrecognized
{txt}{search r(199):r(199);}

{com}. help adf

. doedit

. dir
{txt}  <dir>   6/01/17  3:20  {res}.                 
{txt}  <dir>   6/01/17  3:20  {res}..                
{txt}2604.7k   6/01/17  3:20  {res}city.dta          
{txt}   9.0k   5/31/17 11:40  {res}citycode_2012.do  
{txt}   5.3k   5/31/17 11:13  {res}data_2012(1).do   
{txt}   5.3k   5/31/17 11:13  {res}data_2012.do      
{txt} 136.8k   6/01/17  3:26  {res}logfile.txt       
{txt} 213.0k   6/01/17  3:20  {res}newcitycode.dta   
{txt}   7.6k   5/31/17 20:48  {res}pf01.do           
{txt} 434.3k   6/01/17  3:20  {res}province.dta      
{txt}   7.1k   5/31/17 19:58  {res}test.csv          
{txt}   7.1k   5/31/17 19:58  {res}test.txt          
{txt}  15.7k   5/31/17 20:48  {res}test.xlsx         
{txt}   0.2k   6/01/17  3:15  {res}~$test.xlsx       

{com}. doedit pf01.do

. doedit pf01-1.do

. xtdes

    {txt}pref:  {res}1301{txt}, {res}1302{txt}, ..., {res}6543                             {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(pref*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX

{com}. xtsum fdi

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
fdi{col 10}overall {c |} {res} 49980.63     109318          1    1359985{txt} {c |}{col 69}N =    2219
{col 10}between {c |}{col 31}{res} 99219.29   1.666667   813034.9{txt} {c |}{col 69}n =     308
{col 10}within  {c |}{col 31}{res} 39225.65    -508707     626803{txt} {c |} T-bar = 7.20455

{com}. xtsum govsize

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
govsize{col 10}overall {c |} {res} .0651161   .0264707   .0159449    .336925{txt} {c |}{col 69}N =    2536
{col 10}between {c |}{col 31}{res} .0213613    .028387   .1510846{txt} {c |}{col 69}n =     318
{col 10}within  {c |}{col 31}{res}  .015683    .006744   .2873053{txt} {c |} T-bar = 7.97484

{com}. xtline govsize
{res}
{com}. xtreg fisrev im_ex_port
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     2,364
{txt}Group variable: {res}pref                            {txt}Number of groups  = {res}       317

{txt}R-sq:                                           Obs per group:
     within  = {res}0.4818                                         {txt}min = {res}         1
{txt}     between = {res}0.6304                                         {txt}avg = {res}       7.5
{txt}     overall = {res}0.5848                                         {txt}max = {res}         8

                                                {txt}Wald chi2({res}1{txt})      =  {res}  2177.93
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      fisrev{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}im_ex_port {c |}{col 14}{res}{space 2} .0000507{col 26}{space 2} 1.09e-06{col 37}{space 1}   46.67{col 46}{space 3}0.000{col 54}{space 4} .0000486{col 67}{space 3} .0000528
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 53.46984{col 26}{space 2} 4.607927{col 37}{space 1}   11.60{col 46}{space 3}0.000{col 54}{space 4} 44.43847{col 67}{space 3} 62.50121
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 76.491794
     {txt}sigma_e {c |} {res} 49.932769
         {txt}rho {c |} {res} .70119859{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtgls fisrev im_ex_port

{txt}Cross-sectional time-series FGLS regression

Coefficients:  {res}generalized least squares
{txt}Panels:        {res}homoskedastic
{txt}Correlation:   {res}no autocorrelation

{txt}Estimated covariances{col 28}= {res}        1{txt}{col 49}Number of obs{col 67}= {res}     2,364
{txt}Estimated autocorrelations{col 28}= {res}        0{txt}{col 49}Number of groups{col 67}= {res}       317
{txt}Estimated coefficients{col 28}= {res}        2{txt}{col 49}Obs per group:
{col 63}min{col 67}= {res}         1
{txt}{col 63}avg{col 67}=  {res} 7.457413
{txt}{col 63}max{col 67}= {res}         8
{txt}{col 49}Wald chi2({res}1{txt}){col 67}=  {res}  3330.06
{txt}Log likelihood{col 28}= {res}-14073.08{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      fisrev{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}im_ex_port {c |}{col 14}{res}{space 2} .0000387{col 26}{space 2} 6.71e-07{col 37}{space 1}   57.71{col 46}{space 3}0.000{col 54}{space 4} .0000374{col 67}{space 3}   .00004
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 63.46852{col 26}{space 2} 1.971095{col 37}{space 1}   32.20{col 46}{space 3}0.000{col 54}{space 4} 59.60524{col 67}{space 3} 67.33179
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. sum im_ex_port

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 2}im_ex_port {c |}{res}      2,370    691524.9     2852514          2   5.37e+07

{com}. sum im_ex_port,d

               {txt}货物进出口总额+万美元
{hline 61}
      Percentiles      Smallest
 1%    {res}       90              2
{txt} 5%    {res}     1143              2
{txt}10%    {res}     4086              2       {txt}Obs         {res}      2,370
{txt}25%    {res}    18121              4       {txt}Sum of Wgt. {res}      2,370

{txt}50%    {res}  78686.5                      {txt}Mean          {res} 691524.9
                        {txt}Largest       Std. Dev.     {res}  2852514
{txt}75%    {res}   319472       3.47e+07
{txt}90%    {res}  1161200       4.14e+07       {txt}Variance      {res} 8.14e+12
{txt}95%    {res}  3278961       4.67e+07       {txt}Skewness      {res}  10.3347
{txt}99%    {res} 1.04e+07       5.37e+07       {txt}Kurtosis      {res} 138.9504

{com}. help renvars

. help substr

. presever
{err}command {bf}presever{sf} is unrecognized
{txt}{search r(199):r(199);}

{com}. preserve

. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. foreach var of varlist *{c -(}
{txt}  2{com}.         if substr("`var'", 1, 2) == "ou"{c -(}
{txt}  3{com}.                 rename `var' "mm_`var'"
{txt}  4{com}.         {c )-}
{txt}  5{com}. {c )-}
{res}{err}"mm_output_ind invalid name
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. foreach var of varlist *{c -(}
{txt}  2{com}.         if substr("`var'", 1, 2) == "ou"{c -(}
{txt}  3{com}.                 rename `var' "mm_"`var'
{txt}  4{com}.         {c )-}
{txt}  5{com}. {c )-}
{res}{err}1 new variable name invalid
{p 4 4 2}
You attempted to rename {bf:output_ind} to {bf:"mm_"output_ind}{err}.
That is an invalid Stata variable name.
{p_end}
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. di 'a'
{res}{err}'a' invalid name
{txt}{search r(198):r(198);}

{com}. di city[1]
{res}石家庄市

{com}. di 石家庄市
{res}{err}石家庄市 not found
{txt}{search r(111):r(111);}

{com}. di "石家庄市"
{res}石家庄市

{com}. di "ab"
{res}ab

{com}. di 'a'
{res}{err}'a' invalid name
{txt}{search r(198):r(198);}

{com}. di "a"
{res}a

{com}. di "a"+"b"
{res}a{err}+"b" invalid name
{txt}{search r(198):r(198);}

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. foreach var of varlist *{c -(}
{txt}  2{com}.         if substr("`var'", 1, 2) == "ou"{c -(}
{txt}  3{com}.                 rename `var' "mm_'`var''"
{txt}  4{com}.         {c )-}
{txt}  5{com}. {c )-}
{res}{err}1 new variable name invalid
{p 4 4 2}
You attempted to rename {bf:output_ind} to {bf:"mm_'output_ind'"}{err}.
That is an invalid Stata variable name.
{p_end}
{txt}{search r(198):r(198);}

end of do-file

{search r(198):r(198);}

{com}. help str

. help join

. di "a"+"b"
{res}a{err}+"b" invalid name
{txt}{search r(198):r(198);}

{com}. help concat

. help concatenation

. local x = "a"

. di `x'
{res}1632.8

{com}. di "`x'"
{res}a

{com}. di a
{res}1632.8

{com}. di "m`x'"
{res}ma

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. foreach var of varlist *{c -(}
{txt}  2{com}.         if substr("`var'", 1, 2) == "ou"{c -(}
{txt}  3{com}.                 rename `var' mm_`var'
{txt}  4{com}.         {c )-}
{txt}  5{com}. {c )-}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. restore

. xtreg fisrev im_ex_port
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     2,364
{txt}Group variable: {res}pref                            {txt}Number of groups  = {res}       317

{txt}R-sq:                                           Obs per group:
     within  = {res}0.4818                                         {txt}min = {res}         1
{txt}     between = {res}0.6304                                         {txt}avg = {res}       7.5
{txt}     overall = {res}0.5848                                         {txt}max = {res}         8

                                                {txt}Wald chi2({res}1{txt})      =  {res}  2177.93
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      fisrev{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}im_ex_port {c |}{col 14}{res}{space 2} .0000507{col 26}{space 2} 1.09e-06{col 37}{space 1}   46.67{col 46}{space 3}0.000{col 54}{space 4} .0000486{col 67}{space 3} .0000528
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 53.46984{col 26}{space 2} 4.607927{col 37}{space 1}   11.60{col 46}{space 3}0.000{col 54}{space 4} 44.43847{col 67}{space 3} 62.50121
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 76.491794
     {txt}sigma_e {c |} {res} 49.932769
         {txt}rho {c |} {res} .70119859{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xttest3
{err}last estimates not xtreg, fe
{txt}{search r(301):r(301);}

{com}. xtreg fisrev im_ex_port, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     2,364
{txt}Group variable: {res}pref{txt}{col 49}Number of groups{col 67}={col 69}{res}       317

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.4818{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.6304{col 63}{txt}avg{col 67}={col 69}{res}       7.5
{txt}     overall = {res}0.5848{col 63}{txt}max{col 67}={col 69}{res}         8

{txt}{col 49}F({res}1{txt},{res}2046{txt}){col 67}={col 70}{res}  1902.55
{txt}corr(u_i, Xb){col 16}= {res}-0.6311{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      fisrev{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}im_ex_port {c |}{col 14}{res}{space 2} .0000617{col 26}{space 2} 1.42e-06{col 37}{space 1}   43.62{col 46}{space 3}0.000{col 54}{space 4}  .000059{col 67}{space 3} .0000645
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 47.55895{col 26}{space 2} 1.418566{col 37}{space 1}   33.53{col 46}{space 3}0.000{col 54}{space 4} 44.77697{col 67}{space 3} 50.34093
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  104.8868
     {txt}sigma_e {c |} {res} 49.932769
         {txt}rho {c |} {res} .81523752{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}316{txt}, {res}2046{txt}) = {res}19.56{col 62}{txt}Prob > F = {res}0.0000

{com}. xttest3

{txt}Modified Wald test for groupwise heteroskedasticity
in fixed effect regression model

{res}H0: sigma(i)^2 = sigma^2 for all i

{txt}chi2 (317)  =  {res} 7.6e+08
{txt}Prob>chi2 =    {res}  0.0000


{com}. xttest2

{err}Error: too few common observations across panel.
no observations
{txt}{search r(2000):r(2000);}

{com}. xtreg fisrev im_ex_port, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     2,364
{txt}Group variable: {res}pref{txt}{col 49}Number of groups{col 67}={col 69}{res}       317

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.4818{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.6304{col 63}{txt}avg{col 67}={col 69}{res}       7.5
{txt}     overall = {res}0.5848{col 63}{txt}max{col 67}={col 69}{res}         8

{txt}{col 49}F({res}1{txt},{res}2046{txt}){col 67}={col 70}{res}  1902.55
{txt}corr(u_i, Xb){col 16}= {res}-0.6311{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      fisrev{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}im_ex_port {c |}{col 14}{res}{space 2} .0000617{col 26}{space 2} 1.42e-06{col 37}{space 1}   43.62{col 46}{space 3}0.000{col 54}{space 4}  .000059{col 67}{space 3} .0000645
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 47.55895{col 26}{space 2} 1.418566{col 37}{space 1}   33.53{col 46}{space 3}0.000{col 54}{space 4} 44.77697{col 67}{space 3} 50.34093
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  104.8868
     {txt}sigma_e {c |} {res} 49.932769
         {txt}rho {c |} {res} .81523752{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}316{txt}, {res}2046{txt}) = {res}19.56{col 62}{txt}Prob > F = {res}0.0000

{com}. xttest2

{err}Error: too few common observations across panel.
no observations
{txt}{search r(2000):r(2000);}

{com}. xtsum fdi

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
fdi{col 10}overall {c |} {res} 49980.63     109318          1    1359985{txt} {c |}{col 69}N =    2219
{col 10}between {c |}{col 31}{res} 99219.29   1.666667   813034.9{txt} {c |}{col 69}n =     308
{col 10}within  {c |}{col 31}{res} 39225.65    -508707     626803{txt} {c |} T-bar = 7.20455

{com}. by year,sort: sum fdi

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        287    28344.64     65987.2         11     610461

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        185    42862.78    87594.82         35     716471

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        291    39604.51    86332.03          2     813262

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        289    42643.35     91339.2          2     822653

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        287    49893.62    108498.1          1    1003025

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        292    58187.09      123219         10    1101208

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        294    64657.57    134471.4         11    1235033

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}fdi {c |}{res}        294    70320.48    140772.3         44    1359985


{com}. plot fdi, by(year)
{res}
{err}too few variables specified
{txt}{search r(102):r(102);}

{com}. bar fdi, by(year)
{err}command {bf}bar{sf} is unrecognized
{txt}{search r(199):r(199);}

{com}. twoway bar fdi
{err}too few variables specified
{txt}{search r(102):r(102);}

{com}. twoway bar fdi year
{res}
{com}. twoway area fdi year
{res}
{com}. br city year if fdi > 500000

. br city year if fdi > 5000000

. br city year if fdi > 50000000

. br city year fdi if fdi > 50000000

. br city year fdi if (fdi > 500000 ) & (fdi != ".")
{err}type mismatch
{txt}{search r(109):r(109);}

{com}. di fdi[214]
{res}.

{com}. br city year fdi if (fdi > 500000 ) & (fdi != ".")
{err}type mismatch
{txt}{search r(109):r(109);}

{com}. twoway bar im_ex_port year
{res}
{com}. twoway area im_ex_port year
{res}
{com}. br city year im_ex_port if im_ex_port < 8000000 & im_ex_port > 1000000

. br city year prof im_ex_port if im_ex_port < 8000000 & im_ex_port > 1000000

. br city year prov im_ex_port if im_ex_port < 8000000 & im_ex_port > 1000000

. sort year code

. br city year prov im_ex_port if im_ex_port < 8000000 & im_ex_port > 1000000

. sort code year

. br city year prov im_ex_port if im_ex_port < 8000000 & im_ex_port > 1000000

. edit city year prov im_ex_port if im_ex_port < 8000000 & im_ex_port > 1000000

. by year, sort: reg govsize open

{txt}{hline}
-> year = 2006

      Source {c |}       SS           df       MS      Number of obs   ={res}       307
{txt}{hline 13}{c +}{hline 34}   F(1, 305)       = {res}    27.85
{txt}       Model {c |} {res} .009998638         1  .009998638   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .109498345       305  .000359011   {txt}R-squared       ={res}    0.0837
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0807
{txt}       Total {c |} {res} .119496983       306  .000390513   {txt}Root MSE        =   {res} .01895

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000101{col 26}{space 2} 1.91e-06{col 37}{space 1}    5.28{col 46}{space 3}0.000{col 54}{space 4} 6.31e-06{col 67}{space 3} .0000138
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   .04949{col 26}{space 2} .0012125{col 37}{space 1}   40.81{col 46}{space 3}0.000{col 54}{space 4}  .047104{col 67}{space 3}  .051876
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline}
-> year = 2007

      Source {c |}       SS           df       MS      Number of obs   ={res}       183
{txt}{hline 13}{c +}{hline 34}   F(1, 181)       = {res}    58.74
{txt}       Model {c |} {res} .013950869         1  .013950869   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .042984438       181  .000237483   {txt}R-squared       ={res}    0.2450
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2409
{txt}       Total {c |} {res} .056935307       182  .000312831   {txt}Root MSE        =   {res} .01541

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2}  .000019{col 26}{space 2} 2.48e-06{col 37}{space 1}    7.66{col 46}{space 3}0.000{col 54}{space 4} .0000141{col 67}{space 3} .0000239
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   .05056{col 26}{space 2} .0013428{col 37}{space 1}   37.65{col 46}{space 3}0.000{col 54}{space 4} .0479105{col 67}{space 3} .0532095
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline}
-> year = 2008

      Source {c |}       SS           df       MS      Number of obs   ={res}       312
{txt}{hline 13}{c +}{hline 34}   F(1, 310)       = {res}    40.26
{txt}       Model {c |} {res}  .01413199         1   .01413199   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .108823351       310  .000351043   {txt}R-squared       ={res}    0.1149
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1121
{txt}       Total {c |} {res} .122955341       311  .000395355   {txt}Root MSE        =   {res} .01874

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000118{col 26}{space 2} 1.86e-06{col 37}{space 1}    6.34{col 46}{space 3}0.000{col 54}{space 4} 8.13e-06{col 67}{space 3} .0000154
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0528438{col 26}{space 2}  .001211{col 37}{space 1}   43.64{col 46}{space 3}0.000{col 54}{space 4}  .050461{col 67}{space 3} .0552265
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline}
-> year = 2009

      Source {c |}       SS           df       MS      Number of obs   ={res}       309
{txt}{hline 13}{c +}{hline 34}   F(1, 307)       = {res}    39.05
{txt}       Model {c |} {res} .014712173         1  .014712173   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .115658331       307  .000376737   {txt}R-squared       ={res}    0.1128
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1100
{txt}       Total {c |} {res} .130370504       308  .000423281   {txt}Root MSE        =   {res} .01941

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000154{col 26}{space 2} 2.46e-06{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .0000106{col 67}{space 3} .0000203
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0568016{col 26}{space 2} .0012609{col 37}{space 1}   45.05{col 46}{space 3}0.000{col 54}{space 4} .0543206{col 67}{space 3} .0592827
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline}
-> year = 2010

      Source {c |}       SS           df       MS      Number of obs   ={res}       311
{txt}{hline 13}{c +}{hline 34}   F(1, 309)       = {res}    31.13
{txt}       Model {c |} {res} .014984241         1  .014984241   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .148756149       309  .000481411   {txt}R-squared       ={res}    0.0915
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0886
{txt}       Total {c |} {res}  .16374039       310  .000528195   {txt}Root MSE        =   {res} .02194

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2}  .000014{col 26}{space 2} 2.51e-06{col 37}{space 1}    5.58{col 46}{space 3}0.000{col 54}{space 4} 9.05e-06{col 67}{space 3} .0000189
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .061605{col 26}{space 2} .0014307{col 37}{space 1}   43.06{col 46}{space 3}0.000{col 54}{space 4} .0587897{col 67}{space 3} .0644202
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline}
-> year = 2011

      Source {c |}       SS           df       MS      Number of obs   ={res}       313
{txt}{hline 13}{c +}{hline 34}   F(1, 311)       = {res}    17.28
{txt}       Model {c |} {res} .010766353         1  .010766353   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .193811574       311  .000623188   {txt}R-squared       ={res}    0.0526
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0496
{txt}       Total {c |} {res} .204577927       312  .000655698   {txt}Root MSE        =   {res} .02496

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000118{col 26}{space 2} 2.85e-06{col 37}{space 1}    4.16{col 46}{space 3}0.000{col 54}{space 4} 6.23e-06{col 67}{space 3} .0000174
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0679038{col 26}{space 2} .0016377{col 37}{space 1}   41.46{col 46}{space 3}0.000{col 54}{space 4} .0646813{col 67}{space 3} .0711262
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline}
-> year = 2012

      Source {c |}       SS           df       MS      Number of obs   ={res}       315
{txt}{hline 13}{c +}{hline 34}   F(1, 313)       = {res}     8.75
{txt}       Model {c |} {res} .009645247         1  .009645247   {txt}Prob > F        ={res}    0.0033
{txt}    Residual {c |} {res} .345032517       313   .00110234   {txt}R-squared       ={res}    0.0272
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0241
{txt}       Total {c |} {res} .354677764       314  .001129547   {txt}Root MSE        =   {res}  .0332

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000116{col 26}{space 2} 3.91e-06{col 37}{space 1}    2.96{col 46}{space 3}0.003{col 54}{space 4} 3.87e-06{col 67}{space 3} .0000192
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0758527{col 26}{space 2} .0021814{col 37}{space 1}   34.77{col 46}{space 3}0.000{col 54}{space 4} .0715606{col 67}{space 3} .0801448
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline}
-> year = 2013

      Source {c |}       SS           df       MS      Number of obs   ={res}       313
{txt}{hline 13}{c +}{hline 34}   F(1, 311)       = {res}    18.28
{txt}       Model {c |} {res} .015046976         1  .015046976   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} .255954241       311  .000823004   {txt}R-squared       ={res}    0.0555
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0525
{txt}       Total {c |} {res} .271001217       312  .000868594   {txt}Root MSE        =   {res} .02869

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000146{col 26}{space 2} 3.42e-06{col 37}{space 1}    4.28{col 46}{space 3}0.000{col 54}{space 4} 7.89e-06{col 67}{space 3} .0000213
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0775091{col 26}{space 2}  .001889{col 37}{space 1}   41.03{col 46}{space 3}0.000{col 54}{space 4} .0737923{col 67}{space 3}  .081226
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. xtreg govsize open
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     2,363
{txt}Group variable: {res}pref                            {txt}Number of groups  = {res}       317

{txt}R-sq:                                           Obs per group:
     within  = {res}0.0085                                         {txt}min = {res}         1
{txt}     between = {res}0.0809                                         {txt}avg = {res}       7.5
{txt}     overall = {res}0.0592                                         {txt}max = {res}         8

                                                {txt}Wald chi2({res}1{txt})      =  {res}    45.06
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000129{col 26}{space 2} 1.92e-06{col 37}{space 1}    6.71{col 46}{space 3}0.000{col 54}{space 4} 9.11e-06{col 67}{space 3} .0000166
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0622858{col 26}{space 2} .0013023{col 37}{space 1}   47.83{col 46}{space 3}0.000{col 54}{space 4} .0597334{col 67}{space 3} .0648382
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .02015971
     {txt}sigma_e {c |} {res} .01672664
         {txt}rho {c |} {res} .59227226{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. help xtreg

. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtreg govsize open, fe vce(cluster prov)

{txt}Fixed-effects (within) regression               Number of obs      = {res}     2363
{txt}Group variable: {res}pref                            {txt}Number of groups   = {res}      317

{txt}R-sq:  within  = {res}0.0085                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.0809                                        {txt}avg = {res}      7.5
{txt}       overall = {res}0.0592                                        {txt}max = {res}        8

                                                {txt}F({res}1{txt},{res}26{txt})            = {res}     3.03
{txt}corr(u_i, Xb)  = {res}-0.0133                        {txt}Prob > F           =    {res}0.0938

{txt}{ralign 78:(Std. Err. adjusted for {res:27} clusters in prov)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000134{col 26}{space 2} 7.72e-06{col 37}{space 1}    1.74{col 46}{space 3}0.094{col 54}{space 4}-2.44e-06{col 67}{space 3} .0000293
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0621569{col 26}{space 2} .0021999{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .0576349{col 67}{space 3} .0666788
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .02108373
     {txt}sigma_e {c |} {res} .01672664
         {txt}rho {c |} {res} .61372516{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
. 
{txt}end of do-file

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtreg govsize open, re vce(cluster prov)
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     2,363
{txt}Group variable: {res}pref                            {txt}Number of groups  = {res}       317

{txt}R-sq:                                           Obs per group:
     within  = {res}0.0085                                         {txt}min = {res}         1
{txt}     between = {res}0.0809                                         {txt}avg = {res}       7.5
{txt}     overall = {res}0.0592                                         {txt}max = {res}         8

                                                {txt}Wald chi2({res}1{txt})      =  {res}     8.25
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0041

{txt}{ralign 78:(Std. Err. adjusted for {res:27} clusters in prov)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000129{col 26}{space 2} 4.48e-06{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} 4.08e-06{col 67}{space 3} .0000216
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0622858{col 26}{space 2} .0028368{col 37}{space 1}   21.96{col 46}{space 3}0.000{col 54}{space 4} .0567257{col 67}{space 3} .0678459
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .02015971
     {txt}sigma_e {c |} {res} .01672664
         {txt}rho {c |} {res} .59227226{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
{txt}end of do-file

{com}. xttest3
{err}last estimates not xtreg, fe
{txt}{search r(301):r(301);}

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtreg govsize open, re vce(cluster prov)
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     2,363
{txt}Group variable: {res}pref                            {txt}Number of groups  = {res}       317

{txt}R-sq:                                           Obs per group:
     within  = {res}0.0085                                         {txt}min = {res}         1
{txt}     between = {res}0.0809                                         {txt}avg = {res}       7.5
{txt}     overall = {res}0.0592                                         {txt}max = {res}         8

                                                {txt}Wald chi2({res}1{txt})      =  {res}     8.25
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0041

{txt}{ralign 78:(Std. Err. adjusted for {res:27} clusters in prov)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000129{col 26}{space 2} 4.48e-06{col 37}{space 1}    2.87{col 46}{space 3}0.004{col 54}{space 4} 4.08e-06{col 67}{space 3} .0000216
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0622858{col 26}{space 2} .0028368{col 37}{space 1}   21.96{col 46}{space 3}0.000{col 54}{space 4} .0567257{col 67}{space 3} .0678459
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .02015971
     {txt}sigma_e {c |} {res} .01672664
         {txt}rho {c |} {res} .59227226{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
{txt}end of do-file

{com}. xtreg govsize open, fe vce(cluster prov)

{txt}Fixed-effects (within) regression               Number of obs      = {res}     2363
{txt}Group variable: {res}pref                            {txt}Number of groups   = {res}      317

{txt}R-sq:  within  = {res}0.0085                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.0809                                        {txt}avg = {res}      7.5
{txt}       overall = {res}0.0592                                        {txt}max = {res}        8

                                                {txt}F({res}1{txt},{res}26{txt})            = {res}     3.03
{txt}corr(u_i, Xb)  = {res}-0.0133                        {txt}Prob > F           =    {res}0.0938

{txt}{ralign 78:(Std. Err. adjusted for {res:27} clusters in prov)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000134{col 26}{space 2} 7.72e-06{col 37}{space 1}    1.74{col 46}{space 3}0.094{col 54}{space 4}-2.44e-06{col 67}{space 3} .0000293
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0621569{col 26}{space 2} .0021999{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .0576349{col 67}{space 3} .0666788
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .02108373
     {txt}sigma_e {c |} {res} .01672664
         {txt}rho {c |} {res} .61372516{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xttest3

{txt}Modified Wald test for groupwise heteroskedasticity
in fixed effect regression model

{res}H0: sigma(i)^2 = sigma^2 for all i

{txt}chi2 (317)  =  {res} 2.2e+05
{txt}Prob>chi2 =    {res}  0.0000


{com}. xtserial govsize open
{err}command {bf}xtserial{sf} is unrecognized
{txt}{search r(199):r(199);}

{com}. help xtserial

. help xtserial

. xtserial govsize open

{txt}Wooldridge test for autocorrelation in panel data
H0: no first order autocorrelation
{col 5}F(  1,     312) = {res}     7.358
{txt}{col 12}Prob > F = {res}     0.0070

{com}. xttest2
{err}last estimates not found
{txt}{search r(301):r(301);}

{com}. xtreg govsize open, fe vce(cluster prov)

{txt}Fixed-effects (within) regression               Number of obs      = {res}     2363
{txt}Group variable: {res}pref                            {txt}Number of groups   = {res}      317

{txt}R-sq:  within  = {res}0.0085                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.0809                                        {txt}avg = {res}      7.5
{txt}       overall = {res}0.0592                                        {txt}max = {res}        8

                                                {txt}F({res}1{txt},{res}26{txt})            = {res}     3.03
{txt}corr(u_i, Xb)  = {res}-0.0133                        {txt}Prob > F           =    {res}0.0938

{txt}{ralign 78:(Std. Err. adjusted for {res:27} clusters in prov)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000134{col 26}{space 2} 7.72e-06{col 37}{space 1}    1.74{col 46}{space 3}0.094{col 54}{space 4}-2.44e-06{col 67}{space 3} .0000293
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0621569{col 26}{space 2} .0021999{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .0576349{col 67}{space 3} .0666788
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .02108373
     {txt}sigma_e {c |} {res} .01672664
         {txt}rho {c |} {res} .61372516{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xttest2

{err}Error: too few common observations across panel.
no observations
{txt}{search r(2000):r(2000);}

{com}. tab prov

     {txt}省份代 {c |}
         码 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         13 {c |}{res}         88        3.46        3.46
{txt}         14 {c |}{res}         80        3.14        6.60
{txt}         15 {c |}{res}         88        3.46       10.06
{txt}         21 {c |}{res}        112        4.40       14.47
{txt}         22 {c |}{res}         72        2.83       17.30
{txt}         23 {c |}{res}        104        4.09       21.38
{txt}         32 {c |}{res}         96        3.77       25.16
{txt}         33 {c |}{res}         88        3.46       28.62
{txt}         34 {c |}{res}        120        4.72       33.33
{txt}         35 {c |}{res}         72        2.83       36.16
{txt}         36 {c |}{res}         88        3.46       39.62
{txt}         37 {c |}{res}        128        5.03       44.65
{txt}         41 {c |}{res}        136        5.35       50.00
{txt}         42 {c |}{res}         96        3.77       53.77
{txt}         43 {c |}{res}        112        4.40       58.18
{txt}         44 {c |}{res}        168        6.60       64.78
{txt}         45 {c |}{res}        112        4.40       69.18
{txt}         46 {c |}{res}         16        0.63       69.81
{txt}         51 {c |}{res}        168        6.60       76.42
{txt}         52 {c |}{res}         56        2.20       78.62
{txt}         53 {c |}{res}        112        4.40       83.02
{txt}         54 {c |}{res}         48        1.89       84.91
{txt}         61 {c |}{res}         80        3.14       88.05
{txt}         62 {c |}{res}        112        4.40       92.45
{txt}         63 {c |}{res}         48        1.89       94.34
{txt}         64 {c |}{res}         40        1.57       95.91
{txt}         65 {c |}{res}        104        4.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00

{com}. tab pref

     {txt}地级市 {c |}
       代码 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1301 {c |}{res}          8        0.31        0.31
{txt}       1302 {c |}{res}          8        0.31        0.63
{txt}       1303 {c |}{res}          8        0.31        0.94
{txt}       1304 {c |}{res}          8        0.31        1.26
{txt}       1305 {c |}{res}          8        0.31        1.57
{txt}       1306 {c |}{res}          8        0.31        1.89
{txt}       1307 {c |}{res}          8        0.31        2.20
{txt}       1308 {c |}{res}          8        0.31        2.52
{txt}       1309 {c |}{res}          8        0.31        2.83
{txt}       1310 {c |}{res}          8        0.31        3.14
{txt}       1311 {c |}{res}          8        0.31        3.46
{txt}       1401 {c |}{res}          8        0.31        3.77
{txt}       1402 {c |}{res}          8        0.31        4.09
{txt}       1403 {c |}{res}          8        0.31        4.40
{txt}       1404 {c |}{res}          8        0.31        4.72
{txt}       1405 {c |}{res}          8        0.31        5.03
{txt}       1406 {c |}{res}          8        0.31        5.35
{txt}       1407 {c |}{res}          8        0.31        5.66
{txt}       1408 {c |}{res}          8        0.31        5.97
{txt}       1409 {c |}{res}          8        0.31        6.29
{txt}       1410 {c |}{res}          8        0.31        6.60
{txt}       1501 {c |}{res}          8        0.31        6.92
{txt}       1502 {c |}{res}          8        0.31        7.23
{txt}       1503 {c |}{res}          8        0.31        7.55
{txt}       1504 {c |}{res}          8        0.31        7.86
{txt}       1505 {c |}{res}          8        0.31        8.18
{txt}       1506 {c |}{res}          8        0.31        8.49
{txt}       1507 {c |}{res}          8        0.31        8.81
{txt}       1509 {c |}{res}          8        0.31        9.12
{txt}       1522 {c |}{res}          8        0.31        9.43
{txt}       1525 {c |}{res}          8        0.31        9.75
{txt}       1529 {c |}{res}          8        0.31       10.06
{txt}       2101 {c |}{res}          8        0.31       10.38
{txt}       2102 {c |}{res}          8        0.31       10.69
{txt}       2103 {c |}{res}          8        0.31       11.01
{txt}       2104 {c |}{res}          8        0.31       11.32
{txt}       2105 {c |}{res}          8        0.31       11.64
{txt}       2106 {c |}{res}          8        0.31       11.95
{txt}       2107 {c |}{res}          8        0.31       12.26
{txt}       2108 {c |}{res}          8        0.31       12.58
{txt}       2109 {c |}{res}          8        0.31       12.89
{txt}       2110 {c |}{res}          8        0.31       13.21
{txt}       2111 {c |}{res}          8        0.31       13.52
{txt}       2112 {c |}{res}          8        0.31       13.84
{txt}       2113 {c |}{res}          8        0.31       14.15
{txt}       2114 {c |}{res}          8        0.31       14.47
{txt}       2201 {c |}{res}          8        0.31       14.78
{txt}       2202 {c |}{res}          8        0.31       15.09
{txt}       2203 {c |}{res}          8        0.31       15.41
{txt}       2204 {c |}{res}          8        0.31       15.72
{txt}       2205 {c |}{res}          8        0.31       16.04
{txt}       2206 {c |}{res}          8        0.31       16.35
{txt}       2207 {c |}{res}          8        0.31       16.67
{err}{hline 2}Break{hline 2}
{txt}{search r(1):r(1);}

{com}. tab prov pref level
{err}too many variables specified
{txt}{search r(103):r(103);}

{com}. tab prov-level
{err}too many variables specified
{txt}{search r(103):r(103);}

{com}. foreach var of varlist prov-level{c -(}tab `var'{c )-}
{err}program error:  code follows on the same line as open brace
{txt}{search r(198):r(198);}

{com}. foreach var of varlist prov-level{c -(}tab `var'{c )-}
{err}program error:  code follows on the same line as open brace
{txt}{search r(198):r(198);}

{com}. foreach var of varlist prov-level{c -(}
{txt}  2{com}. tab `var'
{txt}  3{com}. {c )-}

     {txt}省份代 {c |}
         码 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         13 {c |}{res}         88        3.46        3.46
{txt}         14 {c |}{res}         80        3.14        6.60
{txt}         15 {c |}{res}         88        3.46       10.06
{txt}         21 {c |}{res}        112        4.40       14.47
{txt}         22 {c |}{res}         72        2.83       17.30
{txt}         23 {c |}{res}        104        4.09       21.38
{txt}         32 {c |}{res}         96        3.77       25.16
{txt}         33 {c |}{res}         88        3.46       28.62
{txt}         34 {c |}{res}        120        4.72       33.33
{txt}         35 {c |}{res}         72        2.83       36.16
{txt}         36 {c |}{res}         88        3.46       39.62
{txt}         37 {c |}{res}        128        5.03       44.65
{txt}         41 {c |}{res}        136        5.35       50.00
{txt}         42 {c |}{res}         96        3.77       53.77
{txt}         43 {c |}{res}        112        4.40       58.18
{txt}         44 {c |}{res}        168        6.60       64.78
{txt}         45 {c |}{res}        112        4.40       69.18
{txt}         46 {c |}{res}         16        0.63       69.81
{txt}         51 {c |}{res}        168        6.60       76.42
{txt}         52 {c |}{res}         56        2.20       78.62
{txt}         53 {c |}{res}        112        4.40       83.02
{txt}         54 {c |}{res}         48        1.89       84.91
{txt}         61 {c |}{res}         80        3.14       88.05
{txt}         62 {c |}{res}        112        4.40       92.45
{txt}         63 {c |}{res}         48        1.89       94.34
{txt}         64 {c |}{res}         40        1.57       95.91
{txt}         65 {c |}{res}        104        4.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00

     {txt}地级市 {c |}
       代码 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1301 {c |}{res}          8        0.31        0.31
{txt}       1302 {c |}{res}          8        0.31        0.63
{txt}       1303 {c |}{res}          8        0.31        0.94
{txt}       1304 {c |}{res}          8        0.31        1.26
{txt}       1305 {c |}{res}          8        0.31        1.57
{txt}       1306 {c |}{res}          8        0.31        1.89
{txt}       1307 {c |}{res}          8        0.31        2.20
{txt}       1308 {c |}{res}          8        0.31        2.52
{txt}       1309 {c |}{res}          8        0.31        2.83
{txt}       1310 {c |}{res}          8        0.31        3.14
{txt}       1311 {c |}{res}          8        0.31        3.46
{txt}       1401 {c |}{res}          8        0.31        3.77
{txt}       1402 {c |}{res}          8        0.31        4.09
{txt}       1403 {c |}{res}          8        0.31        4.40
{txt}       1404 {c |}{res}          8        0.31        4.72
{txt}       1405 {c |}{res}          8        0.31        5.03
{txt}       1406 {c |}{res}          8        0.31        5.35
{txt}       1407 {c |}{res}          8        0.31        5.66
{txt}       1408 {c |}{res}          8        0.31        5.97
{txt}       1409 {c |}{res}          8        0.31        6.29
{txt}       1410 {c |}{res}          8        0.31        6.60
{txt}       1501 {c |}{res}          8        0.31        6.92
{txt}       1502 {c |}{res}          8        0.31        7.23
{txt}       1503 {c |}{res}          8        0.31        7.55
{txt}       1504 {c |}{res}          8        0.31        7.86
{txt}       1505 {c |}{res}          8        0.31        8.18
{txt}       1506 {c |}{res}          8        0.31        8.49
{txt}       1507 {c |}{res}          8        0.31        8.81
{txt}       1509 {c |}{res}          8        0.31        9.12
{txt}       1522 {c |}{res}          8        0.31        9.43
{txt}       1525 {c |}{res}          8        0.31        9.75
{txt}       1529 {c |}{res}          8        0.31       10.06
{txt}       2101 {c |}{res}          8        0.31       10.38
{txt}       2102 {c |}{res}          8        0.31       10.69
{txt}       2103 {c |}{res}          8        0.31       11.01
{txt}       2104 {c |}{res}          8        0.31       11.32
{txt}       2105 {c |}{res}          8        0.31       11.64
{txt}       2106 {c |}{res}          8        0.31       11.95
{txt}       2107 {c |}{res}          8        0.31       12.26
{txt}       2108 {c |}{res}          8        0.31       12.58
{txt}       2109 {c |}{res}          8        0.31       12.89
{txt}       2110 {c |}{res}          8        0.31       13.21
{txt}       2111 {c |}{res}          8        0.31       13.52
{txt}       2112 {c |}{res}          8        0.31       13.84
{txt}       2113 {c |}{res}          8        0.31       14.15
{txt}       2114 {c |}{res}          8        0.31       14.47
{txt}       2201 {c |}{res}          8        0.31       14.78
{txt}       2202 {c |}{res}          8        0.31       15.09
{txt}       2203 {c |}{res}          8        0.31       15.41
{txt}       2204 {c |}{res}          8        0.31       15.72
{txt}       2205 {c |}{res}          8        0.31       16.04
{txt}       2206 {c |}{res}          8        0.31       16.35
{txt}       2207 {c |}{res}          8        0.31       16.67
{txt}       2208 {c |}{res}          8        0.31       16.98
{txt}       2224 {c |}{res}          8        0.31       17.30
{txt}       2301 {c |}{res}          8        0.31       17.61
{txt}       2302 {c |}{res}          8        0.31       17.92
{txt}       2303 {c |}{res}          8        0.31       18.24
{txt}       2304 {c |}{res}          8        0.31       18.55
{txt}       2305 {c |}{res}          8        0.31       18.87
{txt}       2306 {c |}{res}          8        0.31       19.18
{txt}       2307 {c |}{res}          8        0.31       19.50
{txt}       2308 {c |}{res}          8        0.31       19.81
{txt}       2309 {c |}{res}          8        0.31       20.13
{txt}       2310 {c |}{res}          8        0.31       20.44
{txt}       2311 {c |}{res}          8        0.31       20.75
{txt}       2312 {c |}{res}          8        0.31       21.07
{txt}       2327 {c |}{res}          8        0.31       21.38
{txt}       3201 {c |}{res}          8        0.31       21.70
{txt}       3202 {c |}{res}          8        0.31       22.01
{txt}       3203 {c |}{res}          8        0.31       22.33
{txt}       3204 {c |}{res}          8        0.31       22.64
{txt}       3205 {c |}{res}          8        0.31       22.96
{txt}       3206 {c |}{res}          8        0.31       23.27
{txt}       3207 {c |}{res}          8        0.31       23.58
{txt}       3209 {c |}{res}          8        0.31       23.90
{txt}       3210 {c |}{res}          8        0.31       24.21
{txt}       3211 {c |}{res}          8        0.31       24.53
{txt}       3212 {c |}{res}          8        0.31       24.84
{txt}       3213 {c |}{res}          8        0.31       25.16
{txt}       3301 {c |}{res}          8        0.31       25.47
{txt}       3302 {c |}{res}          8        0.31       25.79
{txt}       3303 {c |}{res}          8        0.31       26.10
{txt}       3304 {c |}{res}          8        0.31       26.42
{txt}       3305 {c |}{res}          8        0.31       26.73
{txt}       3306 {c |}{res}          8        0.31       27.04
{txt}       3307 {c |}{res}          8        0.31       27.36
{txt}       3308 {c |}{res}          8        0.31       27.67
{txt}       3309 {c |}{res}          8        0.31       27.99
{txt}       3310 {c |}{res}          8        0.31       28.30
{txt}       3311 {c |}{res}          8        0.31       28.62
{txt}       3401 {c |}{res}          8        0.31       28.93
{txt}       3402 {c |}{res}          8        0.31       29.25
{txt}       3403 {c |}{res}          8        0.31       29.56
{txt}       3404 {c |}{res}          8        0.31       29.87
{txt}       3405 {c |}{res}          8        0.31       30.19
{txt}       3406 {c |}{res}          8        0.31       30.50
{txt}       3407 {c |}{res}          8        0.31       30.82
{txt}       3408 {c |}{res}          8        0.31       31.13
{txt}       3410 {c |}{res}          8        0.31       31.45
{txt}       3411 {c |}{res}          8        0.31       31.76
{txt}       3412 {c |}{res}          8        0.31       32.08
{txt}       3413 {c |}{res}          8        0.31       32.39
{txt}       3415 {c |}{res}          8        0.31       32.70
{txt}       3417 {c |}{res}          8        0.31       33.02
{txt}       3418 {c |}{res}          8        0.31       33.33
{txt}       3501 {c |}{res}          8        0.31       33.65
{txt}       3502 {c |}{res}          8        0.31       33.96
{txt}       3503 {c |}{res}          8        0.31       34.28
{txt}       3504 {c |}{res}          8        0.31       34.59
{txt}       3505 {c |}{res}          8        0.31       34.91
{txt}       3506 {c |}{res}          8        0.31       35.22
{txt}       3507 {c |}{res}          8        0.31       35.53
{txt}       3508 {c |}{res}          8        0.31       35.85
{txt}       3509 {c |}{res}          8        0.31       36.16
{txt}       3601 {c |}{res}          8        0.31       36.48
{txt}       3602 {c |}{res}          8        0.31       36.79
{txt}       3603 {c |}{res}          8        0.31       37.11
{txt}       3604 {c |}{res}          8        0.31       37.42
{txt}       3605 {c |}{res}          8        0.31       37.74
{txt}       3606 {c |}{res}          8        0.31       38.05
{txt}       3607 {c |}{res}          8        0.31       38.36
{txt}       3608 {c |}{res}          8        0.31       38.68
{txt}       3609 {c |}{res}          8        0.31       38.99
{txt}       3610 {c |}{res}          8        0.31       39.31
{txt}       3611 {c |}{res}          8        0.31       39.62
{txt}       3701 {c |}{res}          8        0.31       39.94
{txt}       3702 {c |}{res}          8        0.31       40.25
{txt}       3703 {c |}{res}          8        0.31       40.57
{txt}       3704 {c |}{res}          8        0.31       40.88
{txt}       3705 {c |}{res}          8        0.31       41.19
{txt}       3706 {c |}{res}          8        0.31       41.51
{txt}       3707 {c |}{res}          8        0.31       41.82
{txt}       3708 {c |}{res}          8        0.31       42.14
{txt}       3709 {c |}{res}          8        0.31       42.45
{txt}       3710 {c |}{res}          8        0.31       42.77
{txt}       3711 {c |}{res}          8        0.31       43.08
{txt}       3712 {c |}{res}          8        0.31       43.40
{txt}       3713 {c |}{res}          8        0.31       43.71
{txt}       3714 {c |}{res}          8        0.31       44.03
{txt}       3715 {c |}{res}          8        0.31       44.34
{txt}       3716 {c |}{res}          8        0.31       44.65
{txt}       4101 {c |}{res}          8        0.31       44.97
{txt}       4102 {c |}{res}          8        0.31       45.28
{txt}       4103 {c |}{res}          8        0.31       45.60
{txt}       4104 {c |}{res}          8        0.31       45.91
{txt}       4105 {c |}{res}          8        0.31       46.23
{txt}       4106 {c |}{res}          8        0.31       46.54
{txt}       4107 {c |}{res}          8        0.31       46.86
{txt}       4108 {c |}{res}          8        0.31       47.17
{txt}       4109 {c |}{res}          8        0.31       47.48
{txt}       4110 {c |}{res}          8        0.31       47.80
{txt}       4111 {c |}{res}          8        0.31       48.11
{txt}       4112 {c |}{res}          8        0.31       48.43
{txt}       4113 {c |}{res}          8        0.31       48.74
{txt}       4114 {c |}{res}          8        0.31       49.06
{txt}       4115 {c |}{res}          8        0.31       49.37
{txt}       4116 {c |}{res}          8        0.31       49.69
{txt}       4117 {c |}{res}          8        0.31       50.00
{txt}       4201 {c |}{res}          8        0.31       50.31
{txt}       4202 {c |}{res}          8        0.31       50.63
{txt}       4203 {c |}{res}          8        0.31       50.94
{txt}       4205 {c |}{res}          8        0.31       51.26
{txt}       4207 {c |}{res}          8        0.31       51.57
{txt}       4208 {c |}{res}          8        0.31       51.89
{txt}       4209 {c |}{res}          8        0.31       52.20
{txt}       4210 {c |}{res}          8        0.31       52.52
{txt}       4211 {c |}{res}          8        0.31       52.83
{txt}       4212 {c |}{res}          8        0.31       53.14
{txt}       4213 {c |}{res}          8        0.31       53.46
{txt}       4228 {c |}{res}          8        0.31       53.77
{txt}       4301 {c |}{res}          8        0.31       54.09
{txt}       4302 {c |}{res}          8        0.31       54.40
{txt}       4303 {c |}{res}          8        0.31       54.72
{txt}       4304 {c |}{res}          8        0.31       55.03
{txt}       4305 {c |}{res}          8        0.31       55.35
{txt}       4306 {c |}{res}          8        0.31       55.66
{txt}       4307 {c |}{res}          8        0.31       55.97
{txt}       4308 {c |}{res}          8        0.31       56.29
{txt}       4309 {c |}{res}          8        0.31       56.60
{txt}       4310 {c |}{res}          8        0.31       56.92
{txt}       4311 {c |}{res}          8        0.31       57.23
{txt}       4312 {c |}{res}          8        0.31       57.55
{txt}       4313 {c |}{res}          8        0.31       57.86
{txt}       4331 {c |}{res}          8        0.31       58.18
{txt}       4401 {c |}{res}          8        0.31       58.49
{txt}       4402 {c |}{res}          8        0.31       58.81
{txt}       4403 {c |}{res}          8        0.31       59.12
{txt}       4404 {c |}{res}          8        0.31       59.43
{txt}       4405 {c |}{res}          8        0.31       59.75
{txt}       4406 {c |}{res}          8        0.31       60.06
{txt}       4407 {c |}{res}          8        0.31       60.38
{txt}       4408 {c |}{res}          8        0.31       60.69
{txt}       4409 {c |}{res}          8        0.31       61.01
{txt}       4412 {c |}{res}          8        0.31       61.32
{txt}       4413 {c |}{res}          8        0.31       61.64
{txt}       4414 {c |}{res}          8        0.31       61.95
{txt}       4415 {c |}{res}          8        0.31       62.26
{txt}       4416 {c |}{res}          8        0.31       62.58
{txt}       4417 {c |}{res}          8        0.31       62.89
{txt}       4418 {c |}{res}          8        0.31       63.21
{txt}       4419 {c |}{res}          8        0.31       63.52
{txt}       4420 {c |}{res}          8        0.31       63.84
{txt}       4451 {c |}{res}          8        0.31       64.15
{txt}       4452 {c |}{res}          8        0.31       64.47
{txt}       4453 {c |}{res}          8        0.31       64.78
{txt}       4501 {c |}{res}          8        0.31       65.09
{txt}       4502 {c |}{res}          8        0.31       65.41
{txt}       4503 {c |}{res}          8        0.31       65.72
{txt}       4504 {c |}{res}          8        0.31       66.04
{txt}       4505 {c |}{res}          8        0.31       66.35
{txt}       4506 {c |}{res}          8        0.31       66.67
{txt}       4507 {c |}{res}          8        0.31       66.98
{txt}       4508 {c |}{res}          8        0.31       67.30
{txt}       4509 {c |}{res}          8        0.31       67.61
{txt}       4510 {c |}{res}          8        0.31       67.92
{txt}       4511 {c |}{res}          8        0.31       68.24
{txt}       4512 {c |}{res}          8        0.31       68.55
{txt}       4513 {c |}{res}          8        0.31       68.87
{txt}       4514 {c |}{res}          8        0.31       69.18
{txt}       4601 {c |}{res}          8        0.31       69.50
{txt}       4602 {c |}{res}          8        0.31       69.81
{txt}       5101 {c |}{res}          8        0.31       70.13
{txt}       5103 {c |}{res}          8        0.31       70.44
{txt}       5104 {c |}{res}          8        0.31       70.75
{txt}       5105 {c |}{res}          8        0.31       71.07
{txt}       5106 {c |}{res}          8        0.31       71.38
{txt}       5107 {c |}{res}          8        0.31       71.70
{txt}       5108 {c |}{res}          8        0.31       72.01
{txt}       5109 {c |}{res}          8        0.31       72.33
{txt}       5110 {c |}{res}          8        0.31       72.64
{txt}       5111 {c |}{res}          8        0.31       72.96
{txt}       5113 {c |}{res}          8        0.31       73.27
{txt}       5114 {c |}{res}          8        0.31       73.58
{txt}       5115 {c |}{res}          8        0.31       73.90
{txt}       5116 {c |}{res}          8        0.31       74.21
{txt}       5117 {c |}{res}          8        0.31       74.53
{txt}       5118 {c |}{res}          8        0.31       74.84
{txt}       5119 {c |}{res}          8        0.31       75.16
{txt}       5120 {c |}{res}          8        0.31       75.47
{txt}       5132 {c |}{res}          8        0.31       75.79
{txt}       5133 {c |}{res}          8        0.31       76.10
{txt}       5134 {c |}{res}          8        0.31       76.42
{txt}       5201 {c |}{res}          8        0.31       76.73
{txt}       5202 {c |}{res}          8        0.31       77.04
{txt}       5203 {c |}{res}          8        0.31       77.36
{txt}       5204 {c |}{res}          8        0.31       77.67
{txt}       5223 {c |}{res}          8        0.31       77.99
{txt}       5226 {c |}{res}          8        0.31       78.30
{txt}       5227 {c |}{res}          8        0.31       78.62
{txt}       5301 {c |}{res}          8        0.31       78.93
{txt}       5303 {c |}{res}          8        0.31       79.25
{txt}       5304 {c |}{res}          8        0.31       79.56
{txt}       5305 {c |}{res}          8        0.31       79.87
{txt}       5306 {c |}{res}          8        0.31       80.19
{txt}       5307 {c |}{res}          8        0.31       80.50
{txt}       5309 {c |}{res}          8        0.31       80.82
{txt}       5323 {c |}{res}          8        0.31       81.13
{txt}       5325 {c |}{res}          8        0.31       81.45
{txt}       5326 {c |}{res}          8        0.31       81.76
{txt}       5328 {c |}{res}          8        0.31       82.08
{txt}       5329 {c |}{res}          8        0.31       82.39
{txt}       5331 {c |}{res}          8        0.31       82.70
{txt}       5334 {c |}{res}          8        0.31       83.02
{txt}       5401 {c |}{res}          8        0.31       83.33
{txt}       5421 {c |}{res}          8        0.31       83.65
{txt}       5422 {c |}{res}          8        0.31       83.96
{txt}       5424 {c |}{res}          8        0.31       84.28
{txt}       5425 {c |}{res}          8        0.31       84.59
{txt}       5426 {c |}{res}          8        0.31       84.91
{txt}       6101 {c |}{res}          8        0.31       85.22
{txt}       6102 {c |}{res}          8        0.31       85.53
{txt}       6103 {c |}{res}          8        0.31       85.85
{txt}       6104 {c |}{res}          8        0.31       86.16
{txt}       6105 {c |}{res}          8        0.31       86.48
{txt}       6106 {c |}{res}          8        0.31       86.79
{txt}       6107 {c |}{res}          8        0.31       87.11
{txt}       6108 {c |}{res}          8        0.31       87.42
{txt}       6109 {c |}{res}          8        0.31       87.74
{txt}       6110 {c |}{res}          8        0.31       88.05
{txt}       6201 {c |}{res}          8        0.31       88.36
{txt}       6202 {c |}{res}          8        0.31       88.68
{txt}       6203 {c |}{res}          8        0.31       88.99
{txt}       6204 {c |}{res}          8        0.31       89.31
{txt}       6205 {c |}{res}          8        0.31       89.62
{txt}       6206 {c |}{res}          8        0.31       89.94
{txt}       6207 {c |}{res}          8        0.31       90.25
{txt}       6208 {c |}{res}          8        0.31       90.57
{txt}       6209 {c |}{res}          8        0.31       90.88
{txt}       6210 {c |}{res}          8        0.31       91.19
{txt}       6211 {c |}{res}          8        0.31       91.51
{txt}       6212 {c |}{res}          8        0.31       91.82
{txt}       6229 {c |}{res}          8        0.31       92.14
{txt}       6230 {c |}{res}          8        0.31       92.45
{txt}       6301 {c |}{res}          8        0.31       92.77
{txt}       6322 {c |}{res}          8        0.31       93.08
{txt}       6323 {c |}{res}          8        0.31       93.40
{txt}       6325 {c |}{res}          8        0.31       93.71
{txt}       6326 {c |}{res}          8        0.31       94.03
{txt}       6327 {c |}{res}          8        0.31       94.34
{txt}       6401 {c |}{res}          8        0.31       94.65
{txt}       6402 {c |}{res}          8        0.31       94.97
{txt}       6403 {c |}{res}          8        0.31       95.28
{txt}       6404 {c |}{res}          8        0.31       95.60
{txt}       6405 {c |}{res}          8        0.31       95.91
{txt}       6501 {c |}{res}          8        0.31       96.23
{txt}       6502 {c |}{res}          8        0.31       96.54
{txt}       6521 {c |}{res}          8        0.31       96.86
{txt}       6522 {c |}{res}          8        0.31       97.17
{txt}       6523 {c |}{res}          8        0.31       97.48
{txt}       6527 {c |}{res}          8        0.31       97.80
{txt}       6528 {c |}{res}          8        0.31       98.11
{txt}       6529 {c |}{res}          8        0.31       98.43
{txt}       6530 {c |}{res}          8        0.31       98.74
{txt}       6531 {c |}{res}          8        0.31       99.06
{txt}       6532 {c |}{res}          8        0.31       99.37
{txt}       6542 {c |}{res}          8        0.31       99.69
{txt}       6543 {c |}{res}          8        0.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00

     {txt}地区的 {c |}
     行政级 {c |}
    别，1表 {c |}
     示省级 {c |}
    ，2表示 {c |}
     地级市 {c |}
    ，3表示 {c |}
     县级市 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          2 {c |}{res}      2,544      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00

{com}. help label

. label list fa\
{err}value label {bf}fa{sf} not found
{txt}{search r(111):r(111);}

{com}. xtdes

    {txt}pref:  {res}1301{txt}, {res}1302{txt}, ..., {res}6543                             {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(pref*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX

{com}. tab prov

     {txt}省份代 {c |}
         码 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         13 {c |}{res}         88        3.46        3.46
{txt}         14 {c |}{res}         80        3.14        6.60
{txt}         15 {c |}{res}         88        3.46       10.06
{txt}         21 {c |}{res}        112        4.40       14.47
{txt}         22 {c |}{res}         72        2.83       17.30
{txt}         23 {c |}{res}        104        4.09       21.38
{txt}         32 {c |}{res}         96        3.77       25.16
{txt}         33 {c |}{res}         88        3.46       28.62
{txt}         34 {c |}{res}        120        4.72       33.33
{txt}         35 {c |}{res}         72        2.83       36.16
{txt}         36 {c |}{res}         88        3.46       39.62
{txt}         37 {c |}{res}        128        5.03       44.65
{txt}         41 {c |}{res}        136        5.35       50.00
{txt}         42 {c |}{res}         96        3.77       53.77
{txt}         43 {c |}{res}        112        4.40       58.18
{txt}         44 {c |}{res}        168        6.60       64.78
{txt}         45 {c |}{res}        112        4.40       69.18
{txt}         46 {c |}{res}         16        0.63       69.81
{txt}         51 {c |}{res}        168        6.60       76.42
{txt}         52 {c |}{res}         56        2.20       78.62
{txt}         53 {c |}{res}        112        4.40       83.02
{txt}         54 {c |}{res}         48        1.89       84.91
{txt}         61 {c |}{res}         80        3.14       88.05
{txt}         62 {c |}{res}        112        4.40       92.45
{txt}         63 {c |}{res}         48        1.89       94.34
{txt}         64 {c |}{res}         40        1.57       95.91
{txt}         65 {c |}{res}        104        4.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00

{com}. xtgls govsize open, i(code) t(year) panels(hetero) corr(ar1)
{txt}warning: existing panel variable is not code
(note: {res}2{txt} observations dropped because only 1 obs in group)
{err}year is not regularly spaced or does not have intervals of delta -- use 
the force option to treat the intervals as though they were regular
{txt}{search r(459):r(459);}

{com}. xtgls govsize open, i(code) t(year) panels(hetero) corr(ar1) force
{txt}(note: {res}2{txt} observations dropped because only 1 obs in group)

Cross-sectional time-series FGLS regression

Coefficients:  {res}generalized least squares
{txt}Panels:        {res}heteroskedastic
{txt}Correlation:   {res}common AR(1) coefficient for all panels{txt}  ({res}0.9049{txt})

Estimated covariances{col 28}= {res}      315{txt}{col 49}Number of obs{col 67}= {res}     2,361
{txt}Estimated autocorrelations{col 28}= {res}        1{txt}{col 49}Number of groups{col 67}= {res}       315
{txt}Estimated coefficients{col 28}= {res}        2{txt}{col 49}Obs per group:
{col 63}min{col 67}= {res}         3
{txt}{col 63}avg{col 67}=  {res} 7.495238
{txt}{col 63}max{col 67}= {res}         8
{txt}{col 49}Wald chi2({res}1{txt}){col 67}=  {res}    87.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} 9.82e-06{col 26}{space 2} 1.05e-06{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4} 7.76e-06{col 67}{space 3} .0000119
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0587449{col 26}{space 2}  .000749{col 37}{space 1}   78.43{col 46}{space 3}0.000{col 54}{space 4} .0572769{col 67}{space 3} .0602129
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. xtdes

    {txt}code:  {res}130100{txt}, {res}130200{txt}, ..., {res}654300                       {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(code*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX

{com}. xtgls govsize open, i(code) t(year) panels(hetero) corr(ar1) force
{txt}(note: {res}2{txt} observations dropped because only 1 obs in group)

Cross-sectional time-series FGLS regression

Coefficients:  {res}generalized least squares
{txt}Panels:        {res}heteroskedastic
{txt}Correlation:   {res}common AR(1) coefficient for all panels{txt}  ({res}0.9049{txt})

Estimated covariances{col 28}= {res}      315{txt}{col 49}Number of obs{col 67}= {res}     2,361
{txt}Estimated autocorrelations{col 28}= {res}        1{txt}{col 49}Number of groups{col 67}= {res}       315
{txt}Estimated coefficients{col 28}= {res}        2{txt}{col 49}Obs per group:
{col 63}min{col 67}= {res}         3
{txt}{col 63}avg{col 67}=  {res} 7.495238
{txt}{col 63}max{col 67}= {res}         8
{txt}{col 49}Wald chi2({res}1{txt}){col 67}=  {res}    87.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} 9.82e-06{col 26}{space 2} 1.05e-06{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4} 7.76e-06{col 67}{space 3} .0000119
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0587449{col 26}{space 2}  .000749{col 37}{space 1}   78.43{col 46}{space 3}0.000{col 54}{space 4} .0572769{col 67}{space 3} .0602129
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. xttest3

{txt}Modified Wald test for groupwise heteroskedasticity
in cross-sectional time-series FGLS regression model

{res}H0: sigma(i)^2 = sigma^2 for all i

{txt}chi2 (315)  =  {res} 3.8e+05
{txt}Prob>chi2 =    {res}  0.0000


{com}. xtgls govsize open, i(code) t(year) panels(hetero) corr(psar1)
{txt}(note: {res}2{txt} observations dropped because only 1 obs in group)
{err}year is not regularly spaced or does not have intervals of delta -- use 
the force option to treat the intervals as though they were regular
{txt}{search r(459):r(459);}

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtgls govsize open, i(code) t(year) panels(hetero) corr(psar1) force
{txt}(note: {res}2{txt} observations dropped because only 1 obs in group)

Cross-sectional time-series FGLS regression

Coefficients:  {res}generalized least squares
{txt}Panels:        {res}heteroskedastic
{txt}Correlation:   {res}panel-specific AR(1)

{txt}Estimated covariances{col 28}= {res}      315{txt}{col 49}Number of obs{col 67}= {res}     2,361
{txt}Estimated autocorrelations{col 28}= {res}      315{txt}{col 49}Number of groups{col 67}= {res}       315
{txt}Estimated coefficients{col 28}= {res}        2{txt}{col 49}Obs per group:
{col 63}min{col 67}= {res}         3
{txt}{col 63}avg{col 67}=  {res} 7.495238
{txt}{col 63}max{col 67}= {res}         8
{txt}{col 49}Wald chi2({res}1{txt}){col 67}=  {res}   253.88
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000111{col 26}{space 2} 6.98e-07{col 37}{space 1}   15.93{col 46}{space 3}0.000{col 54}{space 4} 9.76e-06{col 67}{space 3} .0000125
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0563792{col 26}{space 2} .0004588{col 37}{space 1}  122.88{col 46}{space 3}0.000{col 54}{space 4}   .05548{col 67}{space 3} .0572784
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
{txt}end of do-file

{com}. xtcd govsize open
{err}unknown function *sqrt()
{txt}{search r(133):r(133);}

{com}. xtcsd govsize open
{err}varlist not allowed
{txt}{search r(101):r(101);}

{com}. xtcsd govsize
{err}varlist not allowed
{txt}{search r(101):r(101);}

{com}. help xtcsd

. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtgls govsize open, i(code) t(year) panels(hetero) corr(ar1) force
{txt}(note: {res}2{txt} observations dropped because only 1 obs in group)

Cross-sectional time-series FGLS regression

Coefficients:  {res}generalized least squares
{txt}Panels:        {res}heteroskedastic
{txt}Correlation:   {res}common AR(1) coefficient for all panels{txt}  ({res}0.9049{txt})

Estimated covariances{col 28}= {res}      315{txt}{col 49}Number of obs{col 67}= {res}     2,361
{txt}Estimated autocorrelations{col 28}= {res}        1{txt}{col 49}Number of groups{col 67}= {res}       315
{txt}Estimated coefficients{col 28}= {res}        2{txt}{col 49}Obs per group:
{col 63}min{col 67}= {res}         3
{txt}{col 63}avg{col 67}=  {res} 7.495238
{txt}{col 63}max{col 67}= {res}         8
{txt}{col 49}Wald chi2({res}1{txt}){col 67}=  {res}    87.68
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} 9.82e-06{col 26}{space 2} 1.05e-06{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4} 7.76e-06{col 67}{space 3} .0000119
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0587449{col 26}{space 2}  .000749{col 37}{space 1}   78.43{col 46}{space 3}0.000{col 54}{space 4} .0572769{col 67}{space 3} .0602129
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
{txt}end of do-file

{com}. xtcsd govsize
{err}varlist not allowed
{txt}{search r(101):r(101);}

{com}. xtcsd open
{err}varlist not allowed
{txt}{search r(101):r(101);}

{com}. xtcsd
{err}last estimates not xtreg
{txt}{search r(301):r(301);}

{com}. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. xtreg govsize open, fe vce(cluster prov)

{txt}Fixed-effects (within) regression               Number of obs      = {res}     2363
{txt}Group variable: {res}code                            {txt}Number of groups   = {res}      317

{txt}R-sq:  within  = {res}0.0085                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.0809                                        {txt}avg = {res}      7.5
{txt}       overall = {res}0.0592                                        {txt}max = {res}        8

                                                {txt}F({res}1{txt},{res}26{txt})            = {res}     3.03
{txt}corr(u_i, Xb)  = {res}-0.0133                        {txt}Prob > F           =    {res}0.0938

{txt}{ralign 78:(Std. Err. adjusted for {res:27} clusters in prov)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     govsize{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}open {c |}{col 14}{res}{space 2} .0000134{col 26}{space 2} 7.72e-06{col 37}{space 1}    1.74{col 46}{space 3}0.094{col 54}{space 4}-2.44e-06{col 67}{space 3} .0000293
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0621569{col 26}{space 2} .0021999{col 37}{space 1}   28.25{col 46}{space 3}0.000{col 54}{space 4} .0576349{col 67}{space 3} .0666788
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .02108373
     {txt}sigma_e {c |} {res} .01672664
         {txt}rho {c |} {res} .61372516{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
{txt}end of do-file

{com}. xtcsd
{err}Method option not specified

{com}. xtcsd, fe
{err}option {bf:fe} not allowed
{txt}{search r(198):r(198);}

{com}. xtcsd, pesaran show
{err}unknown function *sqrt()
{txt}{search r(133):r(133);}

{com}. ssc install xtscd
{txt}{err}ssc install: "xtscd" not found at SSC, type -{cmd:findit xtscd}-
(To find all packages at SSC that start with x, type -{cmd:ssc describe x}-)
{txt}{search r(601):r(601);}

{com}. findit xtscd

. findit xtcsd

. xtcsd, pesaran show
{err}unknown function *sqrt()
{txt}{search r(133):r(133);}

{com}. help xtcsd

. ssc install xtcsd
{txt}checking {hilite:xtcsd} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. sum pop_birth pop_death family gdp_per gdp_index investment num_ind output_ind_state inc_ind miles post_telecom loan_ind comhouse_sales comhouse_sales

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}pop_birth {c |}{res}      2,158    4.476362    3.550213        .06      38.45
{txt}{space 3}pop_death {c |}{res}      2,143    2.311041    1.785941        .02      17.59
{txt}{space 6}family {c |}{res}      2,484    116.8741    74.77018        2.1        483
{txt}{space 5}gdp_per {c |}{res}      2,531     30155.3    23557.43       2755     196728
{txt}{space 3}gdp_index {c |}{res}      2,521    113.1344    3.329225       64.3      132.9
{txt}{hline 13}{c +}{hline 57}
{space 2}investment {c |}{res}      1,746    537.4538    626.8112       6.13    4995.65
{txt}{space 5}num_ind {c |}{res}      2,532    1037.385    1548.225          1      13720
{txt}output_in~te {c |}{res}      1,226    313.1933      463.55        .08    3964.21
{txt}{space 5}inc_ind {c |}{res}        914    316.4994    474.1576         .1     4207.2
{txt}{space 7}miles {c |}{res}      2,432    10843.49    5963.077        563      41000
{txt}{hline 13}{c +}{hline 57}
post_telecom {c |}{res}      1,762    50.82127    78.90156        .26    1051.65
{txt}{space 4}loan_ind {c |}{res}      1,226    93.80847    178.5574          0    1591.78
{txt}comhouse_s~s {c |}{res}        935    181.3137    288.8775         .1       2606
{txt}comhouse_s~s {c |}{res}        935    181.3137    288.8775         .1       2606

{com}. 
. 
. xtdes family
{err}varlist not allowed
{txt}{search r(101):r(101);}

{com}. sum family

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}family {c |}{res}      2,484    116.8741    74.77018        2.1        483

{com}. count if family == .
  {res}60

{com}. br family

. di family[187]
{res}.

{com}. di 317*8
{res}2536

{com}. gen isnull_family = (family==.)

. 
. tab isnull

{txt}isnull_fami {c |}
         ly {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      2,484       97.64       97.64
{txt}          1 {c |}{res}         60        2.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,544      100.00

{com}. xtdes

    {txt}code:  {res}130100{txt}, {res}130200{txt}, ..., {res}654300                       {txt}n ={res}        318
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(code*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      318    100.00        {txt} {c |}  {res}XXXXXXXX

{com}. di 318*8
{res}2544

{com}. tab year isnull_family

           {txt}{c |}     isnull_family
      年份 {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
      2006 {c |}{res}       318          0 {txt}{c |}{res}       318 
{txt}      2007 {c |}{res}       317          1 {txt}{c |}{res}       318 
{txt}      2008 {c |}{res}       296         22 {txt}{c |}{res}       318 
{txt}      2009 {c |}{res}       308         10 {txt}{c |}{res}       318 
{txt}      2010 {c |}{res}       312          6 {txt}{c |}{res}       318 
{txt}      2011 {c |}{res}       312          6 {txt}{c |}{res}       318 
{txt}      2012 {c |}{res}       312          6 {txt}{c |}{res}       318 
{txt}      2013 {c |}{res}       309          9 {txt}{c |}{res}       318 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     2,484         60 {txt}{c |}{res}     2,544 


{com}. tab prov isnull_family

    {txt}省份代 {c |}     isnull_family
        码 {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
        13 {c |}{res}        88          0 {txt}{c |}{res}        88 
{txt}        14 {c |}{res}        80          0 {txt}{c |}{res}        80 
{txt}        15 {c |}{res}        77         11 {txt}{c |}{res}        88 
{txt}        21 {c |}{res}       112          0 {txt}{c |}{res}       112 
{txt}        22 {c |}{res}        71          1 {txt}{c |}{res}        72 
{txt}        23 {c |}{res}       102          2 {txt}{c |}{res}       104 
{txt}        32 {c |}{res}        96          0 {txt}{c |}{res}        96 
{txt}        33 {c |}{res}        87          1 {txt}{c |}{res}        88 
{txt}        34 {c |}{res}       117          3 {txt}{c |}{res}       120 
{txt}        35 {c |}{res}        72          0 {txt}{c |}{res}        72 
{txt}        36 {c |}{res}        88          0 {txt}{c |}{res}        88 
{txt}        37 {c |}{res}       125          3 {txt}{c |}{res}       128 
{txt}        41 {c |}{res}       134          2 {txt}{c |}{res}       136 
{txt}        42 {c |}{res}        94          2 {txt}{c |}{res}        96 
{txt}        43 {c |}{res}       112          0 {txt}{c |}{res}       112 
{txt}        44 {c |}{res}       168          0 {txt}{c |}{res}       168 
{txt}        45 {c |}{res}       112          0 {txt}{c |}{res}       112 
{txt}        46 {c |}{res}        16          0 {txt}{c |}{res}        16 
{txt}        51 {c |}{res}       166          2 {txt}{c |}{res}       168 
{txt}        52 {c |}{res}        55          1 {txt}{c |}{res}        56 
{txt}        53 {c |}{res}       112          0 {txt}{c |}{res}       112 
{txt}        54 {c |}{res}        24         24 {txt}{c |}{res}        48 
{txt}        61 {c |}{res}        79          1 {txt}{c |}{res}        80 
{txt}        62 {c |}{res}       110          2 {txt}{c |}{res}       112 
{txt}        63 {c |}{res}        45          3 {txt}{c |}{res}        48 
{txt}        64 {c |}{res}        40          0 {txt}{c |}{res}        40 
{txt}        65 {c |}{res}       102          2 {txt}{c |}{res}       104 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     2,484         60 {txt}{c |}{res}     2,544 


{com}. br city prov if isnull_family == 0

. br city prov if isnull_family == 1

. br city year prov if isnull_family == 1

. exit, clear
