{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}F:\git\stata\output\31May2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 May 2017, 19:11:37
{txt}
{com}. * -------------------------------------------------------
. 
. 
. 
. 
. /*
> * -------------------------------------------------------
> // Close the log, end the file
> log close
> exit

{txt}end of do-file

{com}. dir
{txt}  <dir>   5/31/17 19:11  {res}.                 
{txt}  <dir>   5/31/17 19:11  {res}..                
{txt}   9.0k   5/31/17 11:40  {res}citycode_2012.do  
{txt}   5.3k   5/31/17 11:13  {res}data_2012(1).do   
{txt}   5.3k   5/31/17 11:13  {res}data_2012.do      
{txt}   0.0k   5/31/17 19:11  {res}logfile.txt       
{txt} 213.0k   5/31/17 17:16  {res}newcitycode.dta   
{txt}   7.5k   5/31/17 17:45  {res}pf01.do           

{com}. doedit pf01.do

. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. *-------------------------------------------------------
. * project: 财政学研究方法，学期论文
. * dofile name: pf01.do
. * May31st, 2017, Version 0.
. * Ren Qingjie, Peking University, renqingjie@pku.edu.cn
. *-------------------------------------------------------
. 
. *-------------------------------------------------------
. * Program Setup
. *-------------------------------------------------------
. 
. version 14              // Set Version number for backward compatibility
{txt}
{com}. set more off            // Disable partitioned output
{txt}
{com}. clear all               // Start with a clean slate
{txt}
{com}. set linesize 80         // Line size limit to make output more readable
{txt}
{com}. *set matsize 5000               // Set Workspace 
.                                                 // Set Work Directory
. 
. global root "F:\git\stata"
{txt}
{com}. cap noi mkdir ${c -(}root{c )-}\output
{err}could not create directory F:\git\stata\output
{txt}
{com}. global output = "${c -(}root{c )-}\output\"
{txt}
{com}. 
. cd ${c -(}output{c )-}
{res}F:\git\stata\output
{txt}
{com}. local D = c(current_date)
{txt}
{com}. global D = subinstr("`D'"," ","",.)
{txt}
{com}. cap noi mkdir "$D"
{err}could not create directory 31May2017
{txt}
{com}. global today = "${c -(}output{c )-}\${c -(}D{c )-}"
{txt}
{com}. cd $today
{res}F:\git\stata\output\31May2017
{txt}
{com}. 
. /*
> macro drop _all         // clear all macros
> capture log close       // Close existing log files
> log using logfile.txt, replace       // Open log file
> * -------------------------------------------------------
> */
. 
. 
. 
. 
. ****** 清理数据
. 
. *** 处理地区编码
. ** 导入地区编码的数据
. clear
{txt}
{com}. cd "F:\data\pf\统一的编码文件"
{res}F:\data\pf\统一的编码文件
{txt}
{com}. unicode analyze citycode_0.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate citycode_0.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. ** 导入数据
. cd $today
{res}F:\git\stata\output\31May2017
{txt}
{com}. use "F:\data\pf\统一的编码文件\citycode_0.dta", clear
{txt}
{com}. * 删除重复项，包括“县”，“市辖区”等
. duplicates drop city1, force

{p 0 4}{txt}Duplicates in terms of {res} city1{p_end}

{txt}(331 observations deleted)

{com}. rename city city_shortname
{res}{txt}
{com}. rename city1 city
{res}{txt}
{com}. save newcitycode.dta, replace
{txt}file newcitycode.dta saved

{com}. 
. 
. ****** 导入数据
. 
. *** 数据编码方式修改
. clear
{txt}
{com}. cd "F:\data\pf\"
{res}F:\data\pf
{txt}
{com}. unicode analyze city_quyu.dta
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. unicode encoding set gb18030
{res}{txt}  (default encoding now gb18030)

{com}. unicode translate city_quyu.dta
{txt}  (using gb18030 encoding)
{res}{txt}
  File summary (before starting):
        1  file(s) specified
        1  file(s) already translated        in previous runs
        0  file(s) to be examined ...
  (nothing to do)

{com}. *** 导入数据
. cd $today
{res}F:\git\stata\output\31May2017
{txt}
{com}. use "F:\data\pf\city_quyu.dta", clear
{txt}
{com}. 
. *** 处理原数据
. * 将城市名称统一
. replace city=ustrregexs(1) if ustrregexm(city,"^.*?([\u4e00-\u9fa5]+).*$")
{txt}(897 real changes made)

{com}. * 重命名变量名 (非常长，大约100行)
. rename q1_1             land                    //土地面积
{res}{txt}
{com}. rename q1_3             pop                             //年底总人口
{res}{txt}
{com}. rename q1_3_1   pop_male                //男
{res}{txt}
{com}. rename q1_3_2   pop_female              //女
{res}{txt}
{com}. rename q1_3_3   pop_birth               //出生人口
{res}{txt}
{com}. rename q1_3_4   pop_death               //死亡人口
{res}{txt}
{com}. rename q1_4             family                  //年底总户数
{res}{txt}
{com}. rename q2_1             gdp                             //地区生产总值
{res}{txt}
{com}. rename q2_2             gdp_pri                 //第一产业地区生产总值
{res}{txt}
{com}. rename q2_3             gdp_sec                 //第二产业地区生产总值
{res}{txt}
{com}. rename q2_4             gdp_ind                 //工业生产总值
{res}{txt}
{com}. rename q2_5             gdp_thi                 //第三产业地区生产总值
{res}{txt}
{com}. rename q2_6             gdp_per                 //人均地区生产总值
{res}{txt}
{com}. rename q3_1     gdp_index               //地区生产总值指数
{res}{txt}
{com}. rename q3_2             gdp_index_pri   //第一产业地区生产总值指数
{res}{txt}
{com}. rename q3_3     gdp_index_sec
{res}{txt}
{com}. rename q3_4             gdp_index_ind
{res}{txt}
{com}. rename q3_5             gdp_index_thi
{res}{txt}
{com}. rename q3_6             gdp_index_per
{res}{txt}
{com}. rename q4_0             investment                              //全社会固定资产投资
{res}{txt}
{com}. rename q4_1             investment_urban                //不含农户
{res}{txt}
{com}. rename q4_2             investment_realestate   //房地产开发投资
{res}{txt}
{com}. rename q4_2_1   investment_rural                //农村投资
{res}{txt}
{com}. rename q6_1             fisrev                                  //公共预算收入
{res}{txt}
{com}. rename q6_2             fisrev_tax                              //税收收入
{res}{txt}
{com}. rename q6_3             fisrev_tax_vat                  //增值税
{res}{txt}
{com}. rename q6_4             fisrev_tax_op                   //营业税
{res}{txt}
{com}. rename q6_5             fisrev_tax_firm                 //企业所得税
{res}{txt}
{com}. rename q6_6             fisrev_tax_person               //个人所得税
{res}{txt}
{com}. rename q7_1             fisexp                                  //公共财政预算支出
{res}{txt}
{com}. rename q7_2             fisexp_edu                              //教育
{res}{txt}
{com}. rename q7_3     fisexp_security                 //社会保障和就业
{res}{txt}
{com}. rename q8_1             income_rural                    //农村居民人均可支配收入
{res}{txt}
{com}. rename q8_2             expend_rural                    //农村居民人均消费支出
{res}{txt}
{com}. rename q8_3             expend_rural_food               //食品支出
{res}{txt}
{com}. rename q8_4             income_urban                    //城镇居民人均可支配收入
{res}{txt}
{com}. rename q8_5             expend_urban                    //城镇居民人均消费支出
{res}{txt}
{com}. rename q8_6             expend_urban_food               //食品支出
{res}{txt}
{com}. rename q9_1             num_ind                                 //规模以上工业企业单位数
{res}{txt}
{com}. rename q9_1_1   num_ind_large                   //大型企业数量
{res}{txt}
{com}. rename q9_1_2   num_ind_medium                  //中型企业
{res}{txt}
{com}. rename q9_1_3   num_ind_small                   //小型企业
{res}{txt}
{com}. rename q9_0             output_ind                              //工业总产值
{res}{txt}
{com}. rename q9_0_4_2 output_ind_state                //国有及国有控股
{res}{txt}
{com}. rename q9_0_5   output_ind_domestic             //内资企业
{res}{txt}
{com}. rename q9_0_6   output_ind_hmt          //港澳台投资企业
{res}{txt}
{com}. rename q9_0_7   output_ind_frn          //外商投资企业
{res}{txt}
{com}. rename q9_2_1   inc_ind                         //工业企业增加值
{res}{txt}
{com}. rename q9_2_2   index_inc_ind           //工业企业增加值指数
{res}{txt}
{com}. rename q9_2             asset                           //资产合计
{res}{txt}
{com}. rename q9_3             debt                            //负债合计
{res}{txt}
{com}. rename q9_5             revenue                         //主营业务收入
{res}{txt}
{com}. rename q9_7             profit                          //利润总额
{res}{txt}
{com}. rename q10_1    miles                           //公路里程
{res}{txt}
{com}. rename q10_2    miles_grade                     //等级公路
{res}{txt}
{com}. rename q10_3    veh_civil                       //民用汽车
{res}{txt}
{com}. rename q10_4    veh_private                     //私人汽车
{res}{txt}
{com}. rename q11_0    post_telecom            //邮电业务总量
{res}{txt}
{com}. rename q11_2    telecom                         //电信业务总量
{res}{txt}
{com}. rename q11_3    landline                        //固定电话用户
{res}{txt}
{com}. rename q11_4    mobile                          //移动电话用户
{res}{txt}
{com}. rename q5_1             im_ex_port                      //货物进出口总额
{res}{txt}
{com}. rename q5_2             import                          //进口额
{res}{txt}
{com}. rename q5_3             export                          //出口额
{res}{txt}
{com}. rename q5_4             fdi                                     //外商直接投资实际使用额
{res}{txt}
{com}. rename q12_2    savings                         //金融机构人民币存款
{res}{txt}
{com}. rename q12_2_3  savings_firm            //企业存款
{res}{txt}
{com}. rename q12_2_4  savings_resident        //居民储蓄存款
{res}{txt}
{com}. rename q12_2_5  savings_fixed           //定期存款
{res}{txt}
{com}. rename q12_5    loan                            //金融机构人民币贷款
{res}{txt}
{com}. rename q12_5_2  loan_ind                        //工业贷款
{res}{txt}
{com}. rename q12_5_3  loan_busi                       //商业贷款
{res}{txt}
{com}. rename q12_5_4  loan_agri                       //农业贷款
{res}{txt}
{com}. rename q7_5             fisexp_agri                     //农林水利事务财政支出
{res}{txt}
{com}. rename q7_4             fisexp_health           //医疗卫生
{res}{txt}
{com}. rename q8_7             house_rural                     //农村人均住房面积
{res}{txt}
{com}. rename q9_1_5   num_ind_dom                     //内资企业个数
{res}{txt}
{com}. rename q9_1_6   num_ind_hmt                     //港澳台投资企业个数
{res}{txt}
{com}. rename q9_1_7   num_ind_frn                     //外商投资企业
{res}{txt}
{com}. rename q9_0_3   output_ind_large        //大型企业工业总产值
{res}{txt}
{com}. rename q9_0_4   output_ind_medium       //中型企业工业总产值
{res}{txt}
{com}. rename q9_0_4_1 output_ind_small        //小型企业工业总产值
{res}{txt}
{com}. rename q9_4             total_equity            //所有者权益
{res}{txt}
{com}. rename q9_8             total_vat                       //本年应交增值税
{res}{txt}
{com}. rename q9_9             num_employee            //从业人员年平均人数
{res}{txt}
{com}. rename q11_5    internet                        //互联网宽带接入用户数
{res}{txt}
{com}. rename q1_2             pop_per                         //常住人口
{res}{txt}
{com}. rename q9_0_1   output_ind_light        //轻工业
{res}{txt}
{com}. rename q9_0_2   output_ind_heavy        //重工业
{res}{txt}
{com}. rename q12_1    savings_rmbfrn          //金融机构本外币存款
{res}{txt}
{com}. rename q12_2_6  savings_cur                     //活期存款
{res}{txt}
{com}. rename q12_4    loan_rmbfrn                     //金融机构本外币贷款
{res}{txt}
{com}. rename q12_6    loan_short                      //短期贷款
{res}{txt}
{com}. rename q12_7    loan_long                       //中长期贷款
{res}{txt}
{com}. rename q12_7_1  loan_frn                        //境外贷款
{res}{txt}
{com}. rename q4_3             comhouse_sales          //商品房销售额
{res}{txt}
{com}. rename q4_4             house_sales                     //住宅销售额
{res}{txt}
{com}. rename q4_5             comhouse_sales_area     //商品房销售面积
{res}{txt}
{com}. rename q4_6             house_sales_area        //住宅销售面积
{res}{txt}
{com}. rename q8_8             house_area_urban        //城市人均住房面积
{res}{txt}
{com}. rename q11_1    post                            //邮电业务总量
{res}{txt}
{com}. rename q12_2_1  savings_danwei          //单位存款
{res}{txt}
{com}. rename q12_2_2  savings_geren           //个人存款
{res}{txt}
{com}. rename q12_3    savings_deposit         //储蓄存款
{res}{txt}
{com}. rename q7_6             house_security          //住房保障
{res}{txt}
{com}. rename q9_6             cost                            //主营业务成本  //终于结束了$-$
{res}{txt}
{com}. 
. * 转字符型变量为数值型
. foreach var of varlist gdp-cost{c -(}
{txt}  2{com}.         destring `var', replace force
{txt}  3{com}. {c )-}
{txt}gdp contains nonnumeric characters; gdp {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_pri contains nonnumeric characters; gdp_pri {res}replaced {txt}as {res}double
{txt}(448 missing values generated)
{res}{txt}gdp_sec contains nonnumeric characters; gdp_sec {res}replaced {txt}as {res}double
{txt}(360 missing values generated)
{res}{txt}gdp_ind contains nonnumeric characters; gdp_ind {res}replaced {txt}as {res}double
{txt}(374 missing values generated)
{res}{txt}gdp_thi contains nonnumeric characters; gdp_thi {res}replaced {txt}as {res}double
{txt}(355 missing values generated)
{res}{txt}gdp_per contains nonnumeric characters; gdp_per {res}replaced {txt}as {res}double
{txt}(623 missing values generated)
{res}{txt}gdp_index contains nonnumeric characters; gdp_index {res}replaced {txt}as {res}double
{txt}(510 missing values generated)
{res}{txt}gdp_index_pri contains nonnumeric characters; gdp_index_pri {res}replaced {txt}as {res}double
{txt}(555 missing values generated)
{res}{txt}gdp_index_sec contains nonnumeric characters; gdp_index_sec {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_ind contains nonnumeric characters; gdp_index_ind {res}replaced {txt}as {res}double
{txt}(511 missing values generated)
{res}{txt}gdp_index_thi contains nonnumeric characters; gdp_index_thi {res}replaced {txt}as {res}double
{txt}(503 missing values generated)
{res}{txt}gdp_index_per contains nonnumeric characters; gdp_index_per {res}replaced {txt}as {res}double
{txt}(660 missing values generated)
{res}{txt}investment contains nonnumeric characters; investment {res}replaced {txt}as {res}double
{txt}(1174 missing values generated)
{res}{txt}investment_urban contains nonnumeric characters; investment_urban {res}replaced {txt}as {res}double
{txt}(188 missing values generated)
{res}{txt}investment_realestate contains nonnumeric characters; investment_realestate {res}replaced {txt}as {res}double
{txt}(246 missing values generated)
{res}{txt}investment_rural contains nonnumeric characters; investment_rural {res}replaced {txt}as {res}double
{txt}(1677 missing values generated)
{res}{txt}fisrev contains nonnumeric characters; fisrev {res}replaced {txt}as {res}double
{txt}(266 missing values generated)
{res}{txt}fisrev_tax contains nonnumeric characters; fisrev_tax {res}replaced {txt}as {res}double
{txt}(298 missing values generated)
{res}{txt}fisrev_tax_vat contains nonnumeric characters; fisrev_tax_vat {res}replaced {txt}as {res}double
{txt}(291 missing values generated)
{res}{txt}fisrev_tax_op contains nonnumeric characters; fisrev_tax_op {res}replaced {txt}as {res}double
{txt}(290 missing values generated)
{res}{txt}fisrev_tax_firm contains nonnumeric characters; fisrev_tax_firm {res}replaced {txt}as {res}double
{txt}(330 missing values generated)
{res}{txt}fisrev_tax_person contains nonnumeric characters; fisrev_tax_person {res}replaced {txt}as {res}double
{txt}(486 missing values generated)
{res}{txt}fisexp contains nonnumeric characters; fisexp {res}replaced {txt}as {res}double
{txt}(265 missing values generated)
{res}{txt}fisexp_edu contains nonnumeric characters; fisexp_edu {res}replaced {txt}as {res}double
{txt}(286 missing values generated)
{res}{txt}fisexp_security contains nonnumeric characters; fisexp_security {res}replaced {txt}as {res}double
{txt}(300 missing values generated)
{res}{txt}income_rural contains nonnumeric characters; income_rural {res}replaced {txt}as {res}double
{txt}(485 missing values generated)
{res}{txt}expend_rural contains nonnumeric characters; expend_rural {res}replaced {txt}as {res}double
{txt}(666 missing values generated)
{res}{txt}expend_rural_food contains nonnumeric characters; expend_rural_food {res}replaced {txt}as {res}double
{txt}(735 missing values generated)
{res}{txt}income_urban contains nonnumeric characters; income_urban {res}replaced {txt}as {res}double
{txt}(529 missing values generated)
{res}{txt}expend_urban contains nonnumeric characters; expend_urban {res}replaced {txt}as {res}double
{txt}(689 missing values generated)
{res}{txt}expend_urban_food contains nonnumeric characters; expend_urban_food {res}replaced {txt}as {res}double
{txt}(748 missing values generated)
{res}{txt}num_ind contains nonnumeric characters; num_ind {res}replaced {txt}as {res}long
{txt}(157 missing values generated)
{res}{txt}num_ind_large contains nonnumeric characters; num_ind_large {res}replaced {txt}as {res}int
{txt}(2205 missing values generated)
{res}{txt}num_ind_medium contains nonnumeric characters; num_ind_medium {res}replaced {txt}as {res}int
{txt}(1932 missing values generated)
{res}{txt}num_ind_small contains nonnumeric characters; num_ind_small {res}replaced {txt}as {res}long
{txt}(1884 missing values generated)
{res}{txt}output_ind contains nonnumeric characters; output_ind {res}replaced {txt}as {res}double
{txt}(993 missing values generated)
{res}{txt}output_ind_state contains nonnumeric characters; output_ind_state {res}replaced {txt}as {res}double
{txt}(1928 missing values generated)
{res}{txt}output_ind_domestic contains nonnumeric characters; output_ind_domestic {res}replaced {txt}as {res}double
{txt}(1057 missing values generated)
{res}{txt}output_ind_hmt contains nonnumeric characters; output_ind_hmt {res}replaced {txt}as {res}double
{txt}(1351 missing values generated)
{res}{txt}output_ind_frn contains nonnumeric characters; output_ind_frn {res}replaced {txt}as {res}double
{txt}(1328 missing values generated)
{res}{txt}inc_ind contains nonnumeric characters; inc_ind {res}replaced {txt}as {res}double
{txt}(2393 missing values generated)
{res}{txt}index_inc_ind contains nonnumeric characters; index_inc_ind {res}replaced {txt}as {res}double
{txt}(2584 missing values generated)
{res}{txt}asset contains nonnumeric characters; asset {res}replaced {txt}as {res}double
{txt}(584 missing values generated)
{res}{txt}debt contains nonnumeric characters; debt {res}replaced {txt}as {res}double
{txt}(579 missing values generated)
{res}{txt}revenue contains nonnumeric characters; revenue {res}replaced {txt}as {res}double
{txt}(585 missing values generated)
{res}{txt}profit contains nonnumeric characters; profit {res}replaced {txt}as {res}double
{txt}(602 missing values generated)
{res}{txt}miles contains nonnumeric characters; miles {res}replaced {txt}as {res}double
{txt}(674 missing values generated)
{res}{txt}miles_grade contains nonnumeric characters; miles_grade {res}replaced {txt}as {res}double
{txt}(708 missing values generated)
{res}{txt}veh_civil contains nonnumeric characters; veh_civil {res}replaced {txt}as {res}long
{txt}(846 missing values generated)
{res}{txt}veh_private contains nonnumeric characters; veh_private {res}replaced {txt}as {res}long
{txt}(899 missing values generated)
{res}{txt}post_telecom contains nonnumeric characters; post_telecom {res}replaced {txt}as {res}double
{txt}(1555 missing values generated)
{res}{txt}telecom contains nonnumeric characters; telecom {res}replaced {txt}as {res}double
{txt}(1559 missing values generated)
{res}{txt}landline contains nonnumeric characters; landline {res}replaced {txt}as {res}double
{txt}(916 missing values generated)
{res}{txt}mobile contains nonnumeric characters; mobile {res}replaced {txt}as {res}double
{txt}(933 missing values generated)
{res}{txt}im_ex_port contains nonnumeric characters; im_ex_port {res}replaced {txt}as {res}double
{txt}(557 missing values generated)
{res}{txt}import contains nonnumeric characters; import {res}replaced {txt}as {res}double
{txt}(646 missing values generated)
{res}{txt}export contains nonnumeric characters; export {res}replaced {txt}as {res}double
{txt}(565 missing values generated)
{res}{txt}fdi contains nonnumeric characters; fdi {res}replaced {txt}as {res}double
{txt}(740 missing values generated)
{res}{txt}savings contains nonnumeric characters; savings {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}savings_firm contains nonnumeric characters; savings_firm {res}replaced {txt}as {res}double
{txt}(1572 missing values generated)
{res}{txt}savings_resident contains nonnumeric characters; savings_resident {res}replaced {txt}as {res}double
{txt}(1556 missing values generated)
{res}{txt}savings_fixed contains nonnumeric characters; savings_fixed {res}replaced {txt}as {res}double
{txt}(1577 missing values generated)
{res}{txt}loan contains nonnumeric characters; loan {res}replaced {txt}as {res}double
{txt}(350 missing values generated)
{res}{txt}loan_ind contains nonnumeric characters; loan_ind {res}replaced {txt}as {res}double
{txt}(2030 missing values generated)
{res}{txt}loan_busi contains nonnumeric characters; loan_busi {res}replaced {txt}as {res}double
{txt}(2019 missing values generated)
{res}{txt}loan_agri contains nonnumeric characters; loan_agri {res}replaced {txt}as {res}double
{txt}(2021 missing values generated)
{res}{txt}fisexp_agri contains nonnumeric characters; fisexp_agri {res}replaced {txt}as {res}double
{txt}(802 missing values generated)
{res}{txt}fisexp_health contains nonnumeric characters; fisexp_health {res}replaced {txt}as {res}double
{txt}(720 missing values generated)
{res}{txt}house_rural contains nonnumeric characters; house_rural {res}replaced {txt}as {res}double
{txt}(1135 missing values generated)
{res}{txt}q9_1_4 contains nonnumeric characters; q9_1_4 {res}replaced {txt}as {res}int
{txt}(3227 missing values generated)
{res}{txt}num_ind_dom contains nonnumeric characters; num_ind_dom {res}replaced {txt}as {res}long
{txt}(3228 missing values generated)
{res}{txt}num_ind_hmt contains nonnumeric characters; num_ind_hmt {res}replaced {txt}as {res}int
{txt}(3273 missing values generated)
{res}{txt}num_ind_frn contains nonnumeric characters; num_ind_frn {res}replaced {txt}as {res}int
{txt}(3280 missing values generated)
{res}{txt}output_ind_large contains nonnumeric characters; output_ind_large {res}replaced {txt}as {res}double
{txt}(2513 missing values generated)
{res}{txt}output_ind_medium contains nonnumeric characters; output_ind_medium {res}replaced {txt}as {res}double
{txt}(2392 missing values generated)
{res}{txt}output_ind_small contains nonnumeric characters; output_ind_small {res}replaced {txt}as {res}double
{txt}(2785 missing values generated)
{res}{txt}total_equity contains nonnumeric characters; total_equity {res}replaced {txt}as {res}double
{txt}(1920 missing values generated)
{res}{txt}total_vat contains nonnumeric characters; total_vat {res}replaced {txt}as {res}double
{txt}(1931 missing values generated)
{res}{txt}num_employee contains nonnumeric characters; num_employee {res}replaced {txt}as {res}double
{txt}(2756 missing values generated)
{res}{txt}internet contains nonnumeric characters; internet {res}replaced {txt}as {res}double
{txt}(2083 missing values generated)
{res}{txt}pop_per contains nonnumeric characters; pop_per {res}replaced {txt}as {res}double
{txt}(2047 missing values generated)
{res}{txt}output_ind_light contains nonnumeric characters; output_ind_light {res}replaced {txt}as {res}double
{txt}(2804 missing values generated)
{res}{txt}output_ind_heavy contains nonnumeric characters; output_ind_heavy {res}replaced {txt}as {res}double
{txt}(2793 missing values generated)
{res}{txt}savings_rmbfrn contains nonnumeric characters; savings_rmbfrn {res}replaced {txt}as {res}double
{txt}(2246 missing values generated)
{res}{txt}savings_cur contains nonnumeric characters; savings_cur {res}replaced {txt}as {res}double
{txt}(3257 missing values generated)
{res}{txt}loan_rmbfrn contains nonnumeric characters; loan_rmbfrn {res}replaced {txt}as {res}double
{txt}(2249 missing values generated)
{res}{txt}q12_5_1 contains nonnumeric characters; q12_5_1 {res}replaced {txt}as {res}double
{txt}(2483 missing values generated)
{res}{txt}loan_short contains nonnumeric characters; loan_short {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_long contains nonnumeric characters; loan_long {res}replaced {txt}as {res}double
{txt}(2056 missing values generated)
{res}{txt}loan_frn contains nonnumeric characters; loan_frn {res}replaced {txt}as {res}double
{txt}(3127 missing values generated)
{res}{txt}comhouse_sales contains nonnumeric characters; comhouse_sales {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales contains nonnumeric characters; house_sales {res}replaced {txt}as {res}double
{txt}(2432 missing values generated)
{res}{txt}comhouse_sales_area contains nonnumeric characters; comhouse_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_sales_area contains nonnumeric characters; house_sales_area {res}replaced {txt}as {res}double
{txt}(2431 missing values generated)
{res}{txt}house_area_urban contains nonnumeric characters; house_area_urban {res}replaced {txt}as {res}double
{txt}(2745 missing values generated)
{res}{txt}post contains nonnumeric characters; post {res}replaced {txt}as {res}double
{txt}(2637 missing values generated)
{res}{txt}savings_danwei contains nonnumeric characters; savings_danwei {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_geren contains nonnumeric characters; savings_geren {res}replaced {txt}as {res}double
{txt}(3300 missing values generated)
{res}{txt}savings_deposit contains nonnumeric characters; savings_deposit {res}replaced {txt}as {res}double
{txt}(2898 missing values generated)
{res}{txt}house_security contains nonnumeric characters; house_security {res}replaced {txt}as {res}double
{txt}(3283 missing values generated)
{res}{txt}cost contains nonnumeric characters; cost {res}replaced {txt}as {res}double
{txt}(3264 missing values generated)
{res}{txt}
{com}. 
. 
. *** 和地区编码合并，便于进一步处理数据（比如施加省份的固定效应）
. /*
> ** 导入地区编码的数据
> clear
> cd "F:\data\pf\统一的编码文件"
> unicode analyze citycode_0.dta
> unicode encoding set gb18030
> unicode translate citycode_0.dta
> *** 导入数据
> cd $today
> use "F:\data\pf\统一的编码文件\citycode_0.dta", clear
> * 删除重复项，包括“县”，“市辖区”等
> duplicates drop city1, force
> rename city city_shortname
> rename city1 city
> save newcitycode.dta, replace
> */
. *** 合并数据
. merge m:1 city using newcitycode.dta
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           2,943
{txt}{col 9}from master{col 30}{res}             206{txt}  (_merge==1)
{col 9}from using{col 30}{res}           2,737{txt}  (_merge==2)

{col 5}matched{col 30}{res}           3,472{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. 
. * 处理成为平衡面板
. drop if city=="其他"
{txt}(61 observations deleted)

{com}. encode city, gen(cit)
{txt}
{com}. tsset cit year
{res}{txt}{col 8}panel variable:  {res}cit (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2006 to 2013, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtbalance, range(2006 2013)

{txt}({res}2737{txt} observations deleted due to out of range) 

({res}281{txt} observations deleted due to discontinues) 

{com}. 
. 
. 
. 
. /*
> * -------------------------------------------------------
> // Close the log, end the file
> 
> log close
> exit

{txt}end of do-file

{com}. xtdes

     {txt}cit:  {res}2{txt}, {res}10{txt}, ..., {res}3237                                  {txt}n ={res}        417
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(cit*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      417    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      417    100.00        {txt} {c |}  {res}XXXXXXXX

{com}. label list
{txt}_merge:
{res}           1 master only (1)
           2 using only (2)
           3 matched (3)
           4 missing updated (4)
           5 nonmissing conflict (5)
{txt}cit:
{res}           1 丁青县
           2 七台河市
           3 七星关区
           4 七星区
           5 七里河区
           6 万全县
           7 万宁市
           8 万安县
           9 万山区
          10 万州区
          11 万年县
          12 万柏林区
          13 万源市
          14 万盛区
          15 万秀区
          16 万荣县
          17 万载县
          18 三亚市
          19 三元区
          20 三原县
          21 三台县
          22 三山区
          23 三明市
          24 三水区
          25 三江侗族自治县
          26 三沙市
          27 三河市
          28 三穗县
          29 三都水族自治县
          30 三门县
          31 三门峡市
          32 上城区
          33 上思县
          34 上杭县
          35 上林县
          36 上栗县
          37 上海市
          38 上犹县
          39 上甘岭区
          40 上蔡县
          41 上虞区
          42 上街区
          43 上饶县
          44 上饶市
          45 上高县
          46 下城区
          47 下花园区
          48 下陆区
          49 且末县
          50 丘北县
          51 丛台区
          52 东丰县
          53 东丽区
          54 东乌珠穆沁旗
          55 东乡县
          56 东乡族自治县
          57 东光县
          58 东兰县
          59 东兴区
          60 东兴市
          61 东区
          62 东台市
          63 东坡区
          64 东城区
          65 东宁县
          66 东安区
          67 东安县
          68 东宝区
          69 东山区
          70 东山县
          71 东川区
          72 东平县
          73 东方市
          74 东昌区
          75 东昌府区
          76 东明县
          77 东河区
          78 东洲区
          79 东海县
          80 东港区
          81 东港市
          82 东湖区
          83 东源县
          84 东胜区
          85 东至县
          86 东莞市
          87 东营区
          88 东营市
          89 东西湖区
          90 东辽县
          91 东阳市
          92 东阿县
          93 东风区
          94 两城区
          95 两宁市
          96 两当县
          97 个旧市
          98 中卫市
          99 中原区
         100 中宁县
         101 中山区
         102 中山市
         103 中方县
         104 中江县
         105 中牟县
         106 中站区
         107 中阳县
         108 丰南区
         109 丰县
         110 丰台区
         111 丰城市
         112 丰宁满族自治县
         113 丰泽区
         114 丰润区
         115 丰满区
         116 丰都县
         117 丰镇市
         118 丰顺县
         119 临县
         120 临城县
         121 临夏县
         122 临夏回族自治州
         123 临夏市
         124 临安市
         125 临川区
         126 临朐县
         127 临桂区
         128 临武县
         129 临江市
         130 临汾市
         131 临沂市
         132 临沧市
         133 临沭县
         134 临河区
         135 临泉县
         136 临泽县
         137 临洮县
         138 临海市
         139 临淄区
         140 临清市
         141 临渭区
         142 临湘市
         143 临漳县
         144 临潭县
         145 临潼区
         146 临澧县
         147 临猗县
         148 临翔区
         149 临西县
         150 临邑县
         151 临颍县
         152 临高县
         153 丹东市
         154 丹凤县
         155 丹寨县
         156 丹山市
         157 丹巴县
         158 丹徒区
         159 丹棱县
         160 丹江口市
         161 丹阳市
         162 丽水市
         163 丽江市
         164 乃东县
         165 久治县
         166 义乌市
         167 义县
         168 义马市
         169 乌什县
         170 乌伊岭区
         171 乌兰县
         172 乌兰察布市
         173 乌兰浩特市
         174 乌审旗
         175 乌尔禾区
         176 乌当区
         177 乌恰县
         178 乌拉特中旗
         179 乌拉特前旗
         180 乌拉特后旗
         181 乌海市
         182 乌苏市
         183 乌达区
         184 乌马河区
         185 乌鲁木齐县
         186 乌鲁木齐市
         187 乐业县
         188 乐东黎族自治县
         189 乐亭县
         190 乐安县
         191 乐山市
         192 乐平市
         193 乐昌市
         194 乐清市
         195 乐至县
         196 乐都区
         197 乐陵市
         198 九原区
         199 九台区
         200 九寨沟县
         201 九江县
         202 九江市
         203 九龙县
         204 九龙坡区
         205 习水县
         206 乡城县
         207 乡宁县
         208 乳山市
         209 乳源瑶族自治县
         210 乾县
         211 乾安县
         212 二七区
         213 二连浩特市
         214 二道区
         215 二道江区
         216 于洪区
         217 于田县
         218 于都县
         219 云南省
         220 云县
         221 云和县
         222 云城区
         223 云安区
         224 云岩区
         225 云梦县
         226 云浮市
         227 云溪区
         228 云阳县
         229 云霄县
         230 云龙区
         231 云龙县
         232 互助土族自治县
         233 五华区
         234 五华县
         235 五原县
         236 五台县
         237 五大连池市
         238 五家渠市
         239 五寨县
         240 五峰土家族自治县
         241 五常市
         242 五指山市
         243 五河县
         244 五莲县
         245 五营区
         246 五通桥区
         247 井冈山市
         248 井研县
         249 井陉县
         250 井陉矿区
         251 亚东县
         252 交口县
         253 交城县
         254 京口区
         255 京山县
         256 亭湖区
         257 亳州市
         258 什邡市
         259 仁化县
         260 仁和区
         261 仁寿县
         262 仁布县
         263 仁怀市
         264 介休市
         265 从化区
         266 从江县
         267 仓山区
         268 仙居县
         269 仙桃市
         270 仙游县
         271 代县
         272 仪征市
         273 仪陇县
         274 仲巴县
         275 任丘市
         276 任县
         277 任城区
         278 伊吾县
         279 伊宁县
         280 伊宁市
         281 伊川县
         282 伊春区
         283 伊春市
         284 伊犁哈萨克自治州
         285 伊犁哈萨克自洽州
         286 伊通满族自治县
         287 伊金霍洛旗
         288 伍家岗区
         289 休宁县
         290 会东县
         291 会同县
         292 会宁县
         293 会昌县
         294 会泽县
         295 会理县
         296 伽师县
         297 余姚市
         298 余干县
         299 余庆县
         300 余杭区
         301 余江县
         302 佛冈县
         303 佛坪县
         304 佛山市
         305 佳县
         306 佳木斯市
         307 依兰县
         308 依安县
         309 侯马市
         310 保亭黎族苗族自治县
         311 保定市
         312 保山市
         313 保康县
         314 保德县
         315 保靖县
         316 信丰县
         317 信宜市
         318 信州区
         319 信阳市
         320 修文县
         321 修武县
         322 修水县
         323 倍京经济技术开发区
         324 偃师市
         325 偏关县
         326 儋州市
         327 元宝区
         328 元宝山区
         329 元氏县
         330 元江哈尼族彝族傣族自治县
         331 元谋县
         332 元阳县
         333 光山县
         334 光泽县
         335 克东县
         336 克什克腾旗
         337 克孜勒苏柯尔克孜自治州
         338 克山县
         339 克拉玛依区
         340 克拉玛依市
         341 兖州区
         342 全南县
         343 全坻区
         344 全州县
         345 全椒县
         346 八公山区
         347 八宿县
         348 八步区
         349 公主岭市
         350 公安县
         351 六合区
         352 六安市
         353 六枝特区
         354 六盘水市
         355 兰坪白族普米族自治县
         356 兰山区
         357 兰州市
         358 兰溪市
         359 兰考县
         360 兰西县
         361 兰陵县
         362 共和县
         363 共青城市
         364 关岭布依族苗族自治县
         365 兴业县
         366 兴义市
         367 兴仁县
         368 兴化市
         369 兴县
         370 兴和县
         371 兴国县
         372 兴城市
         373 兴宁区
         374 兴宁市
         375 兴安区
         376 兴安县
         377 兴安盟
         378 兴宾区
         379 兴山区
         380 兴山县
         381 兴平市
         382 兴庆区
         383 兴文县
         384 兴海县
         385 兴隆县
         386 兴隆台区
         387 冀州市
         388 内丘县
         389 内乡县
         390 内江市
         391 内蒙古自治区
         392 内黄县
         393 册亨县
         394 冕宁县
         395 农垦总局
         396 农安县
         397 冠县
         398 冷水江市
         399 冷水滩区
         400 准安市
         401 准格尔旗
         402 凉城县
         403 凉山彝族自治州
         404 凉州区
         405 凌云县
         406 凌河区
         407 凌海市
         408 凌源市
         409 凤冈县
         410 凤凰县
         411 凤县
         412 凤台县
         413 凤城市
         414 凤山县
         415 凤庆县
         416 凤泉区
         417 凤翔县
         418 凤阳县
         419 凭祥市
         420 凯里市
         421 分宜县
         422 刚察县
         423 利川市
         424 利州区
         425 利津县
         426 利辛县
         427 利通区
         428 前进区
         429 前郭尔罗斯蒙古族自治县
         430 前锋区
         431 剑川县
         432 剑河县
         433 剑阁县
         434 加查县
         435 务川仡佬族苗族自治县
         436 勃利县
         437 勉县
         438 勐海县
         439 勐腊县
         440 包头市
         441 包河区
         442 化州市
         443 化德县
         444 化隆回族自治县
         445 北京市
         446 北京经济技术开发区
         447 北京经济技术开发区BeijingEconomic-technological
DevelopmentZones
         448 北仑区
         449 北关区
         450 北塔区
         451 北塘区
         452 北安市
         453 北屯市
         454 北川羌族自治县
         455 北市区
         456 北戴河区
         457 北林区
         458 北流市
         459 北海市
         460 北湖区
         461 北碚区
         462 北票市
         463 北辰区
         464 北镇市
         465 十堰市
         466 千山区
         467 千阳县
         468 华亭县
         469 华县
         470 华坪县
         471 华宁县
         472 华安县
         473 华容区
         474 华容县
         475 华池县
         476 华蓥市
         477 华阴市
         478 华龙区
         479 卓尼县
         480 卓资县
         481 单县
         482 南丰县
         483 南丹县
         484 南乐县
         485 南京市
         486 南充市
         487 南关区
         488 南华县
         489 南县
         490 南召县
         491 南和县
         492 南城县
         493 南宁市
         494 南安市
         495 南宫市
         496 南山区
         497 南岔区
         498 南岗区
         499 南岳区
         500 南岸区
         501 南川区
         502 南市区
         503 南平市
         504 南康区
         505 南开区
         506 南昌县
         507 南昌市
         508 南明区
         509 南木林县
         510 南汇区
         511 南江县
         512 南沙区
         513 南浔区
         514 南海区
         515 南涧彝族自治县
         516 南湖区
         517 南溪区
         518 南漳县
         519 南澳县
         520 南皮县
         521 南票区
         522 南芬区
         523 南谯区
         524 南通市
         525 南郊区
         526 南郑县
         527 南部县
         528 南长区
         529 南阳前
         530 南阳市
         531 南陵县
         532 南雄市
         533 南靖县
         534 博乐市
         535 博兴县
         536 博尔塔拉蒙古自治州
         537 博山区
         538 博望区
         539 博湖县
         540 博爱县
         541 博白县
         542 博罗县
         543 博野县
         544 卢氏县
         545 卢湾区
         546 卢龙县
         547 卧龙区
         548 卫东区
         549 卫滨区
         550 卫辉市
         551 印台区
         552 印江土家族苗族自治县
         553 即墨市
         554 历下区
         555 历城区
         556 原州区
         557 原平市
         558 原阳县
         559 厦门市
         560 县
         561 友好区
         562 友谊县
         563 双台子区
         564 双城市
         565 双塔区
         566 双峰县
         567 双柏县
         568 双桥区
         569 双江拉祜族佤族布朗族傣族自治县
         570 双流县
         571 双清区
         572 双湖县
         573 双滦区
         574 双牌县
         575 双辽市
         576 双阳区
         577 双鸭山市
         578 叙永县
         579 叠彩区
         580 古丈县
         581 古交市
         582 古冶区
         583 古县
         584 古城区
         585 古塔区
         586 古浪县
         587 古田县
         588 古蔺县
         589 句容市
         590 召陵区
         591 台儿庄区
         592 台前县
         593 台安县
         594 台山市
         595 台州市
         596 台江区
         597 台江县
         598 台湾省
         599 右江区
         600 右玉县
         601 叶县
         602 叶城县
         603 合作市
         604 合山市
         605 合川区
         606 合水县
         607 合江县
         608 合浦县
         609 合肥市
         610 合阳县
         611 吉利区
         612 吉县
         613 吉安县
         614 吉安市
         615 吉州区
         616 吉木乃县
         617 吉木萨尔县
         618 吉林市
         619 吉林省
         620 吉水县
         621 吉阳区
         622 吉隆县
         623 吉首市
         624 同仁县
         625 同原市
         626 同安区
         627 同德县
         628 同心县
         629 同江市
         630 名山区
         631 吐鲁番地区
         632 吐鲁番市
         633 向阳区
         634 吕梁市
         635 吕粱市
         636 君山区
         637 含山县
         638 启东市
         639 吴中区
         640 吴兴区
         641 吴堡县
         642 吴川市
         643 吴忠市
         644 吴桥县
         645 吴江区
         646 吴起县
         647 呈贡区
         648 周口市
         649 周宁县
         650 周村区
         651 周至县
         652 周门市
         653 呼伦贝尔市
         654 呼兰区
         655 呼和浩特市
         656 呼图壁县
         657 呼玛县
         658 和县
         659 和布克赛尔蒙古自治县
         660 和平区
         661 和平县
         662 和政县
         663 和林格尔县
         664 和田县
         665 和田地区
         666 和田市
         667 和硕县
         668 和静县
         669 和顺县
         670 和龙市
         671 咸丰县
         672 咸宁市
         673 咸安区
         674 咸阳市
         675 哈密地区
         676 哈密市
         677 哈尔滨市
         678 哈巴河县
         679 响水县
         680 唐县
         681 唐山市
         682 唐河县
         683 商丘市
         684 商南县
         685 商城县
         686 商州区
         687 商水县
         688 商河县
         689 商洛市
         690 商都县
         691 喀什地区
         692 喀什市
         693 喀喇沁左翼蒙古族自治县
         694 喀喇沁旗
         695 喜德县
         696 嘉兴市
         697 嘉善县
         698 嘉定区
         699 嘉峪关市
         700 嘉祥县
         701 嘉禾县
         702 嘉荫县
         703 嘉陵区
         704 嘉鱼县
         705 嘉黎县
         706 噶尔县
         707 囊谦县
         708 四会市
         709 四子王旗
         710 四川省
         711 四平市
         712 四方台区
         713 回民区
         714 团风县
         715 围场满族蒙古族自治县
         716 固原市
         717 固始县
         718 固安县
         719 固镇县
         720 固阳县
         721 图们市
         722 图木舒克市
         723 土默特右旗
         724 土默特左旗
         725 坊子区
         726 坡头区
         727 垣曲县
         728 垦利县
         729 垫江县
         730 埇桥区
         731 城东区
         732 城中区
         733 城关区
         734 城北区
         735 城区
         736 城厢区
         737 城口县
         738 城固县
         739 城子河区
         740 城步苗族自治县
         741 城西区
         742 城阳区
         743 堆龙德庆县
         744 塔什库尔干塔吉克自治县
         745 塔城地区
         746 塔城市
         747 塔河县
         748 塘沽区
         749 增城区
         750 墨江哈尼族自治县
         751 墨玉县
         752 墨竹工卡县
         753 墨脱县
         754 壤塘县
         755 壶关县
         756 复兴区
         757 夏县
         758 夏河县
         759 夏津县
         760 夏邑县
         761 多伦县
         762 大东区
         763 大丰市
         764 大余县
         765 大关县
         766 大兴区
         767 大兴安岭地区
         768 大冶市
         769 大化瑶族自治县
         770 大厂回族自治县
         771 大同区
         772 大同县
         773 大同市
         774 大名县
         775 大城县
         776 大埔县
         777 大姚县
         778 大宁县
         779 大安区
         780 大安市
         781 大庆市
         782 大悟县
         783 大新县
         784 大方县
         785 大武口区
         786 大洼县
         787 大渡口区
         788 大渡门区
         789 大港区
         790 大理市
         791 大理白族自治州
         792 大田县
         793 大石桥市
         794 大祥区
         795 大竹县
         796 大英县
         797 大荔县
         798 大观区
         799 大足区
         800 大连市
         801 大通区
         802 大通回族土族自治县
         803 大邑县
         804 天元区
         805 天全县
         806 天台县
         807 天宁区
         808 天山区
         809 天峨县
         810 天峻县
         811 天心区
         812 天柱县
         813 天桥区
         814 天水市
         815 天河区
         816 天津市
         817 天津港保税区
         818 天津滨海高新区
         819 天津经济技术开发区
         820 天涯区
         821 天祝藏族自治县
         822 天等县
         823 天镇县
         824 天长市
         825 天门市
         826 太仆寺旗
         827 太仓市
         828 太原市
         829 太和区
         830 太和县
         831 太子河区
         832 太平区
         833 太康县
         834 太湖县
         835 太白县
         836 太谷县
         837 头屯河区
         838 夷陵区
         839 夹江县
         840 奇台县
         841 奈曼旗
         842 奉化市
         843 奉新县
         844 奉节县
         845 奉贤区
         846 奎屯市
         847 奎文区
         848 如东县
         849 如皋市
         850 始兴县
         851 姑苏区
         852 姚安县
         853 姜堰区
         854 威信县
         855 威县
         856 威宁彝族回族苗族自治县
         857 威海市
         858 威远县
         859 娄底市
         860 娄星区
         861 娄烦县
         862 婺城区
         863 婺源县
         864 嫩江县
         865 子洲县
         866 子长县
         867 孙吴县
         868 孝义市
         869 孝南区
         870 孝感市
         871 孝昌县
         872 孟州市
         873 孟村回族自治县
         874 孟津县
         875 孟连傣族拉祜族佤族自治县
         876 宁乡县
         877 宁化县
         878 宁南县
         879 宁县
         880 宁国市
         881 宁城县
         882 宁夏回族自治区
         883 宁安市
         884 宁强县
         885 宁德市
         886 宁明县
         887 宁晋县
         888 宁武县
         889 宁江区
         890 宁河县
         891 宁波市
         892 宁津县
         893 宁洱哈尼族彝族自治县
         894 宁海县
         895 宁蒗彝族自治县
         896 宁远县
         897 宁都县
         898 宁阳县
         899 宁陕县
         900 宁陵县
         901 宅鸡市
         902 安丘市
         903 安义县
         904 安乡县
         905 安仁县
         906 安化县
         907 安县
         908 安吉县
         909 安国市
         910 安图县
         911 安塞县
         912 安多县
         913 安宁区
         914 安宁市
         915 安定区
         916 安居区
         917 安岳县
         918 安平县
         919 安庆市
         920 安康市
         921 安徽省
         922 安新县
         923 安次区
         924 安泽县
         925 安源区
         926 安溪县
         927 安福县
         928 安达市
         929 安远县
         930 安阳县
         931 安阳市
         932 安陆市
         933 安顺市
         934 安龙县
         935 宏伟区
         936 宕昌县
         937 官渡区
         938 定兴县
         939 定南县
         940 定安县
         941 定州市
         942 定日县
         943 定海区
         944 定结县
         945 定襄县
         946 定西市
         947 定边县
         948 定远县
         949 定陶县
         950 宛城区
         951 宜丰县
         952 宜兴市
         953 宜君县
         954 宜城市
         955 宜宾县
         956 宜宾市
         957 宜川县
         958 宜州市
         959 宜昌市
         960 宜春市
         961 宜秀区
         962 宜章县
         963 宜良县
         964 宜都市
         965 宜阳县
         966 宜黄县
         967 宝丰县
         968 宝兴县
         969 宝坻区
         970 宝塔区
         971 宝安区
         972 宝山区
         973 宝应县
         974 宝清县
         975 宝鸡市
         976 宣化区
         977 宣化县
         978 宣城市
         979 宣威市
         980 宣州区
         981 宣恩县
         982 宣武区
         983 宣汉县
         984 容县
         985 容城县
         986 宽城区
         987 宽城满族自治县
         988 宽甸满族自治县
         989 宾县
         990 宾川县
         991 宾阳县
         992 宿城区
         993 宿州市
         994 宿松县
         995 宿豫区
         996 宿迁市
         997 密云县
         998 密山市
         999 富县
        1000 富宁县
        1001 富川瑶族自治县
        1002 富平县
        1003 富拉尔基区
        1004 富民县
        1005 富源县
        1006 富蕴县
        1007 富裕县
        1008 富锦市
        1009 富阳市
        1010 富顺县
        1011 寒亭区
        1012 察哈尔右翼中旗
        1013 察哈尔右翼前旗
        1014 察哈尔右翼后旗
        1015 察布查尔锡伯自治县
        1016 察隅县
        1017 察雅县
        1018 寻乌县
        1019 寻甸回族彝族自治县
        1020 寿光市
        1021 寿县
        1022 寿宁县
        1023 寿阳县
        1024 封丘县
        1025 封开县
        1026 射洪县
        1027 射阳县
        1028 将乐县
        1029 尉氏县
        1030 尉犁县
        1031 小店区
        1032 小金县
        1033 尖山区
        1034 尖扎县
        1035 尖草坪区
        1036 尚义县
        1037 尚志市
        1038 尤溪县
        1039 尧都区
        1040 尼勒克县
        1041 尼木县
        1042 尼玛县
        1043 屏南县
        1044 屏山县
        1045 屏边苗族自治县
        1046 屯昌县
        1047 屯溪区
        1048 屯留县
        1049 山东省
        1050 山丹县
        1051 山亭区
        1052 山南地区
        1053 山城区
        1054 山海关区
        1055 山西省
        1056 山阳区
        1057 山阳县
        1058 山阴县
        1059 岐山县
        1060 岑巩县
        1061 岑溪市
        1062 岗巴县
        1063 岚县
        1064 岚山区
        1065 岚皋县
        1066 岢岚县
        1067 岫岩满族自治县
        1068 岭东区
        1069 岱山县
        1070 岱岳区
        1071 岳塘区
        1072 岳普湖县
        1073 岳池县
        1074 岳西县
        1075 岳阳县
        1076 岳阳市
        1077 岳阳楼区
        1078 岳麓区
        1079 岷县
        1080 峄城区
        1081 峡江县
        1082 峨山彝族自治县
        1083 峨眉山市
        1084 峨边彝族自治县
        1085 峰峰矿区
        1086 崂山区
        1087 崆峒区
        1088 崇义县
        1089 崇仁县
        1090 崇信县
        1091 崇安区
        1092 崇川区
        1093 崇州市
        1094 崇左市
        1095 崇文区
        1096 崇明县
        1097 崇礼县
        1098 崇阳县
        1099 崖州区
        1100 嵊州市
        1101 嵊泗县
        1102 嵩县
        1103 嵩明县
        1104 巍山彝族回族自治县
        1105 川汇区
        1106 巢湖市
        1107 工农区
        1108 工布江达县
        1109 左云县
        1110 左权县
        1111 左贡县
        1112 巧家县
        1113 巨野县
        1114 巨鹿县
        1115 巩义市
        1116 巩留县
        1117 巫山县
        1118 巫溪县
        1119 巴东县
        1120 巴中市
        1121 巴南区
        1122 巴塘县
        1123 巴州区
        1124 巴彥淖尔市
        1125 巴彦县
        1126 巴彦淖尔市
        1127 巴林右旗
        1128 巴林左旗
        1129 巴楚县
        1130 巴里坤哈萨克自治县
        1131 巴青县
        1132 巴音郭楞蒙古自治州
        1133 巴马瑶族自治县
        1134 市中区
        1135 市北区
        1136 市南区
        1137 市辖区
        1138 布尔津县
        1139 布拖县
        1140 师宗县
        1141 带岭区
        1142 常宁市
        1143 常山县
        1144 常州市
        1145 常德市
        1146 常熟市
        1147 平乐县
        1148 平乡县
        1149 平凉市
        1150 平利县
        1151 平南县
        1152 平原县
        1153 平和县
        1154 平坝县
        1155 平塘县
        1156 平安县
        1157 平定县
        1158 平山区
        1159 平山县
        1160 平川区
        1161 平度市
        1162 平房区
        1163 平昌县
        1164 平果县
        1165 平桥区
        1166 平武县
        1167 平江县
        1168 平泉县
        1169 平湖市
        1170 平潭县
        1171 平罗县
        1172 平舆县
        1173 平谷区
        1174 平远县
        1175 平遥县
        1176 平邑县
        1177 平阳县
        1178 平阴县
        1179 平陆县
        1180 平顶山市
        1181 平顺县
        1182 平鲁区
        1183 广东省
        1184 广丰县
        1185 广元市
        1186 广南县
        1187 广宁县
        1188 广安区
        1189 广安市
        1190 广宗县
        1191 广州市
        1192 广平县
        1193 广德县
        1194 广昌县
        1195 广水市
        1196 广汉市
        1197 广河县
        1198 广灵县
        1199 广西壮族自治区
        1200 广阳区
        1201 广陵区
        1202 广饶县
        1203 庄河市
        1204 庄浪县
        1205 庆云县
        1206 庆元县
        1207 庆城县
        1208 庆安县
        1209 庆阳市
        1210 庐山区
        1211 庐州市
        1212 庐江县
        1213 庐阳区
        1214 库伦旗
        1215 库尔勒市
        1216 库车县
        1217 应县
        1218 应城市
        1219 府谷县
        1220 康乐县
        1221 康保县
        1222 康县
        1223 康定县
        1224 康平县
        1225 康马县
        1226 廉江市
        1227 廊坊市
        1228 延吉市
        1229 延安市
        1230 延寿县
        1231 延川县
        1232 延平区
        1233 延庆县
        1234 延津县
        1235 延边朝鲜族自治州
        1236 延长县
        1237 建华区
        1238 建始县
        1239 建宁县
        1240 建平县
        1241 建德市
        1242 建昌县
        1243 建水县
        1244 建湖县
        1245 建瓯市
        1246 建邺区
        1247 建阳市
        1248 开化县
        1249 开原市
        1250 开县
        1251 开发区
        1252 开封县
        1253 开封市
        1254 开平区
        1255 开平市
        1256 开江县
        1257 开福区
        1258 开远市
        1259 开阳县
        1260 开鲁县
        1261 弋江区
        1262 弋阳县
        1263 弓长岭区
        1264 张北县
        1265 张家口市
        1266 张家川回族自治县
        1267 张家港市
        1268 张家界市
        1269 张店区
        1270 张掖市
        1271 张湾区
        1272 弥勒市
        1273 弥渡县
        1274 当涂县
        1275 当阳市
        1276 当雄县
        1277 彝良县
        1278 彬县
        1279 彭山县
        1280 彭州市
        1281 彭水苗族土家族自治县
        1282 彭泽县
        1283 彭阳县
        1284 彰武县
        1285 徐州市
        1286 徐水县
        1287 徐汇区
        1288 徐闻县
        1289 得荣县
        1290 循化撒拉族自治县
        1291 微山县
        1292 德令哈市
        1293 德保县
        1294 德兴市
        1295 德化县
        1296 德城区
        1297 德安县
        1298 德宏傣族景颇族自治州
        1299 德州市
        1300 德庆县
        1301 德惠市
        1302 德昌县
        1303 德格县
        1304 德江县
        1305 德清县
        1306 德钦县
        1307 德阳市
        1308 徽县
        1309 徽州区
        1310 志丹县
        1311 忠县
        1312 忻城县
        1313 忻州市
        1314 忻府区
        1315 怀仁县
        1316 怀化市
        1317 怀宁县
        1318 怀安县
        1319 怀来县
        1320 怀柔区
        1321 怀远县
        1322 怀集县
        1323 怒江傈傈族自治州
        1324 怒江傈僳族自治州
        1325 怒江傈粟族自治州
        1326 怒江僳僳族自治州
        1327 思南县
        1328 思明区
        1329 思茅区
        1330 思茅市
        1331 恒山区
        1332 恩平市
        1333 恩施上家族苗族自治州
        1334 恩施土家族苗族自治州
        1335 恩施市
        1336 恩阳区
        1337 恭城瑶族自治县
        1338 息县
        1339 息烽县
        1340 惠东县
        1341 惠农区
        1342 惠城区
        1343 惠安县
        1344 惠山区
        1345 惠州市
        1346 惠来县
        1347 惠民县
        1348 惠水县
        1349 惠济区
        1350 惠阳区
        1351 慈利县
        1352 慈溪市
        1353 成华区
        1354 成县
        1355 成宁市
        1356 成安县
        1357 成武县
        1358 成都市
        1359 戚墅堰区
        1360 户县
        1361 房县
        1362 房山区
        1363 扎兰屯市
        1364 扎囊县
        1365 扎赉特旗
        1366 扎赉诺尔区
        1367 扎鲁特旗
        1368 托克托县
        1369 托克逊县
        1370 托里县
        1371 扬中市
        1372 扬州市
        1373 扶余市
        1374 扶沟县
        1375 扶绥县
        1376 扶风县
        1377 承德县
        1378 承德市
        1379 抚宁县
        1380 抚州市
        1381 抚松县
        1382 抚远县
        1383 抚顺县
        1384 抚顺市
        1385 拉孜县
        1386 拉萨市
        1387 招远市
        1388 拜城县
        1389 拜泉县
        1390 拱墅区
        1391 振兴区
        1392 振安区
        1393 掇刀区
        1394 措勤县
        1395 措美县
        1396 揭东区
        1397 揭西县
        1398 揭阳市
        1399 搏尔塔拉蒙古自治州
        1400 攀枝花市
        1401 攸县
        1402 改则县
        1403 政和县
        1404 故城县
        1405 敖汉旗
        1406 敦化市
        1407 敦煌市
        1408 文县
        1409 文圣区
        1410 文安县
        1411 文山壮族苗族自治州
        1412 文山市
        1413 文峰区
        1414 文成县
        1415 文昌市
        1416 文水县
        1417 文登区
        1418 斗门区
        1419 新丰县
        1420 新乐市
        1421 新乡县
        1422 新乡市
        1423 新会区
        1424 新余市
        1425 新兴区
        1426 新兴县
        1427 新化县
        1428 新北区
        1429 新华区
        1430 新县
        1431 新和县
        1432 新城区
        1433 新多市
        1434 新宁县
        1435 新安县
        1436 新宾满族自治县
        1437 新密市
        1438 新巴尔虎右旗
        1439 新巴尔虎左旗
        1440 新市区
        1441 新干县
        1442 新平彝族傣族自治县
        1443 新建县
        1444 新技术园区
        1445 新抚区
        1446 新昌县
        1447 新晃侗族自治县
        1448 新民市
        1449 新沂市
        1450 新河县
        1451 新泰市
        1452 新津县
        1453 新洲区
        1454 新源县
        1455 新田县
        1456 新疆生产建设兵团
        1457 新疆维吾尔自治区
        1458 新绛县
        1459 新罗区
        1460 新荣区
        1461 新蔡县
        1462 新邱区
        1463 新邵县
        1464 新郑市
        1465 新都区
        1466 新野县
        1467 新青区
        1468 新龙县
        1469 方城县
        1470 方山县
        1471 方正县
        1472 施甸县
        1473 施秉县
        1474 旅顺口区
        1475 旌德县
        1476 旌阳区
        1477 无为县
        1478 无极县
        1479 无棣县
        1480 无锡市
        1481 日喀则地区
        1482 日喀则市
        1483 日土县
        1484 日昭市
        1485 日照市
        1486 旬邑县
        1487 旬阳县
        1488 旺苍县
        1489 昂仁县
        1490 昂昂溪区
        1491 昆山市
        1492 昆明州
        1493 昆明市
        1494 昆都仑区
        1495 昌乐县
        1496 昌吉回族自治州
        1497 昌吉市
        1498 昌图县
        1499 昌宁县
        1500 昌平区
        1501 昌江区
        1502 昌江黎族自治县
        1503 昌邑区
        1504 昌邑市
        1505 昌都县
        1506 昌都地区
        1507 昌黎县
        1508 明光市
        1509 明山区
        1510 明水县
        1511 明溪县
        1512 易县
        1513 易门县
        1514 昔阳县
        1515 星子县
        1516 昭化区
        1517 昭平县
        1518 昭苏县
        1519 昭觉县
        1520 昭通市
        1521 昭阳区
        1522 晋中市
        1523 晋城市
        1524 晋宁县
        1525 晋安区
        1526 晋州市
        1527 晋江市
        1528 晋源区
        1529 普兰县
        1530 普兰店市
        1531 普宁市
        1532 普安县
        1533 普定县
        1534 普格县
        1535 普洱市
        1536 普陀区
        1537 景东彝族自治县
        1538 景县
        1539 景宁畲族自治县
        1540 景德镇市
        1541 景泰县
        1542 景洪市
        1543 景谷傣族彝族自治县
        1544 晴隆县
        1545 曲周县
        1546 曲松县
        1547 曲水县
        1548 曲江区
        1549 曲沃县
        1550 曲阜市
        1551 曲阳县
        1552 曲靖市
        1553 曲麻莱县
        1554 曹县
        1555 曹妃甸区
        1556 曾都区
        1557 月湖区
        1558 朔城区
        1559 朔州市
        1560 朗县
        1561 望城区
        1562 望奎县
        1563 望江县
        1564 望花区
        1565 望谟县
        1566 望都县
        1567 朝天区
        1568 朝阳区
        1569 朝阳县
        1570 朝阳市
        1571 木兰县
        1572 木垒哈萨克自治县
        1573 木里藏族自治县
        1574 未央区
        1575 本溪市
        1576 本溪满族自治县
        1577 札达县
        1578 杂多县
        1579 李沧区
        1580 杏花岭区
        1581 杜尔伯特蒙古族自治县
        1582 杜集区
        1583 杞县
        1584 来凤县
        1585 来安县
        1586 来宾市
        1587 杨凌农业高新技术
产业示范区
        1588 杨凌农业高新技术产业示范区
        1589 杨凌示范区
        1590 杨浦区
        1591 杨陵区
        1592 杭州市
        1593 杭锦后旗
        1594 杭锦旗
        1595 松北区
        1596 松原市
        1597 松山区
        1598 松桃苗族自治县
        1599 松江区
        1600 松溪县
        1601 松滋市
        1602 松潘县
        1603 松阳县
        1604 林口县
        1605 林周县
        1606 林州市
        1607 林甸县
        1608 林芝县
        1609 林芝地区
        1610 林西县
        1611 果洛藏族自治州
        1612 枝江市
        1613 枞阳县
        1614 枣庄市
        1615 枣强县
        1616 枣阳市
        1617 柏乡县
        1618 柘城县
        1619 柘荣县
        1620 柞水县
        1621 柯坪县
        1622 柯城区
        1623 柯桥区
        1624 柳北区
        1625 柳南区
        1626 柳城县
        1627 柳州市
        1628 柳林县
        1629 柳江县
        1630 柳河县
        1631 栖霞区
        1632 栖霞市
        1633 株洲县
        1634 株洲市
        1635 根河市
        1636 格尔木市
        1637 栾城区
        1638 栾川县
        1639 桂东县
        1640 桂平市
        1641 桂林市
        1642 桂阳县
        1643 桃城区
        1644 桃山区
        1645 桃江县
        1646 桃源县
        1647 桐乡市
        1648 桐城市
        1649 桐庐县
        1650 桐柏县
        1651 桐梓县
        1652 桑日县
        1653 桑植县
        1654 桑珠孜区
        1655 桓仁满族自治县
        1656 桓台县
        1657 桥东区
        1658 桥西区
        1659 桦南县
        1660 桦川县
        1661 桦甸市
        1662 梁园区
        1663 梁子湖区
        1664 梁山县
        1665 梁平县
        1666 梁河县
        1667 梅列区
        1668 梅县区
        1669 梅州市
        1670 梅江区
        1671 梅河口市
        1672 梅里斯达斡尔族区
        1673 梓潼县
        1674 梧州市
        1675 梨树区
        1676 梨树县
        1677 椒江区
        1678 楚雄市
        1679 楚雄彝族自治州
        1680 榆中县
        1681 榆林市
        1682 榆树市
        1683 榆次区
        1684 榆社县
        1685 榆阳区
        1686 榕城区
        1687 榕江县
        1688 槐荫区
        1689 樊城区
        1690 樟树市
        1691 横县
        1692 横山县
        1693 横峰县
        1694 歙县
        1695 正宁县
        1696 正安县
        1697 正定县
        1698 正蓝旗
        1699 正镶白旗
        1700 正阳县
        1701 武义县
        1702 武乡县
        1703 武侯区
        1704 武冈市
        1705 武功县
        1706 武城县
        1707 武夷山市
        1708 武威市
        1709 武宁县
        1710 武安市
        1711 武定县
        1712 武宣县
        1713 武山县
        1714 武川县
        1715 武平县
        1716 武强县
        1717 武昌区
        1718 武汉市
        1719 武江区
        1720 武清区
        1721 武穴市
        1722 武胜县
        1723 武进区
        1724 武邑县
        1725 武都区
        1726 武陟县
        1727 武陵区
        1728 武陵源区
        1729 武隆县
        1730 武鸣县
        1731 殷都区
        1732 比如县
        1733 毕节地区
        1734 毕节市
        1735 毫州市
        1736 民丰县
        1737 民乐县
        1738 民勤县
        1739 民和回族土族自治县
        1740 民权县
        1741 水城县
        1742 水富县
        1743 水磨沟区
        1744 永丰县
        1745 永仁县
        1746 永修县
        1747 永兴县
        1748 永吉县
        1749 永和县
        1750 永善县
        1751 永嘉县
        1752 永城市
        1753 永宁县
        1754 永安市
        1755 永定区
        1756 永定县
        1757 永寿县
        1758 永川区
        1759 永州市
        1760 永平县
        1761 永年县
        1762 永康市
        1763 永德县
        1764 永新县
        1765 永昌县
        1766 永春县
        1767 永泰县
        1768 永济市
        1769 永清县
        1770 永登县
        1771 永福县
        1772 永胜县
        1773 永靖县
        1774 永顺县
        1775 汇川区
        1776 汉中市
        1777 汉南区
        1778 汉台区
        1779 汉寿县
        1780 汉川市
        1781 汉沽区
        1782 汉源县
        1783 汉滨区
        1784 汉阳区
        1785 汉阴县
        1786 汕头市
        1787 汕尾市
        1788 汝南县
        1789 汝城县
        1790 汝州市
        1791 汝阳县
        1792 江东区
        1793 江北区
        1794 江华瑶族自治县
        1795 江南区
        1796 江口县
        1797 江坪坝区
        1798 江城区
        1799 江城哈尼族彝族自治县
        1800 江夏区
        1801 江孜县
        1802 江宁区
        1803 江安县
        1804 江山市
        1805 江岸区
        1806 江川县
        1807 江州区
        1808 江干区
        1809 江永县
        1810 江汉区
        1811 江油市
        1812 江津区
        1813 江海区
        1814 江源区
        1815 江苏省
        1816 江西省
        1817 江达县
        1818 江都区
        1819 江门市
        1820 江阳区
        1821 江阴市
        1822 江陵县
        1823 池州市
        1824 汤原县
        1825 汤旺河区
        1826 汤阴县
        1827 汨罗市
        1828 汪清县
        1829 汶上县
        1830 汶川县
        1831 汾西县
        1832 汾阳市
        1833 沁县
        1834 沁水县
        1835 沁源县
        1836 沁阳市
        1837 沂南县
        1838 沂水县
        1839 沂源县
        1840 沅江市
        1841 沅陵县
        1842 沈丘县
        1843 沈北新区
        1844 沈河区
        1845 沈阳市
        1846 沐川县
        1847 沙依巴克区
        1848 沙县
        1849 沙坡头区
        1850 沙坪坝区
        1851 沙市区
        1852 沙河口区
        1853 沙河市
        1854 沙洋县
        1855 沙湾区
        1856 沙湾县
        1857 沙雅县
        1858 沛县
        1859 沧县
        1860 沧州市
        1861 沧源佤族自治县
        1862 沭阳县
        1863 河东区
        1864 河两区
        1865 河北区
        1866 河北省
        1867 河南省
        1868 河南蒙古族自治县
        1869 河口区
        1870 河口瑶族自治县
        1871 河曲县
        1872 河池市
        1873 河津市
        1874 河源市
        1875 河西区
        1876 河间市
        1877 治多县
        1878 沽源县
        1879 沾化区
        1880 沾益县
        1881 沿河土家族自治县
        1882 沿滩区
        1883 泉山区
        1884 泉州市
        1885 泉港区
        1886 泊头市
        1887 泌阳县
        1888 法库县
        1889 泗县
        1890 泗水县
        1891 泗洪县
        1892 泗阳县
        1893 波密县
        1894 泰兴市
        1895 泰和县
        1896 泰宁县
        1897 泰安市
        1898 泰山区
        1899 泰州市
        1900 泰来县
        1901 泰顺县
        1902 泸县
        1903 泸定县
        1904 泸州市
        1905 泸水县
        1906 泸溪县
        1907 泸西县
        1908 泽州县
        1909 泽库县
        1910 泽普县
        1911 泾县
        1912 泾川县
        1913 泾源县
        1914 泾阳县
        1915 洋县
        1916 洛南县
        1917 洛宁县
        1918 洛川县
        1919 洛扎县
        1920 洛江区
        1921 洛浦县
        1922 洛阳市
        1923 洛隆县
        1924 洛龙区
        1925 洞口县
        1926 洞头县
        1927 津南区
        1928 津市市
        1929 洪山区
        1930 洪江市
        1931 洪泽县
        1932 洪洞县
        1933 洪湖市
        1934 洪雅县
        1935 洮北区
        1936 洮南市
        1937 洱源县
        1938 浈江区
        1939 浉河区
        1940 济南市
        1941 济宁市
        1942 济源市
        1943 济阳县
        1944 浏阳市
        1945 浑南区
        1946 浑江区
        1947 浑源县
        1948 浔阳区
        1949 浙江省
        1950 浚县
        1951 浠水县
        1952 浦东新区
        1953 浦北县
        1954 浦口区
        1955 浦城县
        1956 浦江县
        1957 浪卡子县
        1958 浮山县
        1959 浮梁县
        1960 海东地区
        1961 海东市
        1962 海丰县
        1963 海伦市
        1964 海兴县
        1965 海勃湾区
        1966 海北藏族自治州
        1967 海南区
        1968 海南市
        1969 海南省
        1970 海南藏族自治州
        1971 海原县
        1972 海口市
        1973 海城区
        1974 海城市
        1975 海宁市
        1976 海安县
        1977 海州区
        1978 海拉尔区
        1979 海晏县
        1980 海曙区
        1981 海林市
        1982 海棠区
        1983 海沧区
        1984 海淀区
        1985 海港区
        1986 海珠区
        1987 海盐县
        1988 海西蒙占族藏族自治州
        1989 海西蒙古族藏族自治州
        1990 海门市
        1991 海阳市
        1992 海陵区
        1993 涉县
        1994 涞水县
        1995 涞源县
        1996 涟水县
        1997 涟源市
        1998 涡阳县
        1999 润州区
        2000 涧西区
        2001 涪城区
        2002 涪陵区
        2003 涵江区
        2004 涿州市
        2005 涿鹿县
        2006 淄博市
        2007 淄川区
        2008 淅川县
        2009 淇县
        2010 淇滨区
        2011 淮上区
        2012 淮北市
        2013 淮南市
        2014 淮安区
        2015 淮安市
        2016 淮滨县
        2017 淮阳县
        2018 淮阴区
        2019 深圳市
        2020 深州市
        2021 深泽县
        2022 淳化县
        2023 淳安县
        2024 清丰县
        2025 清原满族自治县
        2026 清城区
        2027 清徐县
        2028 清新区
        2029 清水县
        2030 清水河县
        2031 清河区
        2032 清河县
        2033 清河门区
        2034 清流县
        2035 清浦区
        2036 清涧县
        2037 清苑县
        2038 清远市
        2039 清镇市
        2040 渑池县
        2041 渝中区
        2042 渝北区
        2043 渝水区
        2044 渠县
        2045 温县
        2046 温宿县
        2047 温岭市
        2048 温州市
        2049 温江区
        2050 温泉县
        2051 渭南市
        2052 渭城区
        2053 渭源县
        2054 渭滨区
        2055 港北区
        2056 港南区
        2057 港口区
        2058 港闸区
        2059 游仙区
        2060 湄潭县
        2061 湖北省
        2062 湖南省
        2063 湖口县
        2064 湖州市
        2065 湖滨区
        2066 湖里区
        2067 湘东区
        2068 湘乡市
        2069 湘桥区
        2070 湘潭县
        2071 湘潭市
        2072 湘西土家族苗族自治州
        2073 湘西士家族苗族自治州
        2074 湘阴县
        2075 湛江市
        2076 湛河区
        2077 湟中县
        2078 湟源县
        2079 湾里区
        2080 溆浦县
        2081 源城区
        2082 源汇区
        2083 溧水区
        2084 溧阳市
        2085 溪湖区
        2086 滁州市
        2087 滑县
        2088 滕州市
        2089 满城县
        2090 满洲里市
        2091 滦南县
        2092 滦县
        2093 滦平县
        2094 滨城区
        2095 滨州市
        2096 滨江区
        2097 滨海县
        2098 滨海新区
        2099 滨湖区
        2100 滨诲新区
        2101 滴道区
        2102 漠河县
        2103 漯河市
        2104 漳县
        2105 漳州市
        2106 漳平市
        2107 漳浦县
        2108 漾濞彝族自治县
        2109 潍坊市
        2110 潍城区
        2111 潘集区
        2112 潜山县
        2113 潜江市
        2114 潞城市
        2115 潢川县
        2116 潮南区
        2117 潮安区
        2118 潮州市
        2119 潮阳区
        2120 潼关县
        2121 潼南县
        2122 澄城县
        2123 澄江县
        2124 澄海区
        2125 澄迈县
        2126 澜沧拉祜族自治县
        2127 澧县
        2128 澳门特别行政区
        2129 濉溪县
        2130 濠江区
        2131 濮阳县
        2132 濮阳市
        2133 瀍河回族区
        2134 灌云县
        2135 灌南县
        2136 灌阳县
        2137 灞桥区
        2138 灯塔市
        2139 灵丘县
        2140 灵台县
        2141 灵宝市
        2142 灵寿县
        2143 灵山县
        2144 灵川县
        2145 灵武市
        2146 灵璧县
        2147 灵石县
        2148 炉霍县
        2149 炎陵县
        2150 点军区
        2151 烈山区
        2152 烟台市
        2153 焉耆回族自治县
        2154 焦作市
        2155 爱民区
        2156 爱辉区
        2157 牙克石市
        2158 牟定县
        2159 牟平区
        2160 牡丹区
        2161 牡丹江市
        2162 牧野区
        2163 特克斯县
        2164 犍为县
        2165 独山县
        2166 独山子区
        2167 狮子山区
        2168 猇亭区
        2169 献县
        2170 玄武区
        2171 玉屏侗族自治县
        2172 玉山县
        2173 玉州区
        2174 玉林市
        2175 玉树市
        2176 玉树葳族自治州
        2177 玉树藏族自治州
        2178 玉泉区
        2179 玉溪市
        2180 玉环县
        2181 玉田县
        2182 玉门市
        2183 玉龙纳西族自治县
        2184 王益区
        2185 玛多县
        2186 玛曲县
        2187 玛沁县
        2188 玛纳斯县
        2189 环县
        2190 环江毛南族自治县
        2191 环翠区
        2192 珙县
        2193 珠山区
        2194 珠晖区
        2195 珠海市
        2196 班戈县
        2197 班玛县
        2198 珲春市
        2199 琅琊区
        2200 理县
        2201 理塘县
        2202 琼中黎族苗族自治县
        2203 琼山区
        2204 琼海市
        2205 琼结县
        2206 瑞丽市
        2207 瑞安市
        2208 瑞昌市
        2209 瑞金市
        2210 瑶海区
        2211 璧山区
        2212 瓜州县
        2213 瓦房店市
        2214 瓮安县
        2215 瓯海区
        2216 甘井子区
        2217 甘南县
        2218 甘南藏族自治州
        2219 甘孜县
        2220 甘孜藏族自治州
        2221 甘州区
        2222 甘德县
        2223 甘泉县
        2224 甘洛县
        2225 甘肃省
        2226 甘谷县
        2227 生产建设兵团
        2228 田东县
        2229 田家庵区
        2230 田林县
        2231 田阳县
        2232 申扎县
        2233 电白区
        2234 界首市
        2235 留坝县
        2236 略阳县
        2237 番禺区
        2238 疏勒县
        2239 疏附县
        2240 登封市
        2241 白云区
        2242 白云鄂博矿区
        2243 白城市
        2244 白塔区
        2245 白山市
        2246 白朗县
        2247 白水县
        2248 白沙黎族自治县
        2249 白河县
        2250 白玉县
        2251 白碱滩区
        2252 白银区
        2253 白银市
        2254 百色市
        2255 皇姑区
        2256 皋兰县
        2257 皮山县
        2258 盂县
        2259 盈江县
        2260 益阳市
        2261 盐亭县
        2262 盐城市
        2263 盐山县
        2264 盐池县
        2265 盐津县
        2266 盐湖区
        2267 盐源县
        2268 盐田区
        2269 盐边县
        2270 盐都区
        2271 监利县
        2272 盖州市
        2273 盘县
        2274 盘山县
        2275 盘锦市
        2276 盘龙区
        2277 盱眙县
        2278 直报单位
        2279 相城区
        2280 相山区
        2281 省直辖县级行政区划
        2282 眉县
        2283 眉山市
        2284 睢县
        2285 睢宁县
        2286 睢阳区
        2287 石台县
        2288 石嘴山市
        2289 石城县
        2290 石家庄市
        2291 石屏县
        2292 石峰区
        2293 石拐区
        2294 石景山区
        2295 石林彝族自治县
        2296 石柱土家族自治县
        2297 石棉县
        2298 石楼县
        2299 石河子市
        2300 石泉县
        2301 石渠县
        2302 石狮市
        2303 石门县
        2304 石阡县
        2305 石首市
        2306 石鼓区
        2307 石龙区
        2308 矿区
        2309 砀山县
        2310 砚山县
        2311 硚口区
        2312 确山县
        2313 碌曲县
        2314 碑林区
        2315 碧江区
        2316 碾子山区
        2317 磁县
        2318 磐安县
        2319 磐石市
        2320 磴口县
        2321 礼县
        2322 礼泉县
        2323 社旗县
        2324 祁东县
        2325 祁县
        2326 祁连县
        2327 祁门县
        2328 祁阳县
        2329 神农架林区
        2330 神木县
        2331 神池县
        2332 祥云县
        2333 禄丰县
        2334 禄劝彝族苗族自治县
        2335 禅城区
        2336 福安市
        2337 福山区
        2338 福州市
        2339 福建省
        2340 福泉市
        2341 福海县
        2342 福清市
        2343 福田区
        2344 福绵区
        2345 福贡县
        2346 福鼎市
        2347 禹会区
        2348 禹城市
        2349 禹州市
        2350 禹王台区
        2351 离石区
        2352 秀山土家族苗族自治县
        2353 秀屿区
        2354 秀峰区
        2355 秀洲区
        2356 秀英区
        2357 科尔沁区
        2358 科尔沁右翼中旗
        2359 科尔沁右翼前旗
        2360 科尔沁左翼中旗
        2361 科尔沁左翼后旗
        2362 秦安县
        2363 秦州区
        2364 秦淮区
        2365 秦皇岛市
        2366 秦都区
        2367 秭归县
        2368 积石山保安族东乡族撒拉族自治县
        2369 称多县
        2370 稷山县
        2371 稻城县
        2372 穆棱市
        2373 突泉县
        2374 立山区
        2375 站前区
        2376 章丘市
        2377 章贡区
        2378 端州区
        2379 竹山县
        2380 竹溪县
        2381 策勒县
        2382 筠连县
        2383 简阳市
        2384 管城回族区
        2385 米东区
        2386 米易县
        2387 米林县
        2388 米脂县
        2389 类乌齐县
        2390 精河县
        2391 索县
        2392 紫云苗族布依族自治县
        2393 紫金县
        2394 紫阳县
        2395 綦江区
        2396 繁峙县
        2397 繁昌县
        2398 红原县
        2399 红古区
        2400 红塔区
        2401 红安县
        2402 红寺堡区
        2403 红山区
        2404 红岗区
        2405 红旗区
        2406 红星区
        2407 红桥区
        2408 红河县
        2409 红河哈尼族彝族自治州
        2410 红花岗区
        2411 纳溪区
        2412 纳雍县
        2413 细河区
        2414 织金县
        2415 绍兴市
        2416 绛县
        2417 绥中县
        2418 绥化市
        2419 绥宁县
        2420 绥德县
        2421 绥棱县
        2422 绥江县
        2423 绥滨县
        2424 绥芬河市
        2425 绥阳县
        2426 绩溪县
        2427 维西傈僳族自治县
        2428 绵竹市
        2429 绵阳市
        2430 绿园区
        2431 绿春县
        2432 缙云县
        2433 罗城仫佬族自治县
        2434 罗定市
        2435 罗山县
        2436 罗平县
        2437 罗庄区
        2438 罗江县
        2439 罗湖区
        2440 罗源县
        2441 罗田县
        2442 罗甸县
        2443 美兰区
        2444 美姑县
        2445 美溪区
        2446 翁源县
        2447 翁牛特旗
        2448 翔安区
        2449 翠屏区
        2450 翠峦区
        2451 翼城县
        2452 耀州区
        2453 老城区
        2454 老河口市
        2455 老边区
        2456 耒阳市
        2457 耿马傣族佤族自治县
        2458 聂拉木县
        2459 聂荣县
        2460 聊城市
        2461 肃北蒙古族自治县
        2462 肃南裕固族自治县
        2463 肃宁县
        2464 肃州区
        2465 肇东市
        2466 肇州县
        2467 肇庆市
        2468 肇源县
        2469 肥东县
        2470 肥乡县
        2471 肥城市
        2472 肥西县
        2473 胶州市
        2474 能州区
        2475 腾冲县
        2476 自治区直辖县级行政区划
        2477 自流井区
        2478 自贡市
        2479 舒兰市
        2480 舒城县
        2481 舞钢市
        2482 舞阳县
        2483 舟山市
        2484 舟曲县
        2485 船山区
        2486 船营区
        2487 良庆区
        2488 色达县
        2489 芒市
        2490 芒康县
        2491 芗城区
        2492 芙蓉区
        2493 芜湖县
        2494 芜湖市
        2495 芝罘区
        2496 芦山县
        2497 芦淞区
        2498 芦溪县
        2499 芮城县
        2500 花垣县
        2501 花山区
        2502 花溪区
        2503 花都区
        2504 芷江侗族自治县
        2505 苍南县
        2506 苍梧县
        2507 苍溪县
        2508 苏仙区
        2509 苏家屯区
        2510 苏尼特右旗
        2511 苏尼特左旗
        2512 苏州市
        2513 若尔盖县
        2514 若羌县
        2515 英吉沙县
        2516 英山县
        2517 英德市
        2518 茂南区
        2519 茂县
        2520 茂名市
        2521 范县
        2522 茄子河区
        2523 茅箭区
        2524 茌平县
        2525 茶陵县
        2526 荆州区
        2527 荆州市
        2528 荆门市
        2529 荔城区
        2530 荔波县
        2531 荔浦县
        2532 荔湾区
        2533 荣县
        2534 荣成市
        2535 荣昌县
        2536 荥经县
        2537 荥阳市
        2538 荷塘区
        2539 荷泽市
        2540 莆田市
        2541 莎车县
        2542 莒南县
        2543 莒县
        2544 莘县
        2545 莫力达瓦达斡尔族自治旗
        2546 莱城区
        2547 莱山区
        2548 莱州市
        2549 莱羌市
        2550 莱芜市
        2551 莱西市
        2552 莱阳市
        2553 莲湖区
        2554 莲花县
        2555 莲都区
        2556 获嘉县
        2557 菏泽市
        2558 萍乡市
        2559 萝北县
        2560 萝岗区
        2561 营口市
        2562 营山县
        2563 萧县
        2564 萧山区
        2565 萨嘎县
        2566 萨尔图区
        2567 萨迦县
        2568 葫芦岛市
        2569 蒙城县
        2570 蒙山县
        2571 蒙自市
        2572 蒙阴县
        2573 蒲县
        2574 蒲城县
        2575 蒲江县
        2576 蒸湘区
        2577 蓝山县
        2578 蓝田县
        2579 蓟县
        2580 蓬安县
        2581 蓬江区
        2582 蓬溪县
        2583 蓬莱市
        2584 蔚县
        2585 蔡甸区
        2586 蕉城区
        2587 蕉岭县
        2588 蕲春县
        2589 薛城区
        2590 藁城区
        2591 藤县
        2592 虎丘区
        2593 虎林市
        2594 虞城县
        2595 虹口区
        2596 蚌埠市
        2597 蚌山区
        2598 蛟河市
        2599 蜀山区
        2600 融安县
        2601 融水苗族自治县
        2602 蠡县
        2603 行唐县
        2604 衡东县
        2605 衡南县
        2606 衡山县
        2607 衡水市
        2608 衡阳县
        2609 衡阳市
        2610 衢州市
        2611 衢江区
        2612 袁州区
        2613 裕华区
        2614 裕安区
        2615 裕民县
        2616 襄垣县
        2617 襄城区
        2618 襄城县
        2619 襄州区
        2620 襄樊市
        2621 襄汾县
        2622 襄阳市
        2623 西丰县
        2624 西乌珠穆沁旗
        2625 西乡县
        2626 西乡塘区
        2627 西充县
        2628 西区
        2629 西华县
        2630 西双版纳傣族自治州
        2631 西吉县
        2632 西和县
        2633 西固区
        2634 西城区
        2635 西塞山区
        2636 西夏区
        2637 西宁市
        2638 西安区
        2639 西安市
        2640 西山区
        2641 西岗区
        2642 西峡县
        2643 西峰区
        2644 西工区
        2645 西市区
        2646 西平县
        2647 西昌市
        2648 西林区
        2649 西林县
        2650 西湖区
        2651 西畴县
        2652 西盟佤族自治县
        2653 西秀区
        2654 西藏自治区
        2655 西陵区
        2656 西青区
        2657 覃塘区
        2658 观山湖区
        2659 解放区
        2660 让胡路区
        2661 讷河市
        2662 许昌县
        2663 许昌市
        2664 诏安县
        2665 诲北藏族自治州
        2666 诲淀区
        2667 诸城市
        2668 诸暨市
        2669 调兵山市
        2670 谢家集区
        2671 谢通门县
        2672 谯城区
        2673 谷城县
        2674 象山区
        2675 象山县
        2676 象州县
        2677 贞丰县
        2678 贡井区
        2679 贡嘎县
        2680 贡山独龙族怒族自治县
        2681 贡觉县
        2682 责州省
        2683 贵南县
        2684 贵定县
        2685 贵州省
        2686 贵德县
        2687 贵池区
        2688 贵港市
        2689 贵溪市
        2690 贵阳市
        2691 费县
        2692 贺兰县
        2693 贺州市
        2694 贾汪区
        2695 资中县
        2696 资兴市
        2697 资源县
        2698 资溪县
        2699 资阳区
        2700 资阳市
        2701 赛罕区
        2702 赞皇县
        2703 赣县
        2704 赣州市
        2705 赣榆区
        2706 赤坎区
        2707 赤城县
        2708 赤壁市
        2709 赤峰市
        2710 赤水市
        2711 赤蜂市
        2712 赫山区
        2713 赫章县
        2714 赵县
        2715 越城区
        2716 越秀区
        2717 越西县
        2718 路北区
        2719 路南区
        2720 路桥区
        2721 轮台县
        2722 辉南县
        2723 辉县市
        2724 输林市
        2725 辛集市
        2726 辰溪县
        2727 边坝县
        2728 辽中县
        2729 辽宁省
        2730 辽源市
        2731 辽阳县
        2732 辽阳市
        2733 达坂城区
        2734 达孜县
        2735 达尔罕茂明安联合旗
        2736 达川区
        2737 达州市
        2738 达拉特旗
        2739 达日县
        2740 迁安市
        2741 迁西县
        2742 迎江区
        2743 迎泽区
        2744 运城市
        2745 运河区
        2746 进贤县
        2747 远安县
        2748 远洋捕捞
        2749 连云区
        2750 连云港市
        2751 连南瑶族自治县
        2752 连城县
        2753 连山区
        2754 连山壮族瑶族自治县
        2755 连州市
        2756 连平县
        2757 连江县
        2758 迪庆藏族自治州
        2759 迭部县
        2760 逊克县
        2761 通化县
        2762 通化市
        2763 通城县
        2764 通山县
        2765 通川区
        2766 通州区
        2767 通榆县
        2768 通江县
        2769 通河县
        2770 通海县
        2771 通渭县
        2772 通许县
        2773 通辽市
        2774 通道侗族自治县
        2775 遂宁市
        2776 遂川县
        2777 遂平县
        2778 遂昌县
        2779 遂溪县
        2780 道县
        2781 道外区
        2782 道孚县
        2783 道真仡佬族苗族自治县
        2784 道里区
        2785 遵义县
        2786 遵义市
        2787 遵化市
        2788 邓州市
        2789 邕宁区
        2790 邗江区
        2791 邛崃市
        2792 邢台县
        2793 邢台市
        2794 那坡县
        2795 那曲县
        2796 那曲地区
        2797 邪曲地区
        2798 邯山区
        2799 邯郸县
        2800 邯郸市
        2801 邱县
        2802 邳州市
        2803 邵东县
        2804 邵武市
        2805 邵阳县
        2806 邵阳市
        2807 邹城市
        2808 邹平县
        2809 邻水县
        2810 郁南县
        2811 郊区
        2812 郎溪县
        2813 郏县
        2814 郑州市
        2815 郓城县
        2816 郧西县
        2817 郧阳区
        2818 郫县
        2819 郯城县
        2820 郴州市
        2821 郸城县
        2822 都兰县
        2823 都匀市
        2824 都安瑶族自治县
        2825 都昌县
        2826 都江堰市
        2827 郾城区
        2828 鄂伦春自治旗
        2829 鄂城区
        2830 鄂尔多斯市
        2831 鄂州市
        2832 鄂托克前旗
        2833 鄂托克旗
        2834 鄂温克族自治旗
        2835 鄄城县
        2836 鄞州区
        2837 鄢陵县
        2838 鄯善县
        2839 鄱阳县
        2840 酉阳土家族苗族自治县
        2841 酒泉市
        2842 醴陵市
        2843 重庆市
        2844 金东区
        2845 金乡县
        2846 金凤区
        2847 金华市
        2848 金口河区
        2849 金台区
        2850 金坛市
        2851 金城江区
        2852 金堂县
        2853 金塔县
        2854 金安区
        2855 金寨县
        2856 金山区
        2857 金山屯区
        2858 金川区
        2859 金川县
        2860 金州区
        2861 金平区
        2862 金平苗族瑶族傣族自治县
        2863 金昌市
        2864 金明区
        2865 金水区
        2866 金沙县
        2867 金湖县
        2868 金湾区
        2869 金溪县
        2870 金牛区
        2871 金秀瑶族自治县
        2872 金门县
        2873 金阳县
        2874 钟山区
        2875 钟山县
        2876 钟楼区
        2877 钟祥市
        2878 钢城区
        2879 钦北区
        2880 钦南区
        2881 钦州市
        2882 铁东区
        2883 铁力市
        2884 铁山区
        2885 铁山港区
        2886 铁岭县
        2887 铁岭市
        2888 铁西区
        2889 铁锋区
        2890 铁门关市
        2891 铅山县
        2892 铜仁地区
        2893 铜仁市
        2894 铜官山区
        2895 铜山区
        2896 铜川市
        2897 铜梁区
        2898 铜陵县
        2899 铜陵市
        2900 铜鼓县
        2901 银川市
        2902 银州区
        2903 银海区
        2904 错那县
        2905 锡山区
        2906 锡林浩特市
        2907 锡林郭勒盟
        2908 锦屏县
        2909 锦州市
        2910 锦江区
        2911 镇原县
        2912 镇坪县
        2913 镇宁布依族苗族自治县
        2914 镇安县
        2915 镇巴县
        2916 镇平县
        2917 镇康县
        2918 镇江市
        2919 镇沅彝族哈尼族拉祜族自治县
        2920 镇海区
        2921 镇赉县
        2922 镇远县
        2923 镇雄县
        2924 镜湖区
        2925 镶黄旗
        2926 长丰县
        2927 长乐市
        2928 长兴县
        2929 长垣县
        2930 长子县
        2931 长宁区
        2932 长宁县
        2933 长安区
        2934 长寿区
        2935 长岛县
        2936 长岭县
        2937 长春市
        2938 长武县
        2939 长汀县
        2940 长沙县
        2941 长沙市
        2942 长治县
        2943 长治市
        2944 长泰县
        2945 长洲区
        2946 长海县
        2947 长清区
        2948 长白朝鲜族自治县
        2949 长葛市
        2950 长阳土家族自治县
        2951 长顺县
        2952 门头沟区
        2953 门源回族自治县
        2954 闵行区
        2955 闸北区
        2956 闻喜县
        2957 闽侯县
        2958 闽清县
        2959 阂行区
        2960 阆中市
        2961 阎良区
        2962 阜南县
        2963 阜城县
        2964 阜宁县
        2965 阜平县
        2966 阜康市
        2967 阜新市
        2968 阜新蒙古族自治县
        2969 阜阳市
        2970 防城区
        2971 防城港市
        2972 阳东县
        2973 阳信县
        2974 阳原县
        2975 阳城县
        2976 阳山县
        2977 阳新县
        2978 阳明区
        2979 阳春市
        2980 阳曲县
        2981 阳朔县
        2982 阳江市
        2983 阳泉市
        2984 阳西县
        2985 阳谷县
        2986 阳高县
        2987 阿克塞哈萨克族自治县
        2988 阿克苏地区
        2989 阿克苏市
        2990 阿克陶县
        2991 阿勒泰地区
        2992 阿勒泰市
        2993 阿合奇县
        2994 阿图什市
        2995 阿坝县
        2996 阿坝藏族羌族自治州
        2997 阿城区
        2998 阿尔山市
        2999 阿巴嘎旗
        3000 阿拉善右旗
        3001 阿拉善左旗
        3002 阿拉善盟
        3003 阿拉尔市
        3004 阿拉山口市
        3005 阿瓦提县
        3006 阿荣旗
        3007 阿里地区
        3008 阿鲁科尔沁旗
        3009 陆丰市
        3010 陆川县
        3011 陆河县
        3012 陆良县
        3013 陇南市
        3014 陇县
        3015 陇川县
        3016 陇西县
        3017 陈仓区
        3018 陈巴尔虎旗
        3019 陕县
        3020 陕西省
        3021 陵城区
        3022 陵川县
        3023 陵水黎族自治县
        3024 隆化县
        3025 隆回县
        3026 隆子县
        3027 隆安县
        3028 隆尧县
        3029 隆德县
        3030 隆昌县
        3031 隆林各族自治县
        3032 隆阳区
        3033 随县
        3034 随州市
        3035 隰县
        3036 雁塔区
        3037 雁山区
        3038 雁峰区
        3039 雁江区
        3040 雄县
        3041 雅安市
        3042 雅江县
        3043 集宁区
        3044 集安市
        3045 集美区
        3046 集贤县
        3047 雨城区
        3048 雨山区
        3049 雨湖区
        3050 雨花区
        3051 雨花台区
        3052 零陵区
        3053 雷山县
        3054 雷州市
        3055 雷波县
        3056 霍城县
        3057 霍山县
        3058 霍州市
        3059 霍林郭勒市
        3060 霍邱县
        3061 霞山区
        3062 霞浦县
        3063 霸州市
        3064 青云谱区
        3065 青冈县
        3066 青原区
        3067 青县
        3068 青山区
        3069 青山湖区
        3070 青岛市
        3071 青川县
        3072 青州市
        3073 青河县
        3074 青浦区
        3075 青海省
        3076 青田县
        3077 青白江区
        3078 青神县
        3079 青秀区
        3080 青羊区
        3081 青铜峡市
        3082 青阳县
        3083 青龙满族自治县
        3084 靖宇县
        3085 靖安县
        3086 靖州苗族侗族自治县
        3087 靖江市
        3088 靖西县
        3089 靖边县
        3090 靖远县
        3091 静乐县
        3092 静宁县
        3093 静安区
        3094 静海县
        3095 革吉县
        3096 鞍山市
        3097 韩城市
        3098 韶关市
        3099 韶山市
        3100 项城市
        3101 顺义区
        3102 顺城区
        3103 顺平县
        3104 顺庆区
        3105 顺德区
        3106 顺昌县
        3107 顺河回族区
        3108 颍上县
        3109 颍东区
        3110 颍州区
        3111 颍泉区
        3112 额尔古纳市
        3113 额敏县
        3114 额济纳旗
        3115 饶平县
        3116 饶河县
        3117 饶阳县
        3118 馆陶县
        3119 香坊区
        3120 香格里拉县
        3121 香河县
        3122 香洲区
        3123 香港特别行政区
        3124 马关县
        3125 马尔康县
        3126 马尾区
        3127 马山县
        3128 马村区
        3129 马边彝族自治县
        3130 马鞍山市
        3131 马龙县
        3132 驻马店市
        3133 驿城区
        3134 高县
        3135 高台县
        3136 高唐县
        3137 高坪区
        3138 高安市
        3139 高密市
        3140 高州市
        3141 高平市
        3142 高明区
        3143 高淳区
        3144 高港区
        3145 高碑店市
        3146 高要市
        3147 高邑县
        3148 高邮市
        3149 高阳县
        3150 高陵县
        3151 高青县
        3152 魏县
        3153 魏都区
        3154 鱼台县
        3155 鱼峰区
        3156 鲁山县
        3157 鲁甸县
        3158 鲅鱼圈区
        3159 鲤城区
        3160 鸟兰察布市
        3161 鸠江区
        3162 鸡东县
        3163 鸡冠区
        3164 鸡泽县
        3165 鸡西市
        3166 鹤城区
        3167 鹤壁市
        3168 鹤山区
        3169 鹤山市
        3170 鹤岗市
        3171 鹤峰县
        3172 鹤庆县
        3173 鹰手营子矿区
        3174 鹰潭市
        3175 鹿城区
        3176 鹿寨县
        3177 鹿泉区
        3178 鹿邑县
        3179 麒麟区
        3180 麟游县
        3181 麦盖提县
        3182 麦积区
        3183 麻城市
        3184 麻山区
        3185 麻栗坡县
        3186 麻江县
        3187 麻章区
        3188 麻阳苗族自治县
        3189 黄冈市
        3190 黄南藏族自治州
        3191 黄埔区
        3192 黄山区
        3193 黄山市
        3194 黄岛区
        3195 黄岩区
        3196 黄州区
        3197 黄平县
        3198 黄梅县
        3199 黄浦区
        3200 黄石市
        3201 黄石港区
        3202 黄陂区
        3203 黄陵县
        3204 黄骅市
        3205 黄龙县
        3206 黎城县
        3207 黎川县
        3208 黎平县
        3209 黑山县
        3210 黑水县
        3211 黑河市
        3212 黑龙江省
        3213 黔东南苗族侗族自治州
        3214 黔南布依族苗族自治州
        3215 黔江区
        3216 黔西南布依族苗族自治州
        3217 黔西县
        3218 黟县
        3219 鼎城区
        3220 鼎湖区
        3221 鼓楼区
        3222 齐河县
        3223 齐齐哈尔市
        3224 龙井市
        3225 龙亭区
        3226 龙凤区
        3227 龙华区
        3228 龙南县
        3229 龙口市
        3230 龙圩区
        3231 龙城区
        3232 龙子湖区
        3233 龙安区
        3234 龙山区
        3235 龙山县
        3236 龙岗区
        3237 龙岩市
        3238 龙川县
        3239 龙州县
        3240 龙文区
        3241 龙江县
        3242 龙沙区
        3243 龙泉市
        3244 龙泉驿区
        3245 龙海市
        3246 龙港区
        3247 龙游县
        3248 龙湖区
        3249 龙湾区
        3250 龙潭区
        3251 龙胜各族自治县
        3252 龙里县
        3253 龙门县
        3254 龙陵县
        3255 龙马潭区

{com}.    label list in 1/10
{err}invalid syntax
{txt}{search r(198):r(198);}

{com}. label list
{txt}_merge:
{res}           1 master only (1)
           2 using only (2)
           3 matched (3)
           4 missing updated (4)
           5 nonmissing conflict (5)
{txt}cit:
{res}           1 丁青县
           2 七台河市
           3 七星关区
           4 七星区
           5 七里河区
           6 万全县
           7 万宁市
           8 万安县
           9 万山区
          10 万州区
          11 万年县
          12 万柏林区
          13 万源市
          14 万盛区
          15 万秀区
          16 万荣县
{err}{hline 2}Break{hline 2}
{txt}{search r(1):r(1);}

{com}. tab _m

                 {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 24}{c +}{hline 35}
            matched (3) {c |}{res}      3,336      100.00      100.00
{txt}{hline 24}{c +}{hline 35}
                  Total {c |}{res}      3,336      100.00

{com}. pwd
{res}F:\git\stata\output\31May2017

{com}. labelbook
{err}in not found
{txt}{search r(111):r(111);}

{com}. labelcook
{err}command {bf}labelcook{sf} is unrecognized
{txt}{search r(199):r(199);}

{com}. describe

{txt}Contains data from {res}F:\data\pf\city_quyu.dta
{txt}  obs:{res}         3,336                          
{txt} vars:{res}           118                          31 May 2017 09:54
{txt} size:{res}     4,049,904                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:city           }{txt}{bind: str80   }{bind:{txt}%80s      }{space 1}{bind:         }{bind:  }{res}{res}原始文件城市名{p_end}
{p 0 48}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}年份{p_end}
{p 0 48}{bind:city1          }{txt}{bind: str9    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}城市前三个字{p_end}
{p 0 48}{bind:land           }{txt}{bind: str43   }{bind:{txt}%43s      }{space 1}{bind:         }{bind:  }{res}{res}土地面积+平方公里{p_end}
{p 0 48}{bind:pop            }{txt}{bind: str70   }{bind:{txt}%70s      }{space 1}{bind:         }{bind:  }{res}{res}年底总人口+万人{p_end}
{p 0 48}{bind:pop_male       }{txt}{bind: str17   }{bind:{txt}%17s      }{space 1}{bind:         }{bind:  }{res}{res}男+万人{p_end}
{p 0 48}{bind:pop_female     }{txt}{bind: str17   }{bind:{txt}%17s      }{space 1}{bind:         }{bind:  }{res}{res}女+万人{p_end}
{p 0 48}{bind:pop_birth      }{txt}{bind: str57   }{bind:{txt}%57s      }{space 1}{bind:         }{bind:  }{res}{res}出生人口+万人{p_end}
{p 0 48}{bind:pop_death      }{txt}{bind: str58   }{bind:{txt}%58s      }{space 1}{bind:         }{bind:  }{res}{res}死亡人口+万人{p_end}
{p 0 48}{bind:family         }{txt}{bind: str74   }{bind:{txt}%74s      }{space 1}{bind:         }{bind:  }{res}{res}年底总户数+万户{p_end}
{p 0 48}{bind:gdp            }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}地区生产总值+亿元{p_end}
{p 0 48}{bind:gdp_pri        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第一产业生产总值+亿元{p_end}
{p 0 48}{bind:gdp_sec        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第二产业生产总值+亿元{p_end}
{p 0 48}{bind:gdp_ind        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业生产总值+亿元{p_end}
{p 0 48}{bind:gdp_thi        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第三产业生产总值+亿元{p_end}
{p 0 48}{bind:gdp_per        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}人均地区生产总值+元{p_end}
{p 0 48}{bind:gdp_index      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}地区生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_pri  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第一产业生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_sec  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第二产业生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_ind  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_thi  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第三产业生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_per  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}人均地区生产总值指数+上年=100{p_end}
{p 0 48}{bind:investment     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}全社会固定资产投资+亿元{p_end}
{p 0 48}{bind:investment_ur~n}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}固定资产投资（不含农户）+亿元{p_end}
{p 0 48}{bind:investment_re~e}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#开发+亿元{p_end}
{p 0 48}{bind:investment_ru~l}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}农村+亿元{p_end}
{p 0 48}{bind:fisrev         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}公共财政预算收入+亿元{p_end}
{p 0 48}{bind:fisrev_tax     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#税收收入+亿元{p_end}
{p 0 48}{bind:fisrev_tax_vat }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#国内增值税+亿元{p_end}
{p 0 48}{bind:fisrev_tax_op  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#营业税+亿元{p_end}
{p 0 48}{bind:fisrev_tax_firm}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#企业所得税+亿元{p_end}
{p 0 48}{bind:fisrev_tax_pe~n}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#个人所得税+亿元{p_end}
{p 0 48}{bind:fisexp         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}公共财政预算支出+亿元{p_end}
{p 0 48}{bind:fisexp_edu     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#教育{p_end}
{p 0 48}{bind:fisexp_security}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#社会保障和就业{p_end}
{p 0 48}{bind:income_rural   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}农村居民人均可支配收入+元{p_end}
{p 0 48}{bind:expend_rural   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}农村居民人均消费支出+元{p_end}
{p 0 48}{bind:expend_rural_~d}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#食品支出{p_end}
{p 0 48}{bind:income_urban   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}城镇居民人均可支配收入+元{p_end}
{p 0 48}{bind:expend_urban   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}城镇居民人均消费支出+元{p_end}
{p 0 48}{bind:expend_urban_~d}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#食品支出{p_end}
{p 0 48}{bind:num_ind        }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}规模以上工业企业单位数+个{p_end}
{p 0 48}{bind:num_ind_large  }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#大型企业+个{p_end}
{p 0 48}{bind:num_ind_medium }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}中型企业+个{p_end}
{p 0 48}{bind:num_ind_small  }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}小型企业+个{p_end}
{p 0 48}{bind:output_ind     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业总产值+亿元{p_end}
{p 0 48}{bind:output_ind_st~e}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#国有及国有控股+亿元{p_end}
{p 0 48}{bind:output_ind_do~c}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#内资企业+亿元{p_end}
{p 0 48}{bind:output_ind_hmt }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}港澳台商投资企业+亿元{p_end}
{p 0 48}{bind:output_ind_frn }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}外商投资企业+亿元{p_end}
{p 0 48}{bind:inc_ind        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业企业增加值+亿元{p_end}
{p 0 48}{bind:index_inc_ind  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业企业增加值指数+上年=100{p_end}
{p 0 48}{bind:asset          }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#资产合计+亿元{p_end}
{p 0 48}{bind:debt           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#负债合计+亿元{p_end}
{p 0 48}{bind:revenue        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#主营业务收入+亿元{p_end}
{p 0 48}{bind:profit         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#利润总额+亿元{p_end}
{p 0 48}{bind:miles          }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}公里里程+公里{p_end}
{p 0 48}{bind:miles_grade    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#等级公路+公里{p_end}
{p 0 48}{bind:veh_civil      }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}民用汽车拥有量+辆{p_end}
{p 0 48}{bind:veh_private    }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#私人汽车+辆{p_end}
{p 0 48}{bind:post_telecom   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}邮电业务总量+亿元{p_end}
{p 0 48}{bind:telecom        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}电信业务总量+亿元{p_end}
{p 0 48}{bind:landline       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}固定电话用户+万户{p_end}
{p 0 48}{bind:mobile         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}移动电话用户+万户{p_end}
{p 0 48}{bind:im_ex_port     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}货物进出口总额+万美元{p_end}
{p 0 48}{bind:import         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}进口额+万美元{p_end}
{p 0 48}{bind:export         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}出口额+万美元{p_end}
{p 0 48}{bind:fdi            }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}外商直接投资实际使用额+万美元{p_end}
{p 0 48}{bind:savings        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}金融机构人民币存款+亿元{p_end}
{p 0 48}{bind:savings_firm   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#企业存款{p_end}
{p 0 48}{bind:savings_resid~t}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#居民储蓄存款{p_end}
{p 0 48}{bind:savings_fixed  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) #定期TimeDeposits{p_end}
{p 0 48}{bind:loan           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) 金融机构人民币贷款(亿元)TotalLoans(100millionyuan){p_end}
{p 0 48}{bind:loan_ind       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) #工业贷款LoanstoIndus-trial{p_end}
{p 0 48}{bind:loan_busi      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) #商业贷款LoanstoCom-mercial{p_end}
{p 0 48}{bind:loan_agri      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) #农业贷款LoanstoAgricul-tural{p_end}
{p 0 48}{bind:fisexp_agri    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#农林水利事务{p_end}
{p 0 48}{bind:fisexp_health  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#医疗卫生{p_end}
{p 0 48}{bind:house_rural    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}农村人均住房面积+平方米{p_end}
{p 0 48}{bind:q9_1_4         }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#国有及国有控股+个{p_end}
{p 0 48}{bind:num_ind_dom    }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}内资企业+个{p_end}
{p 0 48}{bind:num_ind_hmt    }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}港澳台商投资企业+个{p_end}
{p 0 48}{bind:num_ind_frn    }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}外商投资企业+个{p_end}
{p 0 48}{bind:output_ind_la~e}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#大型企业+亿元{p_end}
{p 0 48}{bind:output_ind_me~m}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}中型企业+亿元{p_end}
{p 0 48}{bind:output_ind_sm~l}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}小型企业+亿元{p_end}
{p 0 48}{bind:total_equity   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#所有者权益+亿元{p_end}
{p 0 48}{bind:total_vat      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#本年应交增值税+亿元{p_end}
{p 0 48}{bind:num_employee   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}从业人员年平均人数{p_end}
{p 0 48}{bind:internet       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}互联网宽带接入用户数+万户{p_end}
{p 0 48}{bind:pop_per        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}常住人口+万人{p_end}
{p 0 48}{bind:output_ind_li~t}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#轻工业+亿元{p_end}
{p 0 48}{bind:output_ind_he~y}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}重工业+亿元{p_end}
{p 0 48}{bind:savings_rmbfrn }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}金融机构本外币存款+亿元{p_end}
{p 0 48}{bind:savings_cur    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#活期{p_end}
{p 0 48}{bind:loan_rmbfrn    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}金融机构本外币贷款+亿元{p_end}
{p 0 48}{bind:q12_5_1        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}境内贷款{p_end}
{p 0 48}{bind:loan_short     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#短期贷款+亿元{p_end}
{p 0 48}{bind:loan_long      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#中长期贷款+亿元{p_end}
{p 0 48}{bind:loan_frn       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}境外贷款{p_end}
{p 0 48}{bind:comhouse_sales }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}商品房销售额+亿元{p_end}
{p 0 48}{bind:house_sales    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#住宅+亿元{p_end}
{p 0 48}{bind:comhouse_sale~a}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}商品房销售面积+万平方米{p_end}
{p 0 48}{bind:house_sales_a~a}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#住宅+万平方米{p_end}
{p 0 48}{bind:house_area_ur~n}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}城镇人均住房建筑面积+平方米{p_end}
{p 0 48}{bind:post           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}邮政业务总量+亿元{p_end}
{p 0 48}{bind:savings_danwei }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#单位存款{p_end}
{p 0 48}{bind:savings_geren  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#个人存款{p_end}
{p 0 48}{bind:savings_deposit}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#储蓄存款{p_end}
{p 0 48}{bind:house_security }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#住房保障{p_end}
{p 0 48}{bind:cost           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#主营业务成本+亿元{p_end}
{p 0 48}{bind:code           }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}行政代码{p_end}
{p 0 48}{bind:city_shortname }{txt}{bind: str6    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}城市名称的前两个汉字{p_end}
{p 0 48}{bind:prov           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}省份代码{p_end}
{p 0 48}{bind:pref           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}地级市代码{p_end}
{p 0 48}{bind:level          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}地区的行政级别，1表示省级，2表示地级市，3表示县级市{p_end}
{p 0 48}{bind:_merge         }{txt}{bind: byte    }{bind:{txt}%23.0g    }{space 1}{bind:_merge   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cit            }{txt}{bind: long    }{bind:{txt}%74.0g    }{space 1}{bind:cit      }{bind:  }{res}{res}原始文件城市名{p_end}
{txt}{hline}
Sorted by: {res}cit  year
     Note: Dataset has changed since last saved.

{com}. export excel name varlab using test.xlsx, firstrow(variables) replace
{err}variable {bf}name{sf} not found
{txt}{search r(111):r(111);}

{com}. set more off

. export excel name varlab using test.xlsx, firstrow(variables) replace
{err}variable {bf}name{sf} not found
{txt}{search r(111):r(111);}

{com}. describe

{txt}Contains data from {res}F:\data\pf\city_quyu.dta
{txt}  obs:{res}         3,336                          
{txt} vars:{res}           118                          31 May 2017 09:54
{txt} size:{res}     4,049,904                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:city           }{txt}{bind: str80   }{bind:{txt}%80s      }{space 1}{bind:         }{bind:  }{res}{res}原始文件城市名{p_end}
{p 0 48}{bind:year           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}年份{p_end}
{p 0 48}{bind:city1          }{txt}{bind: str9    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}城市前三个字{p_end}
{p 0 48}{bind:land           }{txt}{bind: str43   }{bind:{txt}%43s      }{space 1}{bind:         }{bind:  }{res}{res}土地面积+平方公里{p_end}
{p 0 48}{bind:pop            }{txt}{bind: str70   }{bind:{txt}%70s      }{space 1}{bind:         }{bind:  }{res}{res}年底总人口+万人{p_end}
{p 0 48}{bind:pop_male       }{txt}{bind: str17   }{bind:{txt}%17s      }{space 1}{bind:         }{bind:  }{res}{res}男+万人{p_end}
{p 0 48}{bind:pop_female     }{txt}{bind: str17   }{bind:{txt}%17s      }{space 1}{bind:         }{bind:  }{res}{res}女+万人{p_end}
{p 0 48}{bind:pop_birth      }{txt}{bind: str57   }{bind:{txt}%57s      }{space 1}{bind:         }{bind:  }{res}{res}出生人口+万人{p_end}
{p 0 48}{bind:pop_death      }{txt}{bind: str58   }{bind:{txt}%58s      }{space 1}{bind:         }{bind:  }{res}{res}死亡人口+万人{p_end}
{p 0 48}{bind:family         }{txt}{bind: str74   }{bind:{txt}%74s      }{space 1}{bind:         }{bind:  }{res}{res}年底总户数+万户{p_end}
{p 0 48}{bind:gdp            }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}地区生产总值+亿元{p_end}
{p 0 48}{bind:gdp_pri        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第一产业生产总值+亿元{p_end}
{p 0 48}{bind:gdp_sec        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第二产业生产总值+亿元{p_end}
{p 0 48}{bind:gdp_ind        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业生产总值+亿元{p_end}
{p 0 48}{bind:gdp_thi        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第三产业生产总值+亿元{p_end}
{p 0 48}{bind:gdp_per        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}人均地区生产总值+元{p_end}
{p 0 48}{bind:gdp_index      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}地区生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_pri  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第一产业生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_sec  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第二产业生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_ind  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_thi  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}第三产业生产总值指数+上年=100{p_end}
{p 0 48}{bind:gdp_index_per  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}人均地区生产总值指数+上年=100{p_end}
{p 0 48}{bind:investment     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}全社会固定资产投资+亿元{p_end}
{p 0 48}{bind:investment_ur~n}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}固定资产投资（不含农户）+亿元{p_end}
{p 0 48}{bind:investment_re~e}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#开发+亿元{p_end}
{p 0 48}{bind:investment_ru~l}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}农村+亿元{p_end}
{p 0 48}{bind:fisrev         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}公共财政预算收入+亿元{p_end}
{p 0 48}{bind:fisrev_tax     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#税收收入+亿元{p_end}
{p 0 48}{bind:fisrev_tax_vat }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#国内增值税+亿元{p_end}
{p 0 48}{bind:fisrev_tax_op  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#营业税+亿元{p_end}
{p 0 48}{bind:fisrev_tax_firm}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#企业所得税+亿元{p_end}
{p 0 48}{bind:fisrev_tax_pe~n}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#个人所得税+亿元{p_end}
{p 0 48}{bind:fisexp         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}公共财政预算支出+亿元{p_end}
{p 0 48}{bind:fisexp_edu     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#教育{p_end}
{p 0 48}{bind:fisexp_security}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#社会保障和就业{p_end}
{p 0 48}{bind:income_rural   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}农村居民人均可支配收入+元{p_end}
{p 0 48}{bind:expend_rural   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}农村居民人均消费支出+元{p_end}
{p 0 48}{bind:expend_rural_~d}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#食品支出{p_end}
{p 0 48}{bind:income_urban   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}城镇居民人均可支配收入+元{p_end}
{p 0 48}{bind:expend_urban   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}城镇居民人均消费支出+元{p_end}
{p 0 48}{bind:expend_urban_~d}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#食品支出{p_end}
{p 0 48}{bind:num_ind        }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}规模以上工业企业单位数+个{p_end}
{p 0 48}{bind:num_ind_large  }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#大型企业+个{p_end}
{p 0 48}{bind:num_ind_medium }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}中型企业+个{p_end}
{p 0 48}{bind:num_ind_small  }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}小型企业+个{p_end}
{p 0 48}{bind:output_ind     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业总产值+亿元{p_end}
{p 0 48}{bind:output_ind_st~e}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#国有及国有控股+亿元{p_end}
{p 0 48}{bind:output_ind_do~c}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#内资企业+亿元{p_end}
{p 0 48}{bind:output_ind_hmt }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}港澳台商投资企业+亿元{p_end}
{p 0 48}{bind:output_ind_frn }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}外商投资企业+亿元{p_end}
{p 0 48}{bind:inc_ind        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业企业增加值+亿元{p_end}
{p 0 48}{bind:index_inc_ind  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}工业企业增加值指数+上年=100{p_end}
{p 0 48}{bind:asset          }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#资产合计+亿元{p_end}
{p 0 48}{bind:debt           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#负债合计+亿元{p_end}
{p 0 48}{bind:revenue        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#主营业务收入+亿元{p_end}
{p 0 48}{bind:profit         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#利润总额+亿元{p_end}
{p 0 48}{bind:miles          }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}公里里程+公里{p_end}
{p 0 48}{bind:miles_grade    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#等级公路+公里{p_end}
{p 0 48}{bind:veh_civil      }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}民用汽车拥有量+辆{p_end}
{p 0 48}{bind:veh_private    }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#私人汽车+辆{p_end}
{p 0 48}{bind:post_telecom   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}邮电业务总量+亿元{p_end}
{p 0 48}{bind:telecom        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}电信业务总量+亿元{p_end}
{p 0 48}{bind:landline       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}固定电话用户+万户{p_end}
{p 0 48}{bind:mobile         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}移动电话用户+万户{p_end}
{p 0 48}{bind:im_ex_port     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}货物进出口总额+万美元{p_end}
{p 0 48}{bind:import         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}进口额+万美元{p_end}
{p 0 48}{bind:export         }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}出口额+万美元{p_end}
{p 0 48}{bind:fdi            }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}外商直接投资实际使用额+万美元{p_end}
{p 0 48}{bind:savings        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}金融机构人民币存款+亿元{p_end}
{p 0 48}{bind:savings_firm   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#企业存款{p_end}
{p 0 48}{bind:savings_resid~t}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#居民储蓄存款{p_end}
{p 0 48}{bind:savings_fixed  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) #定期TimeDeposits{p_end}
{p 0 48}{bind:loan           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) 金融机构人民币贷款(亿元)TotalLoans(100millionyuan){p_end}
{p 0 48}{bind:loan_ind       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) #工业贷款LoanstoIndus-trial{p_end}
{p 0 48}{bind:loan_busi      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) #商业贷款LoanstoCom-mercial{p_end}
{p 0 48}{bind:loan_agri      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}(亿元) #农业贷款LoanstoAgricul-tural{p_end}
{p 0 48}{bind:fisexp_agri    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#农林水利事务{p_end}
{p 0 48}{bind:fisexp_health  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#医疗卫生{p_end}
{p 0 48}{bind:house_rural    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}农村人均住房面积+平方米{p_end}
{p 0 48}{bind:q9_1_4         }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#国有及国有控股+个{p_end}
{p 0 48}{bind:num_ind_dom    }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}内资企业+个{p_end}
{p 0 48}{bind:num_ind_hmt    }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}港澳台商投资企业+个{p_end}
{p 0 48}{bind:num_ind_frn    }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}外商投资企业+个{p_end}
{p 0 48}{bind:output_ind_la~e}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#大型企业+亿元{p_end}
{p 0 48}{bind:output_ind_me~m}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}中型企业+亿元{p_end}
{p 0 48}{bind:output_ind_sm~l}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}小型企业+亿元{p_end}
{p 0 48}{bind:total_equity   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#所有者权益+亿元{p_end}
{p 0 48}{bind:total_vat      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#本年应交增值税+亿元{p_end}
{p 0 48}{bind:num_employee   }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}从业人员年平均人数{p_end}
{p 0 48}{bind:internet       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}互联网宽带接入用户数+万户{p_end}
{p 0 48}{bind:pop_per        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}常住人口+万人{p_end}
{p 0 48}{bind:output_ind_li~t}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#轻工业+亿元{p_end}
{p 0 48}{bind:output_ind_he~y}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}重工业+亿元{p_end}
{p 0 48}{bind:savings_rmbfrn }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}金融机构本外币存款+亿元{p_end}
{p 0 48}{bind:savings_cur    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#活期{p_end}
{p 0 48}{bind:loan_rmbfrn    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}金融机构本外币贷款+亿元{p_end}
{p 0 48}{bind:q12_5_1        }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}境内贷款{p_end}
{p 0 48}{bind:loan_short     }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#短期贷款+亿元{p_end}
{p 0 48}{bind:loan_long      }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#中长期贷款+亿元{p_end}
{p 0 48}{bind:loan_frn       }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}境外贷款{p_end}
{p 0 48}{bind:comhouse_sales }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}商品房销售额+亿元{p_end}
{p 0 48}{bind:house_sales    }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#住宅+亿元{p_end}
{p 0 48}{bind:comhouse_sale~a}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}商品房销售面积+万平方米{p_end}
{p 0 48}{bind:house_sales_a~a}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#住宅+万平方米{p_end}
{p 0 48}{bind:house_area_ur~n}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}城镇人均住房建筑面积+平方米{p_end}
{p 0 48}{bind:post           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}邮政业务总量+亿元{p_end}
{p 0 48}{bind:savings_danwei }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#单位存款{p_end}
{p 0 48}{bind:savings_geren  }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#个人存款{p_end}
{p 0 48}{bind:savings_deposit}{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#储蓄存款{p_end}
{p 0 48}{bind:house_security }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#住房保障{p_end}
{p 0 48}{bind:cost           }{txt}{bind: double  }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}#主营业务成本+亿元{p_end}
{p 0 48}{bind:code           }{txt}{bind: long    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}行政代码{p_end}
{p 0 48}{bind:city_shortname }{txt}{bind: str6    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}城市名称的前两个汉字{p_end}
{p 0 48}{bind:prov           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}省份代码{p_end}
{p 0 48}{bind:pref           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}地级市代码{p_end}
{p 0 48}{bind:level          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}地区的行政级别，1表示省级，2表示地级市，3表示县级市{p_end}
{p 0 48}{bind:_merge         }{txt}{bind: byte    }{bind:{txt}%23.0g    }{space 1}{bind:_merge   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:cit            }{txt}{bind: long    }{bind:{txt}%74.0g    }{space 1}{bind:cit      }{bind:  }{res}{res}原始文件城市名{p_end}
{txt}{hline}
Sorted by: {res}cit  year
     Note: Dataset has changed since last saved.

{com}. export excel "variable name" "variable label" using test.xlsx, firstrow(variables) replace
{err}"variable name invalid name
{txt}{search r(198):r(198);}

{com}. export excel "variable name" "variable label" using test.xlsx, firstrow(variables) replace
{err}"variable name invalid name
{txt}{search r(198):r(198);}

{com}. help fsum

. help fsum

. help fsum

. fsum

{txt}{ralign 22: Variable} {c |}{ralign 9:N}{ralign 9:Mean}{ralign 9:SD}{ralign 9:Min}{ralign 9:Max}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}
{hline 23}{c +}{hline 45}
{ralign 22 : year} {c |}{res}{ralign 0:     3336  2009.50     2.29  2006.00  2013.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp} {c |}{res}{ralign 0:     3107  1738.98  3831.62     8.70 53210.28{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_pri} {c |}{res}{ralign 0:     3033   167.46   339.34     0.80  3973.85{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_sec} {c |}{res}{ralign 0:     3101   868.99  1963.61     1.05 26447.38{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_ind} {c |}{res}{ralign 0:     3089   773.31  1777.12     0.10 24649.60{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_thi} {c |}{res}{ralign 0:     3106   703.56  1647.73     2.82 24097.70{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_per} {c |}{res}{ralign 0:     2875 30377.21 23154.11  2755.00 1.97e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_index} {c |}{res}{ralign 0:     2969   113.25     3.45    64.30   132.90{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_index_pri} {c |}{res}{ralign 0:     2927   105.14     3.74    60.60   138.60{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_index_sec} {c |}{res}{ralign 0:     2976   116.72    19.56    44.10  1111.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_index_ind} {c |}{res}{ralign 0:     2970   116.66    14.43    15.00   629.30{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_index_thi} {c |}{res}{ralign 0:     2975   112.53     3.75    78.00   161.10{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : gdp_index_per} {c |}{res}{ralign 0:     2843   112.55     4.67    12.00   147.60{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : investment} {c |}{res}{ralign 0:     2324   942.20  2233.79     6.13 26769.73{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : investment_urban} {c |}{res}{ralign 0:     3246  1354.17 26561.08     5.50 1.51e+06{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : investment_realestate} {c |}{res}{ralign 0:     3214   189.10   431.00     0.02  5567.94{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : investment_rural} {c |}{res}{ralign 0:     1873   151.38   693.23    -3.00 24939.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisrev} {c |}{res}{ralign 0:     3188   137.65   357.21     0.14  5514.84{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisrev_tax} {c |}{res}{ralign 0:     3163   159.22  2745.70     0.13 1.54e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisrev_tax_vat} {c |}{res}{ralign 0:     3169    18.91    52.55     0.01   840.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisrev_tax_op} {c |}{res}{ralign 0:     3170    41.74   268.77     0.09 11235.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisrev_tax_firm} {c |}{res}{ralign 0:     3133    15.95    54.09     0.00   827.90{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisrev_tax_person} {c |}{res}{ralign 0:     2984     6.27    24.24     0.01   547.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisexp} {c |}{res}{ralign 0:     3189   241.27   520.71     0.67  6712.40{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisexp_edu} {c |}{res}{ralign 0:     3169    42.05    87.83     0.05  1227.87{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisexp_security} {c |}{res}{ralign 0:     3163    27.98    61.57     0.01   657.36{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : income_rural} {c |}{res}{ralign 0:     2998  6683.46  3457.76  1417.00 27214.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : expend_rural} {c |}{res}{ralign 0:     2822  4742.43  2426.84  1172.00 19307.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : expend_rural_food} {c |}{res}{ralign 0:     2759  1905.27   833.57   356.00  6291.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : income_urban} {c |}{res}{ralign 0:     2967 17174.12  6994.25  5385.00 1.65e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : expend_urban} {c |}{res}{ralign 0:     2822 11845.47  4256.80  4289.00 33251.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : expend_urban_food} {c |}{res}{ralign 0:     2765  4335.39  1430.49   728.00 11704.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : num_ind} {c |}{res}{ralign 0:     3268  1568.52  4586.78     1.00 64364.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : num_ind_large} {c |}{res}{ralign 0:     1370    19.02    60.93     1.00  1603.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : num_ind_medium} {c |}{res}{ralign 0:     1616   163.98   477.71     1.00  6206.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : num_ind_small} {c |}{res}{ralign 0:     1663  1555.91  4622.91     2.00 56119.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind} {c |}{res}{ralign 0:     2491  2587.39  7490.51     0.20 1.08e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_state} {c |}{res}{ralign 0:     1620   574.83  1330.79     0.08 16994.81{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_domestic} {c |}{res}{ralign 0:     2441  1877.36  5117.49     0.09 83708.54{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_hmt} {c |}{res}{ralign 0:     2186   362.81  3577.13     0.00 1.57e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_frn} {c |}{res}{ralign 0:     2200   537.47  1976.83     0.02 30635.25{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : inc_ind} {c |}{res}{ralign 0:     1188   541.30  1451.19     0.10 17612.94{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : index_inc_ind} {c |}{res}{ralign 0:     1028   121.58    12.06    31.10   197.60{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : asset} {c |}{res}{ralign 0:     2865  2949.08 39445.92     0.40 2.09e+06{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : debt} {c |}{res}{ralign 0:     2870  1528.24 14796.04     0.05 7.78e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : revenue} {c |}{res}{ralign 0:     2865  2591.43  6721.90     0.10 1.07e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : profit} {c |}{res}{ralign 0:     2856   176.84   454.81   -78.46  7097.71{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : miles} {c |}{res}{ralign 0:     2832 17126.87 32148.96     1.30 2.83e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : miles_grade} {c |}{res}{ralign 0:     2800 13561.51 25606.87     1.30 2.31e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : veh_civil} {c |}{res}{ralign 0:     2664 4.14e+05 8.81e+05  1611.00 9.69e+06{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : veh_private} {c |}{res}{ralign 0:     2627 3.11e+05 6.96e+05   708.00 8.30e+06{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : post_telecom} {c |}{res}{ralign 0:     2007   104.49   277.47     0.10  4832.94{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : telecom} {c |}{res}{ralign 0:     2003    68.09   181.48     0.11  3476.88{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : landline} {c |}{res}{ralign 0:     2609   154.74   338.48     0.60  3743.10{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : mobile} {c |}{res}{ralign 0:     2598   377.56   753.65     0.80 10792.83{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : im_ex_port} {c |}{res}{ralign 0:     2915 1.19e+06 5.04e+06     1.00 9.13e+07{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : import} {c |}{res}{ralign 0:     2841 5.70e+05 2.54e+06     0.00 3.82e+07{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : export} {c |}{res}{ralign 0:     2908 6.37e+05 2.76e+06     1.00 5.32e+07{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fdi} {c |}{res}{ralign 0:     2758 78719.71 2.21e+05     1.00 3.21e+06{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings} {c |}{res}{ralign 0:     3108  2582.24  6515.90    10.60 89169.60{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings_firm} {c |}{res}{ralign 0:     1964   782.46  2382.49     2.00 29853.22{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings_resident} {c |}{res}{ralign 0:     1976  1071.31  2584.76     3.40 36318.66{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings_fixed} {c |}{res}{ralign 0:     1958   647.86  1561.96     0.80 17064.60{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : loan} {c |}{res}{ralign 0:     3109  2212.52 28749.75     1.00 1.59e+06{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : loan_ind} {c |}{res}{ralign 0:     1538   166.99   481.07     0.00  7455.08{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : loan_busi} {c |}{res}{ralign 0:     1551    85.17   189.11     0.05  1608.96{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : loan_agri} {c |}{res}{ralign 0:     1545    85.95   209.07     0.00  2962.97{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisexp_agri} {c |}{res}{ralign 0:     2693    26.65    53.35     0.00   618.13{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : fisexp_health} {c |}{res}{ralign 0:     2765    19.23    87.57     0.03  4231.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : house_rural} {c |}{res}{ralign 0:     2385    35.59    13.62     9.10   440.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : q9_1_4} {c |}{res}{ralign 0:      416    99.53   201.62     1.00  1881.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : num_ind_dom} {c |}{res}{ralign 0:      417  1692.20  4744.16     2.00 50867.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : num_ind_hmt} {c |}{res}{ralign 0:      379   181.51   834.72     1.00 13277.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : num_ind_frn} {c |}{res}{ralign 0:      368   219.46   760.83     1.00  8559.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_large} {c |}{res}{ralign 0:     1093  1321.37  3517.44     0.74 44866.71{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_medium} {c |}{res}{ralign 0:     1200  1582.09 23609.57     0.36 8.14e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_small} {c |}{res}{ralign 0:      832  1131.87  3268.01  -297.87 37648.81{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : total_equity} {c |}{res}{ralign 0:     1634  1101.31  2488.48     0.30 31885.22{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : total_vat} {c |}{res}{ralign 0:     1627    98.33   222.70     0.00  3118.03{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : num_employee} {c |}{res}{ralign 0:      851    43.65   122.80     0.00  1568.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : internet} {c |}{res}{ralign 0:     1507    95.52   226.39     0.10  3857.22{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : pop_per} {c |}{res}{ralign 0:     1530   499.75   987.89     9.60 10505.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_light} {c |}{res}{ralign 0:      823  4997.72 1.15e+05     0.03 3.29e+06{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : output_ind_heavy} {c |}{res}{ralign 0:      828  2594.82  6821.05     0.05 81044.49{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings_rmbfrn} {c |}{res}{ralign 0:     1349  3148.48  7404.88    41.30 91590.15{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings_cur} {c |}{res}{ralign 0:      396   608.07  1460.97     5.89 19254.06{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : loan_rmbfrn} {c |}{res}{ralign 0:     1346  2216.03  5278.19     3.04 58615.27{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : q12_5_1} {c |}{res}{ralign 0:     1124  2120.76  5170.81     2.78 52975.28{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : loan_short} {c |}{res}{ralign 0:     1524   775.72  1892.37     0.42 30818.25{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : loan_long} {c |}{res}{ralign 0:     1524  1796.41 22468.40     1.65 8.71e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : loan_frn} {c |}{res}{ralign 0:      532     6.73    31.34     0.00   436.55{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : comhouse_sales} {c |}{res}{ralign 0:     1176   234.35   491.73     0.10  5852.54{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : house_sales} {c |}{res}{ralign 0:     1175   193.33   402.97     0.10  5070.76{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : comhouse_sales_area} {c |}{res}{ralign 0:     1176   392.96   752.96     0.40  9576.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : house_sales_area} {c |}{res}{ralign 0:     1176   347.48   666.72     0.20  8741.20{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : house_area_urban} {c |}{res}{ralign 0:      877    34.45     6.76    17.10    65.80{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : post} {c |}{res}{ralign 0:      984     5.55    17.91     0.01   291.36{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings_danwei} {c |}{res}{ralign 0:      354  1273.44  3406.98    36.87 47699.62{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings_geren} {c |}{res}{ralign 0:      354  1110.00  1841.87    12.00 24103.80{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : savings_deposit} {c |}{res}{ralign 0:      730  1162.19  1776.43    12.00 22904.35{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : house_security} {c |}{res}{ralign 0:      371    12.33    60.50     0.01  1162.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : cost} {c |}{res}{ralign 0:      388  2350.49  3579.23     0.84 28569.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : code} {c |}{res}{ralign 0:     3336 3.83e+05 1.60e+05 1.10e+05 6.59e+05{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : prov} {c |}{res}{ralign 0:     3336    38.20    15.97    11.00    65.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : pref} {c |}{res}{ralign 0:     3336  3829.25  1601.74  1100.00  6590.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : level} {c |}{res}{ralign 0:     3336     2.09     0.48     1.00     3.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : _merge} {c |}{res}{ralign 0:     3336     3.00     0.00     3.00     3.00{space 0}}{ralign 0:{col 72}}
{txt}{ralign 22 : cit} {c |}{res}{ralign 0:     3336  1681.67   945.61     2.00  3237.00{space 0}}{ralign 0:{col 72}}

{com}. fsum, stats(n) label

{txt}{ralign 22: Variable} {c |}{ralign 9:N}{ralign 9:Mean}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}
{hline 23}{c +}{hline 18}
{ralign 22 : year} {c |}{res}{ralign 0:     3336  2009.50{space 0}}{ralign 0:{col 45}年份}
{txt}{ralign 22 : gdp} {c |}{res}{ralign 0:     3107  1738.98{space 0}}{ralign 0:{col 45}地区生产总值+亿元}
{txt}{ralign 22 : gdp_pri} {c |}{res}{ralign 0:     3033   167.46{space 0}}{ralign 0:{col 45}第一产业生产总值+亿元}
{txt}{ralign 22 : gdp_sec} {c |}{res}{ralign 0:     3101   868.99{space 0}}{ralign 0:{col 45}第二产业生产总值+亿元}
{txt}{ralign 22 : gdp_ind} {c |}{res}{ralign 0:     3089   773.31{space 0}}{ralign 0:{col 45}工业生产总值+亿元}
{txt}{ralign 22 : gdp_thi} {c |}{res}{ralign 0:     3106   703.56{space 0}}{ralign 0:{col 45}第三产业生产总值+亿元}
{txt}{ralign 22 : gdp_per} {c |}{res}{ralign 0:     2875 30377.21{space 0}}{ralign 0:{col 45}人均地区生产总值+元}
{txt}{ralign 22 : gdp_index} {c |}{res}{ralign 0:     2969   113.25{space 0}}{ralign 0:{col 45}地区生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_pri} {c |}{res}{ralign 0:     2927   105.14{space 0}}{ralign 0:{col 45}第一产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_sec} {c |}{res}{ralign 0:     2976   116.72{space 0}}{ralign 0:{col 45}第二产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_ind} {c |}{res}{ralign 0:     2970   116.66{space 0}}{ralign 0:{col 45}工业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_thi} {c |}{res}{ralign 0:     2975   112.53{space 0}}{ralign 0:{col 45}第三产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_per} {c |}{res}{ralign 0:     2843   112.55{space 0}}{ralign 0:{col 45}人均地区生产总值指数+上年=100}
{txt}{ralign 22 : investment} {c |}{res}{ralign 0:     2324   942.20{space 0}}{ralign 0:{col 45}全社会固定资产投资+亿元}
{txt}{ralign 22 : investment_urban} {c |}{res}{ralign 0:     3246  1354.17{space 0}}{ralign 0:{col 45}固定资产投资（不含农户）+亿元}
{txt}{ralign 22 : investment_realestate} {c |}{res}{ralign 0:     3214   189.10{space 0}}{ralign 0:{col 45}#开发+亿元}
{txt}{ralign 22 : investment_rural} {c |}{res}{ralign 0:     1873   151.38{space 0}}{ralign 0:{col 45}农村+亿元}
{txt}{ralign 22 : fisrev} {c |}{res}{ralign 0:     3188   137.65{space 0}}{ralign 0:{col 45}公共财政预算收入+亿元}
{txt}{ralign 22 : fisrev_tax} {c |}{res}{ralign 0:     3163   159.22{space 0}}{ralign 0:{col 45}#税收收入+亿元}
{txt}{ralign 22 : fisrev_tax_vat} {c |}{res}{ralign 0:     3169    18.91{space 0}}{ralign 0:{col 45}#国内增值税+亿元}
{txt}{ralign 22 : fisrev_tax_op} {c |}{res}{ralign 0:     3170    41.74{space 0}}{ralign 0:{col 45}#营业税+亿元}
{txt}{ralign 22 : fisrev_tax_firm} {c |}{res}{ralign 0:     3133    15.95{space 0}}{ralign 0:{col 45}#企业所得税+亿元}
{txt}{ralign 22 : fisrev_tax_person} {c |}{res}{ralign 0:     2984     6.27{space 0}}{ralign 0:{col 45}#个人所得税+亿元}
{txt}{ralign 22 : fisexp} {c |}{res}{ralign 0:     3189   241.27{space 0}}{ralign 0:{col 45}公共财政预算支出+亿元}
{txt}{ralign 22 : fisexp_edu} {c |}{res}{ralign 0:     3169    42.05{space 0}}{ralign 0:{col 45}#教育}
{txt}{ralign 22 : fisexp_security} {c |}{res}{ralign 0:     3163    27.98{space 0}}{ralign 0:{col 45}#社会保障和就业}
{txt}{ralign 22 : income_rural} {c |}{res}{ralign 0:     2998  6683.46{space 0}}{ralign 0:{col 45}农村居民人均可支配收入+元}
{txt}{ralign 22 : expend_rural} {c |}{res}{ralign 0:     2822  4742.43{space 0}}{ralign 0:{col 45}农村居民人均消费支出+元}
{txt}{ralign 22 : expend_rural_food} {c |}{res}{ralign 0:     2759  1905.27{space 0}}{ralign 0:{col 45}#食品支出}
{txt}{ralign 22 : income_urban} {c |}{res}{ralign 0:     2967 17174.12{space 0}}{ralign 0:{col 45}城镇居民人均可支配收入+元}
{txt}{ralign 22 : expend_urban} {c |}{res}{ralign 0:     2822 11845.47{space 0}}{ralign 0:{col 45}城镇居民人均消费支出+元}
{txt}{ralign 22 : expend_urban_food} {c |}{res}{ralign 0:     2765  4335.39{space 0}}{ralign 0:{col 45}#食品支出}
{txt}{ralign 22 : num_ind} {c |}{res}{ralign 0:     3268  1568.52{space 0}}{ralign 0:{col 45}规模以上工业企业单位数+个}
{txt}{ralign 22 : num_ind_large} {c |}{res}{ralign 0:     1370    19.02{space 0}}{ralign 0:{col 45}#大型企业+个}
{txt}{ralign 22 : num_ind_medium} {c |}{res}{ralign 0:     1616   163.98{space 0}}{ralign 0:{col 45}中型企业+个}
{txt}{ralign 22 : num_ind_small} {c |}{res}{ralign 0:     1663  1555.91{space 0}}{ralign 0:{col 45}小型企业+个}
{txt}{ralign 22 : output_ind} {c |}{res}{ralign 0:     2491  2587.39{space 0}}{ralign 0:{col 45}工业总产值+亿元}
{txt}{ralign 22 : output_ind_state} {c |}{res}{ralign 0:     1620   574.83{space 0}}{ralign 0:{col 45}#国有及国有控股+亿元}
{txt}{ralign 22 : output_ind_domestic} {c |}{res}{ralign 0:     2441  1877.36{space 0}}{ralign 0:{col 45}#内资企业+亿元}
{txt}{ralign 22 : output_ind_hmt} {c |}{res}{ralign 0:     2186   362.81{space 0}}{ralign 0:{col 45}港澳台商投资企业+亿元}
{txt}{ralign 22 : output_ind_frn} {c |}{res}{ralign 0:     2200   537.47{space 0}}{ralign 0:{col 45}外商投资企业+亿元}
{txt}{ralign 22 : inc_ind} {c |}{res}{ralign 0:     1188   541.30{space 0}}{ralign 0:{col 45}工业企业增加值+亿元}
{txt}{ralign 22 : index_inc_ind} {c |}{res}{ralign 0:     1028   121.58{space 0}}{ralign 0:{col 45}工业企业增加值指数+上年=100}
{txt}{ralign 22 : asset} {c |}{res}{ralign 0:     2865  2949.08{space 0}}{ralign 0:{col 45}#资产合计+亿元}
{txt}{ralign 22 : debt} {c |}{res}{ralign 0:     2870  1528.24{space 0}}{ralign 0:{col 45}#负债合计+亿元}
{txt}{ralign 22 : revenue} {c |}{res}{ralign 0:     2865  2591.43{space 0}}{ralign 0:{col 45}#主营业务收入+亿元}
{txt}{ralign 22 : profit} {c |}{res}{ralign 0:     2856   176.84{space 0}}{ralign 0:{col 45}#利润总额+亿元}
{txt}{ralign 22 : miles} {c |}{res}{ralign 0:     2832 17126.87{space 0}}{ralign 0:{col 45}公里里程+公里}
{txt}{ralign 22 : miles_grade} {c |}{res}{ralign 0:     2800 13561.51{space 0}}{ralign 0:{col 45}#等级公路+公里}
{txt}{ralign 22 : veh_civil} {c |}{res}{ralign 0:     2664 4.14e+05{space 0}}{ralign 0:{col 45}民用汽车拥有量+辆}
{txt}{ralign 22 : veh_private} {c |}{res}{ralign 0:     2627 3.11e+05{space 0}}{ralign 0:{col 45}#私人汽车+辆}
{txt}{ralign 22 : post_telecom} {c |}{res}{ralign 0:     2007   104.49{space 0}}{ralign 0:{col 45}邮电业务总量+亿元}
{txt}{ralign 22 : telecom} {c |}{res}{ralign 0:     2003    68.09{space 0}}{ralign 0:{col 45}电信业务总量+亿元}
{txt}{ralign 22 : landline} {c |}{res}{ralign 0:     2609   154.74{space 0}}{ralign 0:{col 45}固定电话用户+万户}
{txt}{ralign 22 : mobile} {c |}{res}{ralign 0:     2598   377.56{space 0}}{ralign 0:{col 45}移动电话用户+万户}
{txt}{ralign 22 : im_ex_port} {c |}{res}{ralign 0:     2915 1.19e+06{space 0}}{ralign 0:{col 45}货物进出口总额+万美元}
{txt}{ralign 22 : import} {c |}{res}{ralign 0:     2841 5.70e+05{space 0}}{ralign 0:{col 45}进口额+万美元}
{txt}{ralign 22 : export} {c |}{res}{ralign 0:     2908 6.37e+05{space 0}}{ralign 0:{col 45}出口额+万美元}
{txt}{ralign 22 : fdi} {c |}{res}{ralign 0:     2758 78719.71{space 0}}{ralign 0:{col 45}外商直接投资实际使用额+万美元}
{txt}{ralign 22 : savings} {c |}{res}{ralign 0:     3108  2582.24{space 0}}{ralign 0:{col 45}金融机构人民币存款+亿元}
{txt}{ralign 22 : savings_firm} {c |}{res}{ralign 0:     1964   782.46{space 0}}{ralign 0:{col 45}#企业存款}
{txt}{ralign 22 : savings_resident} {c |}{res}{ralign 0:     1976  1071.31{space 0}}{ralign 0:{col 45}#居民储蓄存款}
{txt}{ralign 22 : savings_fixed} {c |}{res}{ralign 0:     1958   647.86{space 0}}{ralign 0:{col 45}(亿元) #定期TimeDeposits}
{txt}{ralign 22 : loan} {c |}{res}{ralign 0:     3109  2212.52{space 0}}{ralign 0:{col 45}(亿元) 金融机构人民币贷款(亿元)TotalLoans(100millionyuan)}
{txt}{ralign 22 : loan_ind} {c |}{res}{ralign 0:     1538   166.99{space 0}}{ralign 0:{col 45}(亿元) #工业贷款LoanstoIndus-trial}
{txt}{ralign 22 : loan_busi} {c |}{res}{ralign 0:     1551    85.17{space 0}}{ralign 0:{col 45}(亿元) #商业贷款LoanstoCom-mercial}
{txt}{ralign 22 : loan_agri} {c |}{res}{ralign 0:     1545    85.95{space 0}}{ralign 0:{col 45}(亿元) #农业贷款LoanstoAgricul-tural}
{txt}{ralign 22 : fisexp_agri} {c |}{res}{ralign 0:     2693    26.65{space 0}}{ralign 0:{col 45}#农林水利事务}
{txt}{ralign 22 : fisexp_health} {c |}{res}{ralign 0:     2765    19.23{space 0}}{ralign 0:{col 45}#医疗卫生}
{txt}{ralign 22 : house_rural} {c |}{res}{ralign 0:     2385    35.59{space 0}}{ralign 0:{col 45}农村人均住房面积+平方米}
{txt}{ralign 22 : q9_1_4} {c |}{res}{ralign 0:      416    99.53{space 0}}{ralign 0:{col 45}#国有及国有控股+个}
{txt}{ralign 22 : num_ind_dom} {c |}{res}{ralign 0:      417  1692.20{space 0}}{ralign 0:{col 45}内资企业+个}
{txt}{ralign 22 : num_ind_hmt} {c |}{res}{ralign 0:      379   181.51{space 0}}{ralign 0:{col 45}港澳台商投资企业+个}
{txt}{ralign 22 : num_ind_frn} {c |}{res}{ralign 0:      368   219.46{space 0}}{ralign 0:{col 45}外商投资企业+个}
{txt}{ralign 22 : output_ind_large} {c |}{res}{ralign 0:     1093  1321.37{space 0}}{ralign 0:{col 45}#大型企业+亿元}
{txt}{ralign 22 : output_ind_medium} {c |}{res}{ralign 0:     1200  1582.09{space 0}}{ralign 0:{col 45}中型企业+亿元}
{txt}{ralign 22 : output_ind_small} {c |}{res}{ralign 0:      832  1131.87{space 0}}{ralign 0:{col 45}小型企业+亿元}
{txt}{ralign 22 : total_equity} {c |}{res}{ralign 0:     1634  1101.31{space 0}}{ralign 0:{col 45}#所有者权益+亿元}
{txt}{ralign 22 : total_vat} {c |}{res}{ralign 0:     1627    98.33{space 0}}{ralign 0:{col 45}#本年应交增值税+亿元}
{txt}{ralign 22 : num_employee} {c |}{res}{ralign 0:      851    43.65{space 0}}{ralign 0:{col 45}从业人员年平均人数}
{txt}{ralign 22 : internet} {c |}{res}{ralign 0:     1507    95.52{space 0}}{ralign 0:{col 45}互联网宽带接入用户数+万户}
{txt}{ralign 22 : pop_per} {c |}{res}{ralign 0:     1530   499.75{space 0}}{ralign 0:{col 45}常住人口+万人}
{txt}{ralign 22 : output_ind_light} {c |}{res}{ralign 0:      823  4997.72{space 0}}{ralign 0:{col 45}#轻工业+亿元}
{txt}{ralign 22 : output_ind_heavy} {c |}{res}{ralign 0:      828  2594.82{space 0}}{ralign 0:{col 45}重工业+亿元}
{txt}{ralign 22 : savings_rmbfrn} {c |}{res}{ralign 0:     1349  3148.48{space 0}}{ralign 0:{col 45}金融机构本外币存款+亿元}
{txt}{ralign 22 : savings_cur} {c |}{res}{ralign 0:      396   608.07{space 0}}{ralign 0:{col 45}#活期}
{txt}{ralign 22 : loan_rmbfrn} {c |}{res}{ralign 0:     1346  2216.03{space 0}}{ralign 0:{col 45}金融机构本外币贷款+亿元}
{txt}{ralign 22 : q12_5_1} {c |}{res}{ralign 0:     1124  2120.76{space 0}}{ralign 0:{col 45}境内贷款}
{txt}{ralign 22 : loan_short} {c |}{res}{ralign 0:     1524   775.72{space 0}}{ralign 0:{col 45}#短期贷款+亿元}
{txt}{ralign 22 : loan_long} {c |}{res}{ralign 0:     1524  1796.41{space 0}}{ralign 0:{col 45}#中长期贷款+亿元}
{txt}{ralign 22 : loan_frn} {c |}{res}{ralign 0:      532     6.73{space 0}}{ralign 0:{col 45}境外贷款}
{txt}{ralign 22 : comhouse_sales} {c |}{res}{ralign 0:     1176   234.35{space 0}}{ralign 0:{col 45}商品房销售额+亿元}
{txt}{ralign 22 : house_sales} {c |}{res}{ralign 0:     1175   193.33{space 0}}{ralign 0:{col 45}#住宅+亿元}
{txt}{ralign 22 : comhouse_sales_area} {c |}{res}{ralign 0:     1176   392.96{space 0}}{ralign 0:{col 45}商品房销售面积+万平方米}
{txt}{ralign 22 : house_sales_area} {c |}{res}{ralign 0:     1176   347.48{space 0}}{ralign 0:{col 45}#住宅+万平方米}
{txt}{ralign 22 : house_area_urban} {c |}{res}{ralign 0:      877    34.45{space 0}}{ralign 0:{col 45}城镇人均住房建筑面积+平方米}
{txt}{ralign 22 : post} {c |}{res}{ralign 0:      984     5.55{space 0}}{ralign 0:{col 45}邮政业务总量+亿元}
{txt}{ralign 22 : savings_danwei} {c |}{res}{ralign 0:      354  1273.44{space 0}}{ralign 0:{col 45}#单位存款}
{txt}{ralign 22 : savings_geren} {c |}{res}{ralign 0:      354  1110.00{space 0}}{ralign 0:{col 45}#个人存款}
{txt}{ralign 22 : savings_deposit} {c |}{res}{ralign 0:      730  1162.19{space 0}}{ralign 0:{col 45}#储蓄存款}
{txt}{ralign 22 : house_security} {c |}{res}{ralign 0:      371    12.33{space 0}}{ralign 0:{col 45}#住房保障}
{txt}{ralign 22 : cost} {c |}{res}{ralign 0:      388  2350.49{space 0}}{ralign 0:{col 45}#主营业务成本+亿元}
{txt}{ralign 22 : code} {c |}{res}{ralign 0:     3336 3.83e+05{space 0}}{ralign 0:{col 45}行政代码}
{txt}{ralign 22 : prov} {c |}{res}{ralign 0:     3336    38.20{space 0}}{ralign 0:{col 45}省份代码}
{txt}{ralign 22 : pref} {c |}{res}{ralign 0:     3336  3829.25{space 0}}{ralign 0:{col 45}地级市代码}
{txt}{ralign 22 : level} {c |}{res}{ralign 0:     3336     2.09{space 0}}{ralign 0:{col 45}地区的行政级别，1表示省级，2表示地级市，3表示县级市}
{txt}{ralign 22 : _merge} {c |}{res}{ralign 0:     3336     3.00{space 0}}{ralign 0:{col 45}}
{txt}{ralign 22 : cit} {c |}{res}{ralign 0:     3336  1681.67{space 0}}{ralign 0:{col 45}原始文件城市名}

{com}. help fsum

. export excel using "test.xlsx", replace
{res}{txt}file test.xlsx saved

{com}. dir
{txt}  <dir>   5/31/17 19:49  {res}.                 
{txt}  <dir>   5/31/17 19:49  {res}..                
{txt}   9.0k   5/31/17 11:40  {res}citycode_2012.do  
{txt}   5.3k   5/31/17 11:13  {res}data_2012(1).do   
{txt}   5.3k   5/31/17 11:13  {res}data_2012.do      
{txt}   0.0k   5/31/17 19:11  {res}logfile.txt       
{txt} 213.0k   5/31/17 19:14  {res}newcitycode.dta   
{txt}   7.6k   5/31/17 19:38  {res}pf01.do           
{txt}2053.9k   5/31/17 19:49  {res}test.xlsx         

{com}. fsum, stats(n) label

{txt}{ralign 22: Variable} {c |}{ralign 9:N}{ralign 9:Mean}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}
{hline 23}{c +}{hline 18}
{ralign 22 : year} {c |}{res}{ralign 0:     3336  2009.50{space 0}}{ralign 0:{col 45}年份}
{txt}{ralign 22 : gdp} {c |}{res}{ralign 0:     3107  1738.98{space 0}}{ralign 0:{col 45}地区生产总值+亿元}
{txt}{ralign 22 : gdp_pri} {c |}{res}{ralign 0:     3033   167.46{space 0}}{ralign 0:{col 45}第一产业生产总值+亿元}
{txt}{ralign 22 : gdp_sec} {c |}{res}{ralign 0:     3101   868.99{space 0}}{ralign 0:{col 45}第二产业生产总值+亿元}
{txt}{ralign 22 : gdp_ind} {c |}{res}{ralign 0:     3089   773.31{space 0}}{ralign 0:{col 45}工业生产总值+亿元}
{txt}{ralign 22 : gdp_thi} {c |}{res}{ralign 0:     3106   703.56{space 0}}{ralign 0:{col 45}第三产业生产总值+亿元}
{txt}{ralign 22 : gdp_per} {c |}{res}{ralign 0:     2875 30377.21{space 0}}{ralign 0:{col 45}人均地区生产总值+元}
{txt}{ralign 22 : gdp_index} {c |}{res}{ralign 0:     2969   113.25{space 0}}{ralign 0:{col 45}地区生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_pri} {c |}{res}{ralign 0:     2927   105.14{space 0}}{ralign 0:{col 45}第一产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_sec} {c |}{res}{ralign 0:     2976   116.72{space 0}}{ralign 0:{col 45}第二产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_ind} {c |}{res}{ralign 0:     2970   116.66{space 0}}{ralign 0:{col 45}工业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_thi} {c |}{res}{ralign 0:     2975   112.53{space 0}}{ralign 0:{col 45}第三产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_per} {c |}{res}{ralign 0:     2843   112.55{space 0}}{ralign 0:{col 45}人均地区生产总值指数+上年=100}
{txt}{ralign 22 : investment} {c |}{res}{ralign 0:     2324   942.20{space 0}}{ralign 0:{col 45}全社会固定资产投资+亿元}
{txt}{ralign 22 : investment_urban} {c |}{res}{ralign 0:     3246  1354.17{space 0}}{ralign 0:{col 45}固定资产投资（不含农户）+亿元}
{txt}{ralign 22 : investment_realestate} {c |}{res}{ralign 0:     3214   189.10{space 0}}{ralign 0:{col 45}#开发+亿元}
{txt}{ralign 22 : investment_rural} {c |}{res}{ralign 0:     1873   151.38{space 0}}{ralign 0:{col 45}农村+亿元}
{txt}{ralign 22 : fisrev} {c |}{res}{ralign 0:     3188   137.65{space 0}}{ralign 0:{col 45}公共财政预算收入+亿元}
{txt}{ralign 22 : fisrev_tax} {c |}{res}{ralign 0:     3163   159.22{space 0}}{ralign 0:{col 45}#税收收入+亿元}
{txt}{ralign 22 : fisrev_tax_vat} {c |}{res}{ralign 0:     3169    18.91{space 0}}{ralign 0:{col 45}#国内增值税+亿元}
{txt}{ralign 22 : fisrev_tax_op} {c |}{res}{ralign 0:     3170    41.74{space 0}}{ralign 0:{col 45}#营业税+亿元}
{txt}{ralign 22 : fisrev_tax_firm} {c |}{res}{ralign 0:     3133    15.95{space 0}}{ralign 0:{col 45}#企业所得税+亿元}
{txt}{ralign 22 : fisrev_tax_person} {c |}{res}{ralign 0:     2984     6.27{space 0}}{ralign 0:{col 45}#个人所得税+亿元}
{txt}{ralign 22 : fisexp} {c |}{res}{ralign 0:     3189   241.27{space 0}}{ralign 0:{col 45}公共财政预算支出+亿元}
{txt}{ralign 22 : fisexp_edu} {c |}{res}{ralign 0:     3169    42.05{space 0}}{ralign 0:{col 45}#教育}
{txt}{ralign 22 : fisexp_security} {c |}{res}{ralign 0:     3163    27.98{space 0}}{ralign 0:{col 45}#社会保障和就业}
{txt}{ralign 22 : income_rural} {c |}{res}{ralign 0:     2998  6683.46{space 0}}{ralign 0:{col 45}农村居民人均可支配收入+元}
{txt}{ralign 22 : expend_rural} {c |}{res}{ralign 0:     2822  4742.43{space 0}}{ralign 0:{col 45}农村居民人均消费支出+元}
{txt}{ralign 22 : expend_rural_food} {c |}{res}{ralign 0:     2759  1905.27{space 0}}{ralign 0:{col 45}#食品支出}
{txt}{ralign 22 : income_urban} {c |}{res}{ralign 0:     2967 17174.12{space 0}}{ralign 0:{col 45}城镇居民人均可支配收入+元}
{txt}{ralign 22 : expend_urban} {c |}{res}{ralign 0:     2822 11845.47{space 0}}{ralign 0:{col 45}城镇居民人均消费支出+元}
{txt}{ralign 22 : expend_urban_food} {c |}{res}{ralign 0:     2765  4335.39{space 0}}{ralign 0:{col 45}#食品支出}
{txt}{ralign 22 : num_ind} {c |}{res}{ralign 0:     3268  1568.52{space 0}}{ralign 0:{col 45}规模以上工业企业单位数+个}
{txt}{ralign 22 : num_ind_large} {c |}{res}{ralign 0:     1370    19.02{space 0}}{ralign 0:{col 45}#大型企业+个}
{txt}{ralign 22 : num_ind_medium} {c |}{res}{ralign 0:     1616   163.98{space 0}}{ralign 0:{col 45}中型企业+个}
{txt}{ralign 22 : num_ind_small} {c |}{res}{ralign 0:     1663  1555.91{space 0}}{ralign 0:{col 45}小型企业+个}
{txt}{ralign 22 : output_ind} {c |}{res}{ralign 0:     2491  2587.39{space 0}}{ralign 0:{col 45}工业总产值+亿元}
{txt}{ralign 22 : output_ind_state} {c |}{res}{ralign 0:     1620   574.83{space 0}}{ralign 0:{col 45}#国有及国有控股+亿元}
{txt}{ralign 22 : output_ind_domestic} {c |}{res}{ralign 0:     2441  1877.36{space 0}}{ralign 0:{col 45}#内资企业+亿元}
{txt}{ralign 22 : output_ind_hmt} {c |}{res}{ralign 0:     2186   362.81{space 0}}{ralign 0:{col 45}港澳台商投资企业+亿元}
{txt}{ralign 22 : output_ind_frn} {c |}{res}{ralign 0:     2200   537.47{space 0}}{ralign 0:{col 45}外商投资企业+亿元}
{txt}{ralign 22 : inc_ind} {c |}{res}{ralign 0:     1188   541.30{space 0}}{ralign 0:{col 45}工业企业增加值+亿元}
{txt}{ralign 22 : index_inc_ind} {c |}{res}{ralign 0:     1028   121.58{space 0}}{ralign 0:{col 45}工业企业增加值指数+上年=100}
{txt}{ralign 22 : asset} {c |}{res}{ralign 0:     2865  2949.08{space 0}}{ralign 0:{col 45}#资产合计+亿元}
{txt}{ralign 22 : debt} {c |}{res}{ralign 0:     2870  1528.24{space 0}}{ralign 0:{col 45}#负债合计+亿元}
{txt}{ralign 22 : revenue} {c |}{res}{ralign 0:     2865  2591.43{space 0}}{ralign 0:{col 45}#主营业务收入+亿元}
{txt}{ralign 22 : profit} {c |}{res}{ralign 0:     2856   176.84{space 0}}{ralign 0:{col 45}#利润总额+亿元}
{txt}{ralign 22 : miles} {c |}{res}{ralign 0:     2832 17126.87{space 0}}{ralign 0:{col 45}公里里程+公里}
{txt}{ralign 22 : miles_grade} {c |}{res}{ralign 0:     2800 13561.51{space 0}}{ralign 0:{col 45}#等级公路+公里}
{txt}{ralign 22 : veh_civil} {c |}{res}{ralign 0:     2664 4.14e+05{space 0}}{ralign 0:{col 45}民用汽车拥有量+辆}
{txt}{ralign 22 : veh_private} {c |}{res}{ralign 0:     2627 3.11e+05{space 0}}{ralign 0:{col 45}#私人汽车+辆}
{txt}{ralign 22 : post_telecom} {c |}{res}{ralign 0:     2007   104.49{space 0}}{ralign 0:{col 45}邮电业务总量+亿元}
{txt}{ralign 22 : telecom} {c |}{res}{ralign 0:     2003    68.09{space 0}}{ralign 0:{col 45}电信业务总量+亿元}
{txt}{ralign 22 : landline} {c |}{res}{ralign 0:     2609   154.74{space 0}}{ralign 0:{col 45}固定电话用户+万户}
{txt}{ralign 22 : mobile} {c |}{res}{ralign 0:     2598   377.56{space 0}}{ralign 0:{col 45}移动电话用户+万户}
{txt}{ralign 22 : im_ex_port} {c |}{res}{ralign 0:     2915 1.19e+06{space 0}}{ralign 0:{col 45}货物进出口总额+万美元}
{txt}{ralign 22 : import} {c |}{res}{ralign 0:     2841 5.70e+05{space 0}}{ralign 0:{col 45}进口额+万美元}
{txt}{ralign 22 : export} {c |}{res}{ralign 0:     2908 6.37e+05{space 0}}{ralign 0:{col 45}出口额+万美元}
{txt}{ralign 22 : fdi} {c |}{res}{ralign 0:     2758 78719.71{space 0}}{ralign 0:{col 45}外商直接投资实际使用额+万美元}
{txt}{ralign 22 : savings} {c |}{res}{ralign 0:     3108  2582.24{space 0}}{ralign 0:{col 45}金融机构人民币存款+亿元}
{txt}{ralign 22 : savings_firm} {c |}{res}{ralign 0:     1964   782.46{space 0}}{ralign 0:{col 45}#企业存款}
{txt}{ralign 22 : savings_resident} {c |}{res}{ralign 0:     1976  1071.31{space 0}}{ralign 0:{col 45}#居民储蓄存款}
{txt}{ralign 22 : savings_fixed} {c |}{res}{ralign 0:     1958   647.86{space 0}}{ralign 0:{col 45}(亿元) #定期TimeDeposits}
{txt}{ralign 22 : loan} {c |}{res}{ralign 0:     3109  2212.52{space 0}}{ralign 0:{col 45}(亿元) 金融机构人民币贷款(亿元)TotalLoans(100millionyuan)}
{txt}{ralign 22 : loan_ind} {c |}{res}{ralign 0:     1538   166.99{space 0}}{ralign 0:{col 45}(亿元) #工业贷款LoanstoIndus-trial}
{txt}{ralign 22 : loan_busi} {c |}{res}{ralign 0:     1551    85.17{space 0}}{ralign 0:{col 45}(亿元) #商业贷款LoanstoCom-mercial}
{txt}{ralign 22 : loan_agri} {c |}{res}{ralign 0:     1545    85.95{space 0}}{ralign 0:{col 45}(亿元) #农业贷款LoanstoAgricul-tural}
{txt}{ralign 22 : fisexp_agri} {c |}{res}{ralign 0:     2693    26.65{space 0}}{ralign 0:{col 45}#农林水利事务}
{txt}{ralign 22 : fisexp_health} {c |}{res}{ralign 0:     2765    19.23{space 0}}{ralign 0:{col 45}#医疗卫生}
{txt}{ralign 22 : house_rural} {c |}{res}{ralign 0:     2385    35.59{space 0}}{ralign 0:{col 45}农村人均住房面积+平方米}
{txt}{ralign 22 : q9_1_4} {c |}{res}{ralign 0:      416    99.53{space 0}}{ralign 0:{col 45}#国有及国有控股+个}
{txt}{ralign 22 : num_ind_dom} {c |}{res}{ralign 0:      417  1692.20{space 0}}{ralign 0:{col 45}内资企业+个}
{txt}{ralign 22 : num_ind_hmt} {c |}{res}{ralign 0:      379   181.51{space 0}}{ralign 0:{col 45}港澳台商投资企业+个}
{txt}{ralign 22 : num_ind_frn} {c |}{res}{ralign 0:      368   219.46{space 0}}{ralign 0:{col 45}外商投资企业+个}
{txt}{ralign 22 : output_ind_large} {c |}{res}{ralign 0:     1093  1321.37{space 0}}{ralign 0:{col 45}#大型企业+亿元}
{txt}{ralign 22 : output_ind_medium} {c |}{res}{ralign 0:     1200  1582.09{space 0}}{ralign 0:{col 45}中型企业+亿元}
{txt}{ralign 22 : output_ind_small} {c |}{res}{ralign 0:      832  1131.87{space 0}}{ralign 0:{col 45}小型企业+亿元}
{txt}{ralign 22 : total_equity} {c |}{res}{ralign 0:     1634  1101.31{space 0}}{ralign 0:{col 45}#所有者权益+亿元}
{txt}{ralign 22 : total_vat} {c |}{res}{ralign 0:     1627    98.33{space 0}}{ralign 0:{col 45}#本年应交增值税+亿元}
{txt}{ralign 22 : num_employee} {c |}{res}{ralign 0:      851    43.65{space 0}}{ralign 0:{col 45}从业人员年平均人数}
{txt}{ralign 22 : internet} {c |}{res}{ralign 0:     1507    95.52{space 0}}{ralign 0:{col 45}互联网宽带接入用户数+万户}
{txt}{ralign 22 : pop_per} {c |}{res}{ralign 0:     1530   499.75{space 0}}{ralign 0:{col 45}常住人口+万人}
{txt}{ralign 22 : output_ind_light} {c |}{res}{ralign 0:      823  4997.72{space 0}}{ralign 0:{col 45}#轻工业+亿元}
{txt}{ralign 22 : output_ind_heavy} {c |}{res}{ralign 0:      828  2594.82{space 0}}{ralign 0:{col 45}重工业+亿元}
{txt}{ralign 22 : savings_rmbfrn} {c |}{res}{ralign 0:     1349  3148.48{space 0}}{ralign 0:{col 45}金融机构本外币存款+亿元}
{txt}{ralign 22 : savings_cur} {c |}{res}{ralign 0:      396   608.07{space 0}}{ralign 0:{col 45}#活期}
{txt}{ralign 22 : loan_rmbfrn} {c |}{res}{ralign 0:     1346  2216.03{space 0}}{ralign 0:{col 45}金融机构本外币贷款+亿元}
{txt}{ralign 22 : q12_5_1} {c |}{res}{ralign 0:     1124  2120.76{space 0}}{ralign 0:{col 45}境内贷款}
{txt}{ralign 22 : loan_short} {c |}{res}{ralign 0:     1524   775.72{space 0}}{ralign 0:{col 45}#短期贷款+亿元}
{txt}{ralign 22 : loan_long} {c |}{res}{ralign 0:     1524  1796.41{space 0}}{ralign 0:{col 45}#中长期贷款+亿元}
{txt}{ralign 22 : loan_frn} {c |}{res}{ralign 0:      532     6.73{space 0}}{ralign 0:{col 45}境外贷款}
{txt}{ralign 22 : comhouse_sales} {c |}{res}{ralign 0:     1176   234.35{space 0}}{ralign 0:{col 45}商品房销售额+亿元}
{txt}{ralign 22 : house_sales} {c |}{res}{ralign 0:     1175   193.33{space 0}}{ralign 0:{col 45}#住宅+亿元}
{txt}{ralign 22 : comhouse_sales_area} {c |}{res}{ralign 0:     1176   392.96{space 0}}{ralign 0:{col 45}商品房销售面积+万平方米}
{txt}{ralign 22 : house_sales_area} {c |}{res}{ralign 0:     1176   347.48{space 0}}{ralign 0:{col 45}#住宅+万平方米}
{txt}{ralign 22 : house_area_urban} {c |}{res}{ralign 0:      877    34.45{space 0}}{ralign 0:{col 45}城镇人均住房建筑面积+平方米}
{txt}{ralign 22 : post} {c |}{res}{ralign 0:      984     5.55{space 0}}{ralign 0:{col 45}邮政业务总量+亿元}
{txt}{ralign 22 : savings_danwei} {c |}{res}{ralign 0:      354  1273.44{space 0}}{ralign 0:{col 45}#单位存款}
{txt}{ralign 22 : savings_geren} {c |}{res}{ralign 0:      354  1110.00{space 0}}{ralign 0:{col 45}#个人存款}
{txt}{ralign 22 : savings_deposit} {c |}{res}{ralign 0:      730  1162.19{space 0}}{ralign 0:{col 45}#储蓄存款}
{txt}{ralign 22 : house_security} {c |}{res}{ralign 0:      371    12.33{space 0}}{ralign 0:{col 45}#住房保障}
{txt}{ralign 22 : cost} {c |}{res}{ralign 0:      388  2350.49{space 0}}{ralign 0:{col 45}#主营业务成本+亿元}
{txt}{ralign 22 : code} {c |}{res}{ralign 0:     3336 3.83e+05{space 0}}{ralign 0:{col 45}行政代码}
{txt}{ralign 22 : prov} {c |}{res}{ralign 0:     3336    38.20{space 0}}{ralign 0:{col 45}省份代码}
{txt}{ralign 22 : pref} {c |}{res}{ralign 0:     3336  3829.25{space 0}}{ralign 0:{col 45}地级市代码}
{txt}{ralign 22 : level} {c |}{res}{ralign 0:     3336     2.09{space 0}}{ralign 0:{col 45}地区的行政级别，1表示省级，2表示地级市，3表示县级市}
{txt}{ralign 22 : _merge} {c |}{res}{ralign 0:     3336     3.00{space 0}}{ralign 0:{col 45}}
{txt}{ralign 22 : cit} {c |}{res}{ralign 0:     3336  1681.67{space 0}}{ralign 0:{col 45}原始文件城市名}

{com}. return list

{txt}scalars:
                  r(N) =  {res}3336
              {txt}r(sum_w) =  {res}3336
               {txt}r(mean) =  {res}1681.673860911271
                {txt}r(Var) =  {res}894173.3988487769
                 {txt}r(sd) =  {res}945.6074232200047
                {txt}r(min) =  {res}2
                {txt}r(max) =  {res}3237
                {txt}r(sum) =  {res}5610064

{com}. help putexcel

. fsum, stats(n) label

{txt}{ralign 22: Variable} {c |}{ralign 9:N}{ralign 9:Mean}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}{ralign 9:}
{hline 23}{c +}{hline 18}
{ralign 22 : year} {c |}{res}{ralign 0:     3336  2009.50{space 0}}{ralign 0:{col 45}年份}
{txt}{ralign 22 : gdp} {c |}{res}{ralign 0:     3107  1738.98{space 0}}{ralign 0:{col 45}地区生产总值+亿元}
{txt}{ralign 22 : gdp_pri} {c |}{res}{ralign 0:     3033   167.46{space 0}}{ralign 0:{col 45}第一产业生产总值+亿元}
{txt}{ralign 22 : gdp_sec} {c |}{res}{ralign 0:     3101   868.99{space 0}}{ralign 0:{col 45}第二产业生产总值+亿元}
{txt}{ralign 22 : gdp_ind} {c |}{res}{ralign 0:     3089   773.31{space 0}}{ralign 0:{col 45}工业生产总值+亿元}
{txt}{ralign 22 : gdp_thi} {c |}{res}{ralign 0:     3106   703.56{space 0}}{ralign 0:{col 45}第三产业生产总值+亿元}
{txt}{ralign 22 : gdp_per} {c |}{res}{ralign 0:     2875 30377.21{space 0}}{ralign 0:{col 45}人均地区生产总值+元}
{txt}{ralign 22 : gdp_index} {c |}{res}{ralign 0:     2969   113.25{space 0}}{ralign 0:{col 45}地区生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_pri} {c |}{res}{ralign 0:     2927   105.14{space 0}}{ralign 0:{col 45}第一产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_sec} {c |}{res}{ralign 0:     2976   116.72{space 0}}{ralign 0:{col 45}第二产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_ind} {c |}{res}{ralign 0:     2970   116.66{space 0}}{ralign 0:{col 45}工业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_thi} {c |}{res}{ralign 0:     2975   112.53{space 0}}{ralign 0:{col 45}第三产业生产总值指数+上年=100}
{txt}{ralign 22 : gdp_index_per} {c |}{res}{ralign 0:     2843   112.55{space 0}}{ralign 0:{col 45}人均地区生产总值指数+上年=100}
{txt}{ralign 22 : investment} {c |}{res}{ralign 0:     2324   942.20{space 0}}{ralign 0:{col 45}全社会固定资产投资+亿元}
{txt}{ralign 22 : investment_urban} {c |}{res}{ralign 0:     3246  1354.17{space 0}}{ralign 0:{col 45}固定资产投资（不含农户）+亿元}
{txt}{ralign 22 : investment_realestate} {c |}{res}{ralign 0:     3214   189.10{space 0}}{ralign 0:{col 45}#开发+亿元}
{txt}{ralign 22 : investment_rural} {c |}{res}{ralign 0:     1873   151.38{space 0}}{ralign 0:{col 45}农村+亿元}
{txt}{ralign 22 : fisrev} {c |}{res}{ralign 0:     3188   137.65{space 0}}{ralign 0:{col 45}公共财政预算收入+亿元}
{txt}{ralign 22 : fisrev_tax} {c |}{res}{ralign 0:     3163   159.22{space 0}}{ralign 0:{col 45}#税收收入+亿元}
{txt}{ralign 22 : fisrev_tax_vat} {c |}{res}{ralign 0:     3169    18.91{space 0}}{ralign 0:{col 45}#国内增值税+亿元}
{txt}{ralign 22 : fisrev_tax_op} {c |}{res}{ralign 0:     3170    41.74{space 0}}{ralign 0:{col 45}#营业税+亿元}
{txt}{ralign 22 : fisrev_tax_firm} {c |}{res}{ralign 0:     3133    15.95{space 0}}{ralign 0:{col 45}#企业所得税+亿元}
{txt}{ralign 22 : fisrev_tax_person} {c |}{res}{ralign 0:     2984     6.27{space 0}}{ralign 0:{col 45}#个人所得税+亿元}
{txt}{ralign 22 : fisexp} {c |}{res}{ralign 0:     3189   241.27{space 0}}{ralign 0:{col 45}公共财政预算支出+亿元}
{txt}{ralign 22 : fisexp_edu} {c |}{res}{ralign 0:     3169    42.05{space 0}}{ralign 0:{col 45}#教育}
{txt}{ralign 22 : fisexp_security} {c |}{res}{ralign 0:     3163    27.98{space 0}}{ralign 0:{col 45}#社会保障和就业}
{txt}{ralign 22 : income_rural} {c |}{res}{ralign 0:     2998  6683.46{space 0}}{ralign 0:{col 45}农村居民人均可支配收入+元}
{txt}{ralign 22 : expend_rural} {c |}{res}{ralign 0:     2822  4742.43{space 0}}{ralign 0:{col 45}农村居民人均消费支出+元}
{txt}{ralign 22 : expend_rural_food} {c |}{res}{ralign 0:     2759  1905.27{space 0}}{ralign 0:{col 45}#食品支出}
{txt}{ralign 22 : income_urban} {c |}{res}{ralign 0:     2967 17174.12{space 0}}{ralign 0:{col 45}城镇居民人均可支配收入+元}
{txt}{ralign 22 : expend_urban} {c |}{res}{ralign 0:     2822 11845.47{space 0}}{ralign 0:{col 45}城镇居民人均消费支出+元}
{txt}{ralign 22 : expend_urban_food} {c |}{res}{ralign 0:     2765  4335.39{space 0}}{ralign 0:{col 45}#食品支出}
{txt}{ralign 22 : num_ind} {c |}{res}{ralign 0:     3268  1568.52{space 0}}{ralign 0:{col 45}规模以上工业企业单位数+个}
{txt}{ralign 22 : num_ind_large} {c |}{res}{ralign 0:     1370    19.02{space 0}}{ralign 0:{col 45}#大型企业+个}
{txt}{ralign 22 : num_ind_medium} {c |}{res}{ralign 0:     1616   163.98{space 0}}{ralign 0:{col 45}中型企业+个}
{txt}{ralign 22 : num_ind_small} {c |}{res}{ralign 0:     1663  1555.91{space 0}}{ralign 0:{col 45}小型企业+个}
{txt}{ralign 22 : output_ind} {c |}{res}{ralign 0:     2491  2587.39{space 0}}{ralign 0:{col 45}工业总产值+亿元}
{txt}{ralign 22 : output_ind_state} {c |}{res}{ralign 0:     1620   574.83{space 0}}{ralign 0:{col 45}#国有及国有控股+亿元}
{txt}{ralign 22 : output_ind_domestic} {c |}{res}{ralign 0:     2441  1877.36{space 0}}{ralign 0:{col 45}#内资企业+亿元}
{txt}{ralign 22 : output_ind_hmt} {c |}{res}{ralign 0:     2186   362.81{space 0}}{ralign 0:{col 45}港澳台商投资企业+亿元}
{txt}{ralign 22 : output_ind_frn} {c |}{res}{ralign 0:     2200   537.47{space 0}}{ralign 0:{col 45}外商投资企业+亿元}
{txt}{ralign 22 : inc_ind} {c |}{res}{ralign 0:     1188   541.30{space 0}}{ralign 0:{col 45}工业企业增加值+亿元}
{txt}{ralign 22 : index_inc_ind} {c |}{res}{ralign 0:     1028   121.58{space 0}}{ralign 0:{col 45}工业企业增加值指数+上年=100}
{txt}{ralign 22 : asset} {c |}{res}{ralign 0:     2865  2949.08{space 0}}{ralign 0:{col 45}#资产合计+亿元}
{txt}{ralign 22 : debt} {c |}{res}{ralign 0:     2870  1528.24{space 0}}{ralign 0:{col 45}#负债合计+亿元}
{txt}{ralign 22 : revenue} {c |}{res}{ralign 0:     2865  2591.43{space 0}}{ralign 0:{col 45}#主营业务收入+亿元}
{txt}{ralign 22 : profit} {c |}{res}{ralign 0:     2856   176.84{space 0}}{ralign 0:{col 45}#利润总额+亿元}
{txt}{ralign 22 : miles} {c |}{res}{ralign 0:     2832 17126.87{space 0}}{ralign 0:{col 45}公里里程+公里}
{txt}{ralign 22 : miles_grade} {c |}{res}{ralign 0:     2800 13561.51{space 0}}{ralign 0:{col 45}#等级公路+公里}
{txt}{ralign 22 : veh_civil} {c |}{res}{ralign 0:     2664 4.14e+05{space 0}}{ralign 0:{col 45}民用汽车拥有量+辆}
{txt}{ralign 22 : veh_private} {c |}{res}{ralign 0:     2627 3.11e+05{space 0}}{ralign 0:{col 45}#私人汽车+辆}
{txt}{ralign 22 : post_telecom} {c |}{res}{ralign 0:     2007   104.49{space 0}}{ralign 0:{col 45}邮电业务总量+亿元}
{txt}{ralign 22 : telecom} {c |}{res}{ralign 0:     2003    68.09{space 0}}{ralign 0:{col 45}电信业务总量+亿元}
{txt}{ralign 22 : landline} {c |}{res}{ralign 0:     2609   154.74{space 0}}{ralign 0:{col 45}固定电话用户+万户}
{txt}{ralign 22 : mobile} {c |}{res}{ralign 0:     2598   377.56{space 0}}{ralign 0:{col 45}移动电话用户+万户}
{txt}{ralign 22 : im_ex_port} {c |}{res}{ralign 0:     2915 1.19e+06{space 0}}{ralign 0:{col 45}货物进出口总额+万美元}
{txt}{ralign 22 : import} {c |}{res}{ralign 0:     2841 5.70e+05{space 0}}{ralign 0:{col 45}进口额+万美元}
{txt}{ralign 22 : export} {c |}{res}{ralign 0:     2908 6.37e+05{space 0}}{ralign 0:{col 45}出口额+万美元}
{txt}{ralign 22 : fdi} {c |}{res}{ralign 0:     2758 78719.71{space 0}}{ralign 0:{col 45}外商直接投资实际使用额+万美元}
{txt}{ralign 22 : savings} {c |}{res}{ralign 0:     3108  2582.24{space 0}}{ralign 0:{col 45}金融机构人民币存款+亿元}
{txt}{ralign 22 : savings_firm} {c |}{res}{ralign 0:     1964   782.46{space 0}}{ralign 0:{col 45}#企业存款}
{txt}{ralign 22 : savings_resident} {c |}{res}{ralign 0:     1976  1071.31{space 0}}{ralign 0:{col 45}#居民储蓄存款}
{txt}{ralign 22 : savings_fixed} {c |}{res}{ralign 0:     1958   647.86{space 0}}{ralign 0:{col 45}(亿元) #定期TimeDeposits}
{txt}{ralign 22 : loan} {c |}{res}{ralign 0:     3109  2212.52{space 0}}{ralign 0:{col 45}(亿元) 金融机构人民币贷款(亿元)TotalLoans(100millionyuan)}
{txt}{ralign 22 : loan_ind} {c |}{res}{ralign 0:     1538   166.99{space 0}}{ralign 0:{col 45}(亿元) #工业贷款LoanstoIndus-trial}
{txt}{ralign 22 : loan_busi} {c |}{res}{ralign 0:     1551    85.17{space 0}}{ralign 0:{col 45}(亿元) #商业贷款LoanstoCom-mercial}
{txt}{ralign 22 : loan_agri} {c |}{res}{ralign 0:     1545    85.95{space 0}}{ralign 0:{col 45}(亿元) #农业贷款LoanstoAgricul-tural}
{txt}{ralign 22 : fisexp_agri} {c |}{res}{ralign 0:     2693    26.65{space 0}}{ralign 0:{col 45}#农林水利事务}
{txt}{ralign 22 : fisexp_health} {c |}{res}{ralign 0:     2765    19.23{space 0}}{ralign 0:{col 45}#医疗卫生}
{txt}{ralign 22 : house_rural} {c |}{res}{ralign 0:     2385    35.59{space 0}}{ralign 0:{col 45}农村人均住房面积+平方米}
{txt}{ralign 22 : q9_1_4} {c |}{res}{ralign 0:      416    99.53{space 0}}{ralign 0:{col 45}#国有及国有控股+个}
{txt}{ralign 22 : num_ind_dom} {c |}{res}{ralign 0:      417  1692.20{space 0}}{ralign 0:{col 45}内资企业+个}
{txt}{ralign 22 : num_ind_hmt} {c |}{res}{ralign 0:      379   181.51{space 0}}{ralign 0:{col 45}港澳台商投资企业+个}
{txt}{ralign 22 : num_ind_frn} {c |}{res}{ralign 0:      368   219.46{space 0}}{ralign 0:{col 45}外商投资企业+个}
{txt}{ralign 22 : output_ind_large} {c |}{res}{ralign 0:     1093  1321.37{space 0}}{ralign 0:{col 45}#大型企业+亿元}
{txt}{ralign 22 : output_ind_medium} {c |}{res}{ralign 0:     1200  1582.09{space 0}}{ralign 0:{col 45}中型企业+亿元}
{txt}{ralign 22 : output_ind_small} {c |}{res}{ralign 0:      832  1131.87{space 0}}{ralign 0:{col 45}小型企业+亿元}
{txt}{ralign 22 : total_equity} {c |}{res}{ralign 0:     1634  1101.31{space 0}}{ralign 0:{col 45}#所有者权益+亿元}
{txt}{ralign 22 : total_vat} {c |}{res}{ralign 0:     1627    98.33{space 0}}{ralign 0:{col 45}#本年应交增值税+亿元}
{txt}{ralign 22 : num_employee} {c |}{res}{ralign 0:      851    43.65{space 0}}{ralign 0:{col 45}从业人员年平均人数}
{txt}{ralign 22 : internet} {c |}{res}{ralign 0:     1507    95.52{space 0}}{ralign 0:{col 45}互联网宽带接入用户数+万户}
{txt}{ralign 22 : pop_per} {c |}{res}{ralign 0:     1530   499.75{space 0}}{ralign 0:{col 45}常住人口+万人}
{txt}{ralign 22 : output_ind_light} {c |}{res}{ralign 0:      823  4997.72{space 0}}{ralign 0:{col 45}#轻工业+亿元}
{txt}{ralign 22 : output_ind_heavy} {c |}{res}{ralign 0:      828  2594.82{space 0}}{ralign 0:{col 45}重工业+亿元}
{txt}{ralign 22 : savings_rmbfrn} {c |}{res}{ralign 0:     1349  3148.48{space 0}}{ralign 0:{col 45}金融机构本外币存款+亿元}
{txt}{ralign 22 : savings_cur} {c |}{res}{ralign 0:      396   608.07{space 0}}{ralign 0:{col 45}#活期}
{txt}{ralign 22 : loan_rmbfrn} {c |}{res}{ralign 0:     1346  2216.03{space 0}}{ralign 0:{col 45}金融机构本外币贷款+亿元}
{txt}{ralign 22 : q12_5_1} {c |}{res}{ralign 0:     1124  2120.76{space 0}}{ralign 0:{col 45}境内贷款}
{txt}{ralign 22 : loan_short} {c |}{res}{ralign 0:     1524   775.72{space 0}}{ralign 0:{col 45}#短期贷款+亿元}
{txt}{ralign 22 : loan_long} {c |}{res}{ralign 0:     1524  1796.41{space 0}}{ralign 0:{col 45}#中长期贷款+亿元}
{txt}{ralign 22 : loan_frn} {c |}{res}{ralign 0:      532     6.73{space 0}}{ralign 0:{col 45}境外贷款}
{txt}{ralign 22 : comhouse_sales} {c |}{res}{ralign 0:     1176   234.35{space 0}}{ralign 0:{col 45}商品房销售额+亿元}
{txt}{ralign 22 : house_sales} {c |}{res}{ralign 0:     1175   193.33{space 0}}{ralign 0:{col 45}#住宅+亿元}
{txt}{ralign 22 : comhouse_sales_area} {c |}{res}{ralign 0:     1176   392.96{space 0}}{ralign 0:{col 45}商品房销售面积+万平方米}
{txt}{ralign 22 : house_sales_area} {c |}{res}{ralign 0:     1176   347.48{space 0}}{ralign 0:{col 45}#住宅+万平方米}
{txt}{ralign 22 : house_area_urban} {c |}{res}{ralign 0:      877    34.45{space 0}}{ralign 0:{col 45}城镇人均住房建筑面积+平方米}
{txt}{ralign 22 : post} {c |}{res}{ralign 0:      984     5.55{space 0}}{ralign 0:{col 45}邮政业务总量+亿元}
{txt}{ralign 22 : savings_danwei} {c |}{res}{ralign 0:      354  1273.44{space 0}}{ralign 0:{col 45}#单位存款}
{txt}{ralign 22 : savings_geren} {c |}{res}{ralign 0:      354  1110.00{space 0}}{ralign 0:{col 45}#个人存款}
{txt}{ralign 22 : savings_deposit} {c |}{res}{ralign 0:      730  1162.19{space 0}}{ralign 0:{col 45}#储蓄存款}
{txt}{ralign 22 : house_security} {c |}{res}{ralign 0:      371    12.33{space 0}}{ralign 0:{col 45}#住房保障}
{txt}{ralign 22 : cost} {c |}{res}{ralign 0:      388  2350.49{space 0}}{ralign 0:{col 45}#主营业务成本+亿元}
{txt}{ralign 22 : code} {c |}{res}{ralign 0:     3336 3.83e+05{space 0}}{ralign 0:{col 45}行政代码}
{txt}{ralign 22 : prov} {c |}{res}{ralign 0:     3336    38.20{space 0}}{ralign 0:{col 45}省份代码}
{txt}{ralign 22 : pref} {c |}{res}{ralign 0:     3336  3829.25{space 0}}{ralign 0:{col 45}地级市代码}
{txt}{ralign 22 : level} {c |}{res}{ralign 0:     3336     2.09{space 0}}{ralign 0:{col 45}地区的行政级别，1表示省级，2表示地级市，3表示县级市}
{txt}{ralign 22 : _merge} {c |}{res}{ralign 0:     3336     3.00{space 0}}{ralign 0:{col 45}}
{txt}{ralign 22 : cit} {c |}{res}{ralign 0:     3336  1681.67{space 0}}{ralign 0:{col 45}原始文件城市名}

{com}. putexcel using test
{err}cellexplist required
{txt}{search r(100):r(100);}

{com}. help lbl

. help svvarlbl

. svvarlbl
{res} cap label variable city "原始文件城市名"
 cap label variable year "年份"
 cap label variable city1 "城市前三个字"
 cap label variable land "土地面积+平方公里"
 cap label variable pop "年底总人口+万人"
 cap label variable pop_male "男+万人"
 cap label variable pop_female "女+万人"
 cap label variable pop_birth "出生人口+万人"
 cap label variable pop_death "死亡人口+万人"
 cap label variable family "年底总户数+万户"
 cap label variable gdp "地区生产总值+亿元"
 cap label variable gdp_pri "第一产业生产总值+亿元"
 cap label variable gdp_sec "第二产业生产总值+亿元"
 cap label variable gdp_ind "工业生产总值+亿元"
 cap label variable gdp_thi "第三产业生产总值+亿元"
 cap label variable gdp_per "人均地区生产总值+元"
 cap label variable gdp_index "地区生产总值指数+上年=100"
 cap label variable gdp_index_pri "第一产业生产总值指数+上年=100"
 cap label variable gdp_index_sec "第二产业生产总值指数+上年=100"
 cap label variable gdp_index_ind "工业生产总值指数+上年=100"
 cap label variable gdp_index_thi "第三产业生产总值指数+上年=100"
 cap label variable gdp_index_per "人均地区生产总值指数+上年=100"
 cap label variable investment "全社会固定资产投资+亿元"
 cap label variable investment_urban "固定资产投资（不含农户）+亿元"
 cap label variable investment_realestate "#开发+亿元"
 cap label variable investment_rural "农村+亿元"
 cap label variable fisrev "公共财政预算收入+亿元"
 cap label variable fisrev_tax "#税收收入+亿元"
 cap label variable fisrev_tax_vat "#国内增值税+亿元"
 cap label variable fisrev_tax_op "#营业税+亿元"
 cap label variable fisrev_tax_firm "#企业所得税+亿元"
 cap label variable fisrev_tax_person "#个人所得税+亿元"
 cap label variable fisexp "公共财政预算支出+亿元"
 cap label variable fisexp_edu "#教育"
 cap label variable fisexp_security "#社会保障和就业"
 cap label variable income_rural "农村居民人均可支配收入+元"
 cap label variable expend_rural "农村居民人均消费支出+元"
 cap label variable expend_rural_food "#食品支出"
 cap label variable income_urban "城镇居民人均可支配收入+元"
 cap label variable expend_urban "城镇居民人均消费支出+元"
 cap label variable expend_urban_food "#食品支出"
 cap label variable num_ind "规模以上工业企业单位数+个"
 cap label variable num_ind_large "#大型企业+个"
 cap label variable num_ind_medium "中型企业+个"
 cap label variable num_ind_small "小型企业+个"
 cap label variable output_ind "工业总产值+亿元"
 cap label variable output_ind_state "#国有及国有控股+亿元"
 cap label variable output_ind_domestic "#内资企业+亿元"
 cap label variable output_ind_hmt "港澳台商投资企业+亿元"
 cap label variable output_ind_frn "外商投资企业+亿元"
 cap label variable inc_ind "工业企业增加值+亿元"
 cap label variable index_inc_ind "工业企业增加值指数+上年=100"
 cap label variable asset "#资产合计+亿元"
 cap label variable debt "#负债合计+亿元"
 cap label variable revenue "#主营业务收入+亿元"
 cap label variable profit "#利润总额+亿元"
 cap label variable miles "公里里程+公里"
 cap label variable miles_grade "#等级公路+公里"
 cap label variable veh_civil "民用汽车拥有量+辆"
 cap label variable veh_private "#私人汽车+辆"
 cap label variable post_telecom "邮电业务总量+亿元"
 cap label variable telecom "电信业务总量+亿元"
 cap label variable landline "固定电话用户+万户"
 cap label variable mobile "移动电话用户+万户"
 cap label variable im_ex_port "货物进出口总额+万美元"
 cap label variable import "进口额+万美元"
 cap label variable export "出口额+万美元"
 cap label variable fdi "外商直接投资实际使用额+万美元"
 cap label variable savings "金融机构人民币存款+亿元"
 cap label variable savings_firm "#企业存款"
 cap label variable savings_resident "#居民储蓄存款"
 cap label variable savings_fixed "(亿元) #定期TimeDeposits"
 cap label variable loan "(亿元) 金融机构人民币贷款(亿元)TotalLoans(100millionyuan)"
 cap label variable loan_ind "(亿元) #工业贷款LoanstoIndus-trial"
 cap label variable loan_busi "(亿元) #商业贷款LoanstoCom-mercial"
 cap label variable loan_agri "(亿元) #农业贷款LoanstoAgricul-tural"
 cap label variable fisexp_agri "#农林水利事务"
 cap label variable fisexp_health "#医疗卫生"
 cap label variable house_rural "农村人均住房面积+平方米"
 cap label variable q9_1_4 "#国有及国有控股+个"
 cap label variable num_ind_dom "内资企业+个"
 cap label variable num_ind_hmt "港澳台商投资企业+个"
 cap label variable num_ind_frn "外商投资企业+个"
 cap label variable output_ind_large "#大型企业+亿元"
 cap label variable output_ind_medium "中型企业+亿元"
 cap label variable output_ind_small "小型企业+亿元"
 cap label variable total_equity "#所有者权益+亿元"
 cap label variable total_vat "#本年应交增值税+亿元"
 cap label variable num_employee "从业人员年平均人数"
 cap label variable internet "互联网宽带接入用户数+万户"
 cap label variable pop_per "常住人口+万人"
 cap label variable output_ind_light "#轻工业+亿元"
 cap label variable output_ind_heavy "重工业+亿元"
 cap label variable savings_rmbfrn "金融机构本外币存款+亿元"
 cap label variable savings_cur "#活期"
 cap label variable loan_rmbfrn "金融机构本外币贷款+亿元"
 cap label variable q12_5_1 "境内贷款"
 cap label variable loan_short "#短期贷款+亿元"
 cap label variable loan_long "#中长期贷款+亿元"
 cap label variable loan_frn "境外贷款"
 cap label variable comhouse_sales "商品房销售额+亿元"
 cap label variable house_sales "#住宅+亿元"
 cap label variable comhouse_sales_area "商品房销售面积+万平方米"
 cap label variable house_sales_area "#住宅+万平方米"
 cap label variable house_area_urban "城镇人均住房建筑面积+平方米"
 cap label variable post "邮政业务总量+亿元"
 cap label variable savings_danwei "#单位存款"
 cap label variable savings_geren "#个人存款"
 cap label variable savings_deposit "#储蓄存款"
 cap label variable house_security "#住房保障"
 cap label variable cost "#主营业务成本+亿元"
 cap label variable code "行政代码"
 cap label variable city_shortname "城市名称的前两个汉字"
 cap label variable prov "省份代码"
 cap label variable pref "地级市代码"
 cap label variable level "地区的行政级别，1表示省级，2表示地级市，3表示县级市"
 cap label variable _merge ""
 cap label variable cit "原始文件城市名"

{com}. svvarlbl using test.xlsx, replace
{txt}Note: log f:\git\stata\output\31may2017\logfile.txt suspended for -svvarlbl-
      name:  {res}<unnamed>
       {txt}log:  {res}F:\git\stata\output\31May2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 May 2017, 19:57:52
{txt}{.-}
{smcl}
{txt}{sf}{ul off}{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}f:\git\stata\output\31may2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 May 2017, 19:57:52

{txt}Note: log f:\git\stata\output\31may2017\logfile.txt resumed after -svvarlbl-

{com}. dir
{txt}  <dir>   5/31/17 19:57  {res}.                 
{txt}  <dir>   5/31/17 19:57  {res}..                
{txt}   9.0k   5/31/17 11:40  {res}citycode_2012.do  
{txt}   5.3k   5/31/17 11:13  {res}data_2012(1).do   
{txt}   5.3k   5/31/17 11:13  {res}data_2012.do      
{txt} 210.5k   5/31/17 19:57  {res}logfile.txt       
{txt} 213.0k   5/31/17 19:14  {res}newcitycode.dta   
{txt}   7.6k   5/31/17 19:38  {res}pf01.do           
{txt}   7.1k   5/31/17 19:57  {res}test.xlsx         

{com}. svvarlbl using test.csv,  replace
{txt}Note: log f:\git\stata\output\31may2017\logfile.txt suspended for -svvarlbl-
      name:  {res}<unnamed>
       {txt}log:  {res}f:\git\stata\output\31may2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 May 2017, 19:58:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}f:\git\stata\output\31may2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 May 2017, 19:58:35

{txt}Note: log f:\git\stata\output\31may2017\logfile.txt resumed after -svvarlbl-

{com}. svvarlbl using test.txt,  replace
{txt}Note: log f:\git\stata\output\31may2017\logfile.txt suspended for -svvarlbl-
      name:  {res}<unnamed>
       {txt}log:  {res}f:\git\stata\output\31may2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}31 May 2017, 19:58:56
{txt}{.-}
{smcl}
{txt}{sf}{ul off}{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}f:\git\stata\output\31may2017\logfile.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}31 May 2017, 19:58:56

{txt}Note: log f:\git\stata\output\31may2017\logfile.txt resumed after -svvarlbl-

{com}. reg fisrev fdi

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,754
{txt}{hline 13}{c +}{hline 34}   F(1, 2752)      = {res} 10715.95
{txt}       Model {c |} {res}  310617248         1   310617248   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}   79770690     2,752  28986.4426   {txt}R-squared       ={res}    0.7957
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7956
{txt}       Total {c |} {res}  390387938     2,753  141804.554   {txt}Root MSE        =   {res} 170.25

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      fisrev{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}fdi {c |}{col 14}{res}{space 2} .0015217{col 26}{space 2} .0000147{col 37}{space 1}  103.52{col 46}{space 3}0.000{col 54}{space 4} .0014929{col 67}{space 3} .0015505
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 32.89504{col 26}{space 2} 3.444798{col 37}{space 1}    9.55{col 46}{space 3}0.000{col 54}{space 4} 26.14039{col 67}{space 3} 39.64969
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. xtsum fisrev

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
fisrev{col 10}overall {c |} {res} 137.6515   357.2081        .14    5514.84{txt} {c |}{col 69}N =    3188
{col 10}between {c |}{col 31}{res} 367.3853       .715   3659.325{txt} {c |}{col 69}n =     417
{col 10}within  {c |}{col 31}{res} 123.7372  -1386.232   2106.008{txt} {c |} T-bar = 7.64508

{com}. by year, sort: sum fisrev

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        417    76.44446    211.4393        .14    2179.46

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        415    98.11227    273.3186        .16     2785.8

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        416    117.9976    326.0205         .2    3310.32

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        398    139.0136    374.7088         .3    3649.81

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        400    173.3033    459.6207        .55    4515.72

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        400    225.1722    580.3339       1.07    5514.84

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        372    129.3312    196.9449       1.43    1510.45

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        370    146.8194    222.1954       1.82    1731.26


{com}. help xtbalance

. preserve

. xtbalance, range(2006 2013) miss(gdp)

{txt}({res}229{txt} observations deleted due to missing) 

({res}275{txt} observations deleted due to discontinues) 

{com}. xtdes

     {txt}cit:  {res}2{txt}, {res}10{txt}, ..., {res}3237                                  {txt}n ={res}        354
    {txt}year:  {res}2006, 2007, ..., 2013                             {txt}T ={res}          8
           {txt}Delta(year) = {res}1 unit
           {txt}Span(year)  = {res}8 periods
           {txt}(cit*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     8       8       8         8         8       8       8

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 8}
{res}      354    100.00  100.00{txt} {c |}  {res}11111111
{txt} {hline 27}{c +}{c -}{c -}{hline 8}
{res}      354    100.00        {txt} {c |}  {res}XXXXXXXX

{com}. by year, sort: sum fisrev

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        354    40.64576    87.37849        .19    1117.15

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        352    52.00372     112.493        .31    1492.64

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        353    62.92844    137.3361        .41    1837.32

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        352    73.67986    154.1566        .52    2026.81

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        354    92.42042    184.0922        .84    2353.93

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        354    121.3945    241.8646       1.26    3006.28

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        354     134.135    200.6692        1.5    1510.45

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        352    152.1115     226.489       1.82    1731.26


{com}. preserve
{err}already preserved
{txt}{search r(621):r(621);}

{com}. restore

. by year, sort: sum fisrev

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        417    76.44446    211.4393        .14    2179.46

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        415    98.11227    273.3186        .16     2785.8

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        416    117.9976    326.0205         .2    3310.32

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        398    139.0136    374.7088         .3    3649.81

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        400    173.3033    459.6207        .55    4515.72

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        400    225.1722    580.3339       1.07    5514.84

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        372    129.3312    196.9449       1.43    1510.45

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}fisrev {c |}{res}        370    146.8194    222.1954       1.82    1731.26


{com}. di (229+275)/8
{res}63

{com}. di 63/417*100
{res}15.107914

{com}. preserve

. xtbalance, range(2006 2013) miss(gdp)

{txt}({res}229{txt} observations deleted due to missing) 

({res}275{txt} observations deleted due to discontinues) 

{com}. by year, sort: sum(pop)

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0


{com}. br pop

. by year, sort: sum( pop)

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}          0


{com}. br pop

. br

. do "C:\Users\renqi\AppData\Local\Temp\STD00000000.tmp"
{txt}
{com}. foreach var of varlist pop-cost{c -(}
{txt}  2{com}.         destring `var', replace force
{txt}  3{com}. {c )-}
{txt}pop contains nonnumeric characters; pop {res}replaced {txt}as {res}double
{txt}(38 missing values generated)
{res}{txt}pop_male contains nonnumeric characters; pop_male {res}replaced {txt}as {res}double
{txt}(413 missing values generated)
{res}{txt}pop_female contains nonnumeric characters; pop_female {res}replaced {txt}as {res}double
{txt}(412 missing values generated)
{res}{txt}pop_birth contains nonnumeric characters; pop_birth {res}replaced {txt}as {res}double
{txt}(436 missing values generated)
{res}{txt}pop_death contains nonnumeric characters; pop_death {res}replaced {txt}as {res}double
{txt}(458 missing values generated)
{res}{txt}family contains nonnumeric characters; family {res}replaced {txt}as {res}double
{txt}(64 missing values generated)
{res}{txt}gdp already numeric; no {res}replace
{txt}gdp_pri already numeric; no {res}replace
{txt}gdp_sec already numeric; no {res}replace
{txt}gdp_ind already numeric; no {res}replace
{txt}gdp_thi already numeric; no {res}replace
{txt}gdp_per already numeric; no {res}replace
{txt}gdp_index already numeric; no {res}replace
{txt}gdp_index_pri already numeric; no {res}replace
{txt}gdp_index_sec already numeric; no {res}replace
{txt}gdp_index_ind already numeric; no {res}replace
{txt}gdp_index_thi already numeric; no {res}replace
{txt}gdp_index_per already numeric; no {res}replace
{txt}investment already numeric; no {res}replace
{txt}investment_urban already numeric; no {res}replace
{txt}investment_realestate already numeric; no {res}replace
{txt}investment_rural already numeric; no {res}replace
{txt}fisrev already numeric; no {res}replace
{txt}fisrev_tax already numeric; no {res}replace
{txt}fisrev_tax_vat already numeric; no {res}replace
{txt}fisrev_tax_op already numeric; no {res}replace
{txt}fisrev_tax_firm already numeric; no {res}replace
{txt}fisrev_tax_person already numeric; no {res}replace
{txt}fisexp already numeric; no {res}replace
{txt}fisexp_edu already numeric; no {res}replace
{txt}fisexp_security already numeric; no {res}replace
{txt}income_rural already numeric; no {res}replace
{txt}expend_rural already numeric; no {res}replace
{txt}expend_rural_food already numeric; no {res}replace
{txt}income_urban already numeric; no {res}replace
{txt}expend_urban already numeric; no {res}replace
{txt}expend_urban_food already numeric; no {res}replace
{txt}num_ind already numeric; no {res}replace
{txt}num_ind_large already numeric; no {res}replace
{txt}num_ind_medium already numeric; no {res}replace
{txt}num_ind_small already numeric; no {res}replace
{txt}output_ind already numeric; no {res}replace
{txt}output_ind_state already numeric; no {res}replace
{txt}output_ind_domestic already numeric; no {res}replace
{txt}output_ind_hmt already numeric; no {res}replace
{txt}output_ind_frn already numeric; no {res}replace
{txt}inc_ind already numeric; no {res}replace
{txt}index_inc_ind already numeric; no {res}replace
{txt}asset already numeric; no {res}replace
{txt}debt already numeric; no {res}replace
{txt}revenue already numeric; no {res}replace
{txt}profit already numeric; no {res}replace
{txt}miles already numeric; no {res}replace
{txt}miles_grade already numeric; no {res}replace
{txt}veh_civil already numeric; no {res}replace
{txt}veh_private already numeric; no {res}replace
{txt}post_telecom already numeric; no {res}replace
{txt}telecom already numeric; no {res}replace
{txt}landline already numeric; no {res}replace
{txt}mobile already numeric; no {res}replace
{txt}im_ex_port already numeric; no {res}replace
{txt}import already numeric; no {res}replace
{txt}export already numeric; no {res}replace
{txt}fdi already numeric; no {res}replace
{txt}savings already numeric; no {res}replace
{txt}savings_firm already numeric; no {res}replace
{txt}savings_resident already numeric; no {res}replace
{txt}savings_fixed already numeric; no {res}replace
{txt}loan already numeric; no {res}replace
{txt}loan_ind already numeric; no {res}replace
{txt}loan_busi already numeric; no {res}replace
{txt}loan_agri already numeric; no {res}replace
{txt}fisexp_agri already numeric; no {res}replace
{txt}fisexp_health already numeric; no {res}replace
{txt}house_rural already numeric; no {res}replace
{txt}q9_1_4 already numeric; no {res}replace
{txt}num_ind_dom already numeric; no {res}replace
{txt}num_ind_hmt already numeric; no {res}replace
{txt}num_ind_frn already numeric; no {res}replace
{txt}output_ind_large already numeric; no {res}replace
{txt}output_ind_medium already numeric; no {res}replace
{txt}output_ind_small already numeric; no {res}replace
{txt}total_equity already numeric; no {res}replace
{txt}total_vat already numeric; no {res}replace
{txt}num_employee already numeric; no {res}replace
{txt}internet already numeric; no {res}replace
{txt}pop_per already numeric; no {res}replace
{txt}output_ind_light already numeric; no {res}replace
{txt}output_ind_heavy already numeric; no {res}replace
{txt}savings_rmbfrn already numeric; no {res}replace
{txt}savings_cur already numeric; no {res}replace
{txt}loan_rmbfrn already numeric; no {res}replace
{txt}q12_5_1 already numeric; no {res}replace
{txt}loan_short already numeric; no {res}replace
{txt}loan_long already numeric; no {res}replace
{txt}loan_frn already numeric; no {res}replace
{txt}comhouse_sales already numeric; no {res}replace
{txt}house_sales already numeric; no {res}replace
{txt}comhouse_sales_area already numeric; no {res}replace
{txt}house_sales_area already numeric; no {res}replace
{txt}house_area_urban already numeric; no {res}replace
{txt}post already numeric; no {res}replace
{txt}savings_danwei already numeric; no {res}replace
{txt}savings_geren already numeric; no {res}replace
{txt}savings_deposit already numeric; no {res}replace
{txt}house_security already numeric; no {res}replace
{txt}cost already numeric; no {res}replace
{txt}
{com}. 
{txt}end of do-file

{com}. by year, sort: sum( pop)

{txt}{hline}
-> year = 2006

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}        354    348.6853    289.2839        8.2     3198.9

{txt}{hline}
-> year = 2007

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}        353    352.2008    292.8972        8.3     3235.3

{txt}{hline}
-> year = 2008

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}        344    352.6645    294.5421        8.6     3257.1

{txt}{hline}
-> year = 2009

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}        344    359.8366    299.9496        8.5     3275.6

{txt}{hline}
-> year = 2010

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}        354    362.3345    299.9879        9.6     3303.5

{txt}{hline}
-> year = 2011

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}        347    372.0922     301.923       17.8     3329.8

{txt}{hline}
-> year = 2012

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}        348    362.4966    266.1934     -340.6     1779.3

{txt}{hline}
-> year = 2013

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}pop {c |}{res}        350     365.276    272.0168        9.9     1787.2


{com}. exit, clear
